{
    "jobs": [
        {
            "jobType": "developer",
            "title": "AI Software Developer",
            "company": "Merck KGaA, Darmstadt, Germany",
            "description": "Description de l’entreprise\n\nZimmer CAS (Computer Assisted Solutions), est situé dans l’un des quartiers les plus dynamiques de Montréal, au cœur de la Cité du Multimédia à deux pas du Vieux-Montréal.\n\nZimmer CAS est une division de Zimmer Biomet, chef de file dans le domaine de la chirurgie orthopédique médicale, employant plus de 18 000 personnes à travers le monde à travailler ensemble pour permettre, à des millions de patients chaque année, de retrouver une mobilité et une vie active normale.\n\nChez Zimmer CAS nous œuvrons à développer et adapter diverses technologies au geste chirurgical orthopédique dans l’objectif d’offrir une chirurgie précise et parfaitement adapté au patient pour lui permettre de retrouver un confort et une mobilité rapide et optimal. Pour y arriver, notre équipe de R&D se démarque par son atmosphère dynamique, créative et conviviale ainsi que son processus de développement Agile. Nos mandats inclus entre autre le développement de prototypes, d'algorithmes en imagerie, de modélisation tridimensionnelle et de conception d’interfaces utilisateur adaptées au milieu médical.\n\nÀ l’affût des dernières technologies, notre équipe a entrepris l’intégration de solutions en intelligence artificielle dans notre gamme de produits, du domaine de l’imagerie médicale à la robotique chirurgicale.\n\nZimmer Biomet encourage les femmes, les personnes issues de minorités visibles ou en situation de handicap à soumettre leur candidature.\n\nDescription de poste\n\nRegorgeant de données qui ne cherchent qu’à être exploitées, nous sommes à la recherche d’un candidat passionné, créatif et capable d’appliquer les nouveaux concepts en intelligence artificielle aux différents produits développés chez Zimmer Biomet.\n\nEn tant que membre de l’équipe, vous travaillerez directement au sein du groupe PSI (Patient Specific Instrumentation) sur des produits qui permettent d’améliorer les conditions de vie de millions de patients. Les produits sur lesquels vous travaillerez couvre un éventail de produits variés touchant les remplacements d’épaules, de hanche, du genou, de la cheville et bien plus.\n\nResponsabilités principales\n• Développer et implémenter des algorithmes d'IA pour l'automatisation de la planification préopératoire, la segmentation automatique et l'évaluation automatique des images médicales (CT et IRM).\n• Intégrer des solutions d'IA dans nos applications de bureau existantes basées sur C++.\n• Collaborer avec des équipes Agile Scrum multidisciplinaires pour concevoir et mettre en œuvre des fonctionnalités logicielles innovantes.\n• Assurer la sécurité et la confidentialité des données des patients dans tous les aspects du développement logiciel.\n• Effectuer des tests unitaires et participer à des revues de code pour garantir la qualité et la fiabilité des livrables logiciels.\n• Travailler en étroite collaboration avec les parties prenantes pour comprendre les exigences et les traduire en spécifications techniques.\n\nCeci n’est pas une liste exhaustive des devoirs ou fonctions du poste et peut ne pas inclure la totalité des rôles du poste.\n\nExigences du poste (connaissances, compétences et capacités)\n• Diplôme en informatique, génie logiciel ou domaine connexe, avec une spécialisation en IA ou apprentissage automatique.\n• Expérience pratique dans le développement d'algorithmes d'IA\n• Bonne base en traitement d’image, en manipulation de données médicales 1D/2D/3D et maillages\n• Bonne connaissance en programmation Python, C++ et C#.\n• Expérience avec des frameworks d'IA tels que TensorFlow, PyTorch ou scikit-learn.\n• Excellentes compétences en communication et capacité à travailler efficacement dans un environnement Agile.\n• Connaissance des normes et réglementations relatives aux dispositifs médicaux (un atout).\n• Connaissance des principes de confidentialité et de sécurité des données médicales (un atout).\n\nDe plus, le poste exige une bonne maitrise des compétences suivantes :\n• Adaptabilité : Accepter le changement et répondre efficacement aux évolutions des exigences et des priorités du projet.\n• Collaboration : Travailler en étroite collaboration avec les membres de l'équipe issus de différents milieux et disciplines, favorisant une culture de coopération et de partage des connaissances.\n• Communication : Articuler clairement des idées, des retours et des mises à jour lors des réunions quotidiennes, de la planification des sprints et des rétrospectives.\n• Flexibilité : Volonté d'accepter de nouveaux défis et tâches en dehors de son rôle principal pour soutenir les objectifs de l'équipe et les objectifs du projet.\n• Gestion du Temps : Prioriser efficacement les tâches et gérer la charge de travail de manière à respecter les délais des sprints et les jalons du projet.\n\nDéplacements\n• Maximum de 5%\n\nMode de travail\n\nHybride avec 2 jours de presence au bureau\n\nJob title:\n\nSoftware Developer in Artificial Intelligence\n\nGRADE:\n\nZ12\n\nJob Function:\n\nEEO:\n\nFLSA:\n\nDescription\n\nZimmer CAS (Computer Assisted Solutions), is located in one of the most dynamic neighborhoods in Montreal, in the heart of the Cité du Multimédia, just next to the Old Port Montreal.\n\nZimmer CAS is a division of Zimmer Biomet, the leader in the orthopedic surgery field, employing more than 18,000 people around the world and working together to help millions of patients each year regain mobility and normal active life.\n\nAt Zimmer CAS, we work to develop and adapt various technologies to orthopedic surgery with the aim of offering precise surgery that is perfectly adapted to the patient, allowing them to get quick and optimal comfort and mobility. To achieve this, our R&D team stands out for its dynamic, creative, and friendly atmosphere in an Agile development process. Our mandates include, among other things, the development of prototypes, imaging algorithms, three-dimensional modeling, and the design of user interfaces adapted to the operating room environment.\n\nOn the edge of the latest technologies, our team has started to integrate artificial intelligence solutions into the portfolio of products covering a large spectrum from medical imaging to surgical robotics.\n\nZimmer Biomet encourages applications from women, people from visible minorities or people with disabilities.\n\nJob Summary\n\nFull of data just waiting to be trained on, we are looking for a passionate, creative candidate capable of applying new concepts in artificial intelligence to the various products developed at Zimmer Biomet.\n\nAs a member of the team, you will work directly within the PSI (Patient Specific Instrumentation) group on products that improve the living conditions of millions of patients. The products you will work on cover a wide range of products related to shoulder, hip, knee, ankle replacements, and much more.\n\nPrincipal Responsibilities\n• Develop and implement AI algorithms for automating preoperative planning, automatic segmentation, and automatic assessment of medical images (CT and MRI).\n• Integrate AI solutions into our existing C++-based desktop applications.\n• Collaborate with multidisciplinary Agile Scrum teams to design and implement innovative software features.\n• Ensure patient data security and privacy in all aspects of software development.\n• Perform unit testing and participate in code reviews to guarantee the quality and reliability of software deliverables.\n• Work closely with stakeholders to understand requirements and translate them into technical specifications.\n\nThis is not an exhaustive list of duties or functions and might not necessarily comprise all of the essential functions for purposes of the Americans with Disabilities Act.\n\nJob Requirements\n• Degree in Computer Science, Software Engineering, or related field, with a specialization in AI or machine learning.\n• Hands-on experience in developing AI algorithms.\n• Good foundation in image processing, manipulation of 1D/2D/3D medical data and meshes\n• Strong programming knowledge in Python, C++ and C#\n• Experience with AI frameworks such as TensorFlow, PyTorch, or scikit-learn.\n• Excellent communication skills and ability to work effectively in an Agile environment.\n• Familiarity with medical device standards and regulations (an asset).\n• Knowledge in patient data privacy and security principles (an asset).\n\nIn addition, this job requires strong skills in the following:\n• Adaptability: Embrace change and respond effectively to evolving project requirements and priorities.\n• Collaboration: Work closely with team members from diverse backgrounds and disciplines, fostering a culture of cooperation and knowledge sharing.\n• Communication: Clearly articulate ideas, feedback, and updates during daily stand-ups, sprint planning, and retrospective meetings.\n• Flexibility: Willingness to take on new challenges and tasks outside of one's primary role to support team objectives and project goals.\n• Time Management: Prioritize tasks efficiently and manage workload effectively to meet sprint deadlines and project milestones.\n\nTravel Requirements\n• Up to 5%\n\nWork modality\n\nHybrid with 2 days in-person at the office\n\nWhat You Can Expect\n\nZimmer CAS (Computer Assisted Solutions), is located in one of the most dynamic neighborhoods in Montreal, in the heart of the Cité du Multimédia, just next to the Old Port Montreal. It is a division of Zimmer Biomet, the leader in the orthopedic surgery field, employing more than 18,000 people around the world and working together to help millions of patients each year regain mobility and normal active life.\n\nAt Zimmer CAS, we work to develop and adapt various technologies to orthopedic surgery with the aim of offering precise surgery that is perfectly adapted to the patient, allowing them to get quick and optimal comfort and mobility. To achieve this, our R&D team stands out for its dynamic, creative, and friendly atmosphere in an Agile development process. Our mandates include, among other things, the development of prototypes, imaging algorithms, three-dimensional modeling, and the design of user interfaces adapted to the operating room environment. On the edge of the latest technologies, our team has started to integrate artificial intelligence solutions into the portfolio of products covering a large spectrum from medical imaging to surgical robotics.\n\nFull of data just waiting to be trained on, we are looking for a passionate, creative candidate capable of applying new concepts in artificial intelligence to the various products developed at Zimmer Biomet. As a member of the team, you will work directly within the PSI (Patient Specific Instrumentation) group on products that improve the living conditions of millions of patients. The products you will work on cover a wide range of products related to shoulder, hip, knee, ankle replacements, and much more. Zimmer Biomet encourages applications from women, people from visible minorities or people with disabilities.\n\nHow You'll Create Impact\n• Develop and implement AI algorithms for automating preoperative planning, automatic segmentation, and automatic assessment of medical images (CT and MRI).\n• Integrate AI solutions into our existing C++-based desktop applications.\n• Collaborate with multidisciplinary Agile Scrum teams to design and implement innovative software features.\n• Ensure patient data security and privacy in all aspects of software development.\n• Perform unit testing and participate in code reviews to guarantee the quality and reliability of software deliverables.\n• Work closely with stakeholders to understand requirements and translate them into technical specifications.\n\nThis is not an exhaustive list of duties or functions and might not necessarily comprise all of the essential functions for purposes of the Americans with Disabilities Act.\n\nWhat Makes You Stand Out\n• Degree in Computer Science, Software Engineering, or related field, with a specialization in AI or machine learning\n• Hands-on experience in developing AI algorithms\n• Good foundation in image processing, manipulation of 1D/2D/3D medical data and meshes\n• Strong programming knowledge in Python, C++ and C#\n• Experience with AI frameworks such as TensorFlow, PyTorch, or scikit-learn\n• Excellent communication skills and ability to work effectively in an Agile environment\n• Familiarity with medical device standards and regulations (an asset)\n• Knowledge in patient data privacy and security principles (an asset)\n\nYour Background\n• Adaptability: Embrace change and respond effectively to evolving project requirements and priorities.\n• Collaboration: Work closely with team members from diverse backgrounds and disciplines, fostering a culture of cooperation and knowledge sharing.\n• Communication: Clearly articulate ideas, feedback, and updates during daily stand-ups, sprint planning, and retrospective meetings.\n• Flexibility: Willingness to take on new challenges and tasks outside of one's primary role to support team objectives and project goals.\n• Time Management: Prioritize tasks efficiently\n\nTravel Expectations\n• Up to 5%\n• Hybrid work with 2 days in-person at the office\n\nEOE/M/F/Vet/Disability",
            "location": "Montreal, Quebec, Canada",
            "employmentType": "",
            "datePosted": "4 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Zimmer Biomet",
                    "url": "https://careers.zimmerbiomet.com/us/en/job/3645/AI-Software-Developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Indeed",
                    "url": "https://ca.indeed.com/viewjob?jk=f5d0336306fa3720&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/ai-software-developer-at-zimmer-biomet-4074995662?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Ladders",
                    "url": "https://www.theladders.com/job/ai-software-developer-zimmerbiometholdings-montreal-qc_78918369?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Glassdoor",
                    "url": "https://www.glassdoor.ca/job-listing/ai-software-developer-orthosoft-inc-JV_IC2296722_KO0,21_KE22,35.htm?jl=1009528231626&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Glassdoor",
                    "url": "https://www.glassdoor.com/job-listing/ai-software-developer-zimmer-biomet-JV_IC2296722_KO0,21_KE22,35.htm?jl=1009528231626&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jobs - Towards AI",
                    "url": "https://jobs.towardsai.net/job/zimmer-biomet-ai-software-developer-bobz?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "SimplyHired",
                    "url": "https://www.simplyhired.ca/job/-7y7-_XqDB43Qz3Tb_Tgw_As-LwBi1-Ob5FSlrIlOkEXTfdp7mmOyw?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Python"
                },
                {
                    "name": "C++"
                },
                {
                    "name": "C#"
                },
                {
                    "name": "Go"
                },
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "TensorFlow"
                },
                {
                    "name": "PyTorch"
                },
                {
                    "name": "Scrum"
                },
                {
                    "name": "Artificial Intelligence"
                }
            ]
        },
        {
            "jobType": "developer",
            "title": "Software Developer - Senior",
            "company": "US Tech Solutions",
            "description": "Duration: 10+ months contract\n\nJob Description:\n\n· The Client Display Solutions Team is seeking a candidate to help design and carry out the targeted-testing coverage for new dGPUs or APUs and manage the project execution. OS kernel programming experience is a plus.\n\nThe Person:\n\n· Display Quality Engineering (Linux and/or Windows) test plan development and implementation\n\n· DQE-related project management\n\n· Experience with currently-shipping client APU platforms is a plus\n\n· Fully familiar with concepts from display standards (DP, HDMI, eDP etc.)\n\nResponsibilities:\n\n· Enthusiastic about thorough test coverage execution with objective to raise the engineering product quality bar\n\n· Interest in the latest display technologies\n\n· Enjoys working in an agile team environment\n\nExperience:\n\n· 5+ years work experience\n\nSkills:\n\n· Design and implement detailed test plan for the kernel driver of new client APU or dGPU products\n\n· Drive project execution, with focus on Display Quality Engineering\n\n· Participate in new ASIC and hardware bring-up\n\n· Manage engineering product quality and other related project deliverables\n\n· Track and create related reports for the management\n\nEducation:\n\n· BS degree in Computer Science, Computer Engineering, Software Engineering, Electrical Engineering or related engineering degree\n\nAbout US Tech Solutions:\n\nUS Tech Solutions is a global staff augmentation firm providing a wide range of talent on-demand and total workforce solutions. To know more about US Tech Solutions, please visit www.ustechsolutions.com.\n\nUS Tech Solutions is an Equal Opportunity Employer.All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\n\nRecruiter Details:\n\nName: Megha\n\nEmail: meghaa@ustechsolutionsinc.com\n\nInternal Id: 24-26201",
            "location": "Markham, ON, Canada",
            "employmentType": "",
            "datePosted": "2 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/software-developer-senior-at-us-tech-solutions-4075626463?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "ZipRecruiter",
                    "url": "https://www.ziprecruiter.com/c/TekWissen-LLC/Job/Software-Developer-Senior/-in-Markham,ON?jid=0633f72fe828176f&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Adzuna",
                    "url": "https://www.adzuna.ca/details/4801428650?title=C20061_-_Senior_Software_Developer&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Talent.com",
                    "url": "https://ca.talent.com/view?id=1e7fdcca7f97&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Monster.ca",
                    "url": "https://www.monster.ca/job-openings/software-developer-senior-can-markham-on--cb3913b8-9985-4673-807a-fed1c5dad51e?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Karkidi",
                    "url": "https://www.karkidi.com/job-details/43149-senior-researcher-intelligent-software-job?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "BeBee Canada Meet Opportunities",
                    "url": "https://ca.bebee.com/job/dfa8c36140d50cb94700a7082c212ee8?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "SimplyHired",
                    "url": "https://www.simplyhired.ca/job/DBVFPZhhPs3HKqzsDGCHOpn0hC4R5LcUwsY7b5Pg58_w5nPZT22Fkg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "C"
                },
                {
                    "name": "R"
                }
            ]
        },
        {
            "jobType": "developer",
            "title": "Software Developer 2",
            "company": "Intuit",
            "description": "Join the TurboTax technology team as a Software Developer 2 to work with millions of users and create a world-class digital product. As a leader in the industry, we are dedicated to innovation, growth, and personal development.We are hiring across multiple teams as Toronto is a growth site and we are growing across multiple product teams including: Virtual Expert Platform Team, DataX Team, AI-First Tax Experiences Team, and TurboTax Product Development Team which all require technical expertise, leadership, and a focus on quality product development. As part of these teams, you will work with exciting colleagues and utilize your proficiency in React, JavaScript, Java/Kotlin, and Python in Full-Stack/Front-End/Back-End web application development. As well as hands-on engineering experience, and AI knowledge, to create and maintain large features and capabilities to build an unrivaled TurboTax experience.Our culture is centered on continuous growth, student-teacher relationships, and learning from the people, processes, and technology around us to create amazing digital experiences for our diverse customer base. Join our team and contribute to our mission of creating a seamless and efficient tax filing experience for millions of users.\nResponsibilities\n• Contribute to the design and development of scalable, highly-available production systems and applications\n• Roughly 80-90% hands-on technical work, delivering high-quality code, resolving bugs/defects, and delivering optimizations\n• Follow and contribute to the high engineering and operational standards within the team\n• Guide and help junior engineers with technical problems\n• Partner effectively within their scrum team to identify pain points, brainstorm, and deliver solutions to customers",
            "location": "Toronto, ON, Canada",
            "employmentType": "",
            "datePosted": "",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Intuit Careers",
                    "url": "https://jobs.intuit.com/job/toronto/software-developer-2/27595/68685183008?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "ZipRecruiter",
                    "url": "https://www.ziprecruiter.com/c/Intuit/Job/Software-Developer-2/-in-Toronto,ON?jid=f9738037e2ff9d4d&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Indeed",
                    "url": "https://ca.indeed.com/viewjob?jk=41290650bca053b7&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/software-developer-2-at-intuit-4040494325?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Glassdoor",
                    "url": "https://www.glassdoor.ca/job-listing/software-developer-2-intuit-JV_IC2281069_KO0,20_KE21,27.htm?jl=1009425140891&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "SimplyHired",
                    "url": "https://www.simplyhired.ca/job/ezkg2bD6xTtVdVN0WSTzHrxVb1ev0Kg3czxDYg-wKAWfac5kOlHuqA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Ladders",
                    "url": "https://www.theladders.com/job/software-developer-2-intuit-toronto-on_75832857?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Taro",
                    "url": "https://www.jointaro.com/jobs/intuit/software-developer-2/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Python"
                },
                {
                    "name": "Java"
                },
                {
                    "name": "JavaScript"
                },
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Kotlin"
                },
                {
                    "name": "React"
                }
            ]
        },
        {
            "jobType": "developer",
            "title": "Software Developer II",
            "company": "WARNERMEDIA",
            "description": "Welcome to Warner Bros. Discovery… the stuff dreams are made of.\n\nWho We Are…\n\nWhen we say, “the stuff dreams are made of,” we’re not just referring to the world of wizards, dragons and superheroes, or even to the wonders of Planet Earth. Behind WBD’s vast portfolio of iconic content and beloved brands, are the storytellers bringing our characters to life, the creators bringing them to your living rooms and the dreamers creating what’s next…\n\nFrom brilliant creatives, to technology trailblazers, across the globe, WBD offers career defining opportunities, thoughtfully curated benefits, and the tools to explore and grow into your best selves. Here you are supported, here you are celebrated, here you can thrive.\n\nJob Summary\n\nWarner Brothers Discovery’s digital arm, Global Customer Experience organization is a high-performing global team working at the dynamic intersection of Technology and Entertainment. In supporting our content creators in the digital space, we continuously leverage our technological capabilities to create immersive viewing experiences for iconic brands including Max.\n\nWe are excited to be recruiting a Software Engineer II to join our Apple team.\n\nResponsibilities\n\nAs a Software Engineer II, you will work within a team of engineers to deliver new customer-facing features across our iOS and tvOS App. Ensuring these are delivered on time and meeting the high-quality standards we have within our teams. You will work closely with other engineers and your manager to plan future sprints for new features and bug fixes.\n\nTo be successful in this position, you should have a strong understanding of iOS and tvOS development as well as extensive test driven development experience. You have demonstrated the ability to use common industry tools for software development including but not limited to IDEs, build and continuous integration, source control management, code review tools, and you are able to build software in a professional team environment delivered to production using these tools. You can provide technical documentation describing your contributions and contribute enhancements to your team’s best practices.\n\nRequirements\n• 3+ years programming experience using Swift or other similar language.\n• Knowledge of or previous experience with VOD is a plus, including experience working with video playback on iOS/tvOS apps.\n• A bachelor’s degree in Computer Science, Engineering or equivalent work experience.\n• Experience building dynamic customer-facing apps that use RESTful APIs to operate. Hands-on expertise in disparate technologies, typically ranging from front-end user interfaces through to back-end systems and all points in between.\n• Knowledge of large-scale application architecture, design, implementation, and performance tuning.\n• Knowledge of development best practices including coding guidelines.\n• Experience in modern DevOps/SRE practices such as CI/CD, performance monitoring & incident management.\n• Computer Science fundamentals in object-oriented design, algorithm design, problem solving, and complexity analysis.\n• Excellent communication skills, understanding of developers’ needs and priorities.\n• Rotate follow the sun support with other team members to monitor and debug critical production issues.\n• You love to build scalable and resilient products.\n• Contribute to technical documentation.\n• Recommend technical developments and software to enhance/improve our app.\n• Desire to be involved in cross-platform projects on a large scale in 10+ countries.\n• Experience with key design and architectural patterns such as MVVM, MVP and SOLID principles.\n• Experience with Test Driven Development and associated frameworks.\n\nHow We Get Things Done…\n\nThis last bit is probably the most important! Here at WBD, our guiding principles are the core values by which we operate and are central to how we get things done. You can find them at www.wbd.com/guiding-principles/ along with some insights from the team on what they mean and how they show up in their day to day. We hope they resonate with you and look forward to discussing them during your interview.\n\nChampioning Inclusion at WBD\nWarner Bros. Discovery embraces the opportunity to build a workforce that reflects the diversity of our society and the world around us. Being an equal opportunity employer means that we take seriously our responsibility to consider qualified candidates on the basis of merit, without regard to race, color, religion, national origin, gender, sexual orientation, gender identity or expression, age, mental or physical disability, and genetic information, marital status, citizenship status, military status, protected veteran status or any other category protected by law.\n\nIf you’re a qualified candidate with a disability and you require adjustments or accommodations during the job application and/or recruitment process, please visit our accessibility page for instructions to submit your request.",
            "location": "Kanata, ON, Canada",
            "employmentType": "",
            "datePosted": "1 month ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "WBD Careers - Warner Bros. Discovery",
                    "url": "https://careers.wbd.com/global/en/job/R000085797/Software-Developer-II?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Swift"
                },
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "SOLID principles"
                }
            ]
        },
        {
            "jobType": "developer",
            "title": "Principle Software Developer - Montreal",
            "company": "Keywords Studios",
            "description": "Snowed in Studios is a game development studio based in Ottawa, Canada. As part of Keywords Studios’ Create service line, we provide support to some of the most exciting games being made today. You’ll have the chance to make a global impact, working in a studio known for shipping some of the most prestigious household names in gaming. Employee satisfaction is at the top of our priority list. We understand that you work your best when you’re in an environment conducive with collaboration, challenge and fun along with job stability. We value being transparent and providing visibility on expectations and career progression. We’re proud our efforts have been recognized by being one of the Top 5 Places to Work in Ottawa and one of the Best Places to Work in Canada by gamesindustry.biz! We are currently looking to add experienced Principle Software Developer to our already amazing team. As a “Snowmie” programmer, you will use your advanced programming skills to help our client studios bring their games to realization. You will use your passion for games, insatiable curiosity, and versatility to work on a variety of projects and across all aspects of game development. In return, you will be part of a creative and supportive team environment with the ability to have a direct impact on the development of top-tier games. Are you up for the challenge? Some of the cool stuff you’ll be doing: Working closely with client studios to bring their games to realization Designing, implementing, and debugging game features Working on game toolsets and pipelines Analyzing and optimizing runtimes Collaborating on systems and tools to help designers implement their creative vision Building a solid relationship with your programming peers in-house and around the world Supporting your team mates to accomplish goals What you’ll bring to the table: 15+ years professional experience Advanced programming skills in C++ with strong understanding of the fundamentals Solid programming skills in C# with a strong understanding of the fundamentals Emphasizes a deeper understanding of what the code is doing, not just that it works Experience with game engines, primarily Unreal Engine Experience working in large codebases Understands how to analyze and optimize code Strong problem-solving skills Comfortable with vector and matrix math and good with algorithms Understands various design patterns and their benefits/draw backs Experience with console development (PS5, Xbox Series X, Switch, etc.) Shipped game(s) Bonus points! Experience with mobile development Experience working directly with external clients What’s in it for you? The chance to work in triple-A, in a no-crunch modern studio with a relaxed atmosphere and a variety of work Comprehensive benefits package that covers Dental Care, Health Care (including out of country coverage), Vision Care, Long Term Disability, Physio, Massage etc. Generous leave policies include 4 weeks paid vacation (plus 1 week over the Holiday Season), unlimited sick leave and 2 paid personal days. We also provide parental leave top-up and an Employee and Family Assistance Plan that offer 24/7 free and confidential help with your physical and mental health. RRSP Matching A dynamic and supportive team environment with a range of experience and an amazing culture – we have board game nights, movie, nights, arcade tournaments, and more to help blow off steam and hang out together. The opportunity to build or expand your career the way you want to, in a smaller studio connected to a global studio family A way-cool hoodie! Additional Information: Primary Working Language: English Salary Range: $135,000-$160,000This is a remote position; however, candidates must reside in Quebec.Snowed In Studios is an equal opportunity employer and is committed to an inclusive, barrier-free recruitment and selection processes and work environments. Please let us know of any accommodations needed to ensure you have access to a fair and equitable process. Keywords Studios is dedicated to following a well-established Equal Opportunities Policy. We endeavor to create a workplace which provides for equal opportunities for all employees and potential employees. PERSONAL DATA PROTECTION POLICY Keywords Studios is strongly committed to protecting your personal information. By sending your CV/Resume, you are agreeing to our terms and conditions and consent to your data being managed and retained in accordance with our data privacy and retention policy https://www.keywordsstudios.com/en/applicant-privacy-notice/. Role Information: EN Studio: Snowed In Location: Americas, Canada, Ontario Area of Work: Game Development Service: Create Employment Type: Full Time, Permanent Working Pattern: Hybrid",
            "location": "Quebec, Canada",
            "employmentType": "",
            "datePosted": "6 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Keywords Studios",
                    "url": "https://www.keywordsstudios.com/en/careers/browse-careers/2v4-principle-software-developer-montreal/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "C++"
                },
                {
                    "name": "C#"
                },
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Unreal Engine"
                }
            ]
        },
        {
            "jobType": "developer",
            "title": "Software Developer III, AI/ML, Google Cloud AI",
            "company": "Google",
            "description": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Waterloo, ON, Canada; Toronto, ON, Canada.Minimum qualifications:\n• Bachelor’s degree or equivalent practical experience.\n• 2 years of experience with software development in one or more programming languages, or 1 year of experience with an advanced degree.\n• 2 years of experience with data structures or algorithms.\n• 1 year of experience with one or more of the following: Speech/audio (e.g., technology duplicating and responding to the human voice), reinforcement learning (e.g., sequential decision making), ML infrastructure, or specialization in another ML field.\n• 1 year of experience with ML infrastructure (e.g., model deployment, model evaluation, optimization, data processing, debugging).\n\nPreferred qualifications:\n• Master's degree or PhD in Computer Science or related technical fields.\n• Experience developing accessible technologies.\n\nAbout The Job\n\nGoogle's software developers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for software developers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software developer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our software developers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\n\nThe Google Cloud AI Research team addresses AI challenges motivated by Google Cloud’s mission of bringing AI to tech, healthcare, finance, retail and many other industries. We work on a range of unique problems focused on research topics that maximize scientific and real-world impact, aiming to push the state-of-the-art in AI and share findings with the broader research community. We also collaborate with product teams to bring innovations to real-world impact that benefits our customers.\n\nResponsibilities\n• Write product or system development code.\n• Collaborate with peers and stakeholders through design and code reviews to ensure best practices amongst available technologies (e.g., style guidelines, checking code in, accuracy, testability, and efficiency,)\n• Contribute to existing documentation or educational content and adapt content based on product/program updates and user feedback.\n• Triage product or system issues and debug/track/resolve by analyzing the sources of issues and the impact on hardware, network, or service operations and quality.\n• Implement solutions in one or more specialized ML areas, utilize ML infrastructure, and contribute to model optimization and data processing.\n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form .",
            "location": "Toronto, ON, Canada",
            "employmentType": "",
            "datePosted": "4 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/software-developer-iii-ai-ml-google-cloud-ai-at-google-4074458117?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Indeed",
                    "url": "https://ca.indeed.com/viewjob?jk=31ece584e3116d47&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Fairygodboss",
                    "url": "https://fairygodboss.com/jobs/google/software-developer-iii-ai-ml-google-cloud-ai-ef6fb89cee36102befb9815e20cde102?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Glassdoor",
                    "url": "https://www.glassdoor.ca/job-listing/software-developer-iii-ai-ml-google-cloud-ai-google-JV_IC2281069_KO0,44_KE45,51.htm?jl=1009526380590&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Glassdoor",
                    "url": "https://www.glassdoor.com/job-listing/software-developer-iii-ai-ml-google-cloud-ai-google-JV_IC2281069_KO0,44_KE45,51.htm?jl=1009526380590&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "SimplyHired",
                    "url": "https://www.simplyhired.ca/job/Op5Qmsp4Z_rxMcilFsd4aSrtY9sE_VtKD3SUqv3_Q4wQXMLNTZzVEw?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Talent.com",
                    "url": "https://ca.talent.com/view?id=ea0ab24c941c&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Go"
                },
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Google Cloud"
                }
            ]
        },
        {
            "jobType": "developer",
            "title": "Software Developer",
            "company": "L3Harris Technologies",
            "description": "About your next Challenge as a Software Developer:\n\nWhat will you do:\n• Understand and develop software that operates in a complex, multi-network environment;\n• Design and implementation of algorithms;\n• Interact with systems engineering on technical issues;\n• Debugging software problems;\n• Conduct independent research and provide new solutions to problems;\n• Conduct and prepare presentations and demonstrations;\n\nRequired Skills and Experiences:\n• Minimum 3-5 years software development experience in object oriented design and programming, preferably using C#, ASP.NET and .Net Core;\n• Experience with web technologies and web frameworks such as REST APIs, WebAssembly, and Blazor;\n• Experience with client/server applications and communication protocols such as WebSocket, HTTP, SSL, and SNMP;\n• Experience in Linux, and virtualization and containerization, such as Docker, Kubernetes, and ESX/i is an asset;\n• Experience designing and implementing data models in C#.Net using Entity Framework is an asset;\n• Experience in scripting languages such as Python, Perl, PowerShell, etc. is an asset;\n• Experience required with relational databases (MySQL or others) is an asset;\n• Excellent technical communication of ideas and design;\n\nPreferred Additional Skills:\n• Understanding of networking concepts, network design, network device configuration is an asset;\n• Experience developing interfaces with networking devices and other hardware is an asset;\n• Experience with message broker systems such as RabbitMQ or similar is an asset;\n• Strong organizational, analytical and problem-solving skills combined with a strong technical presence;\n• Capable of multitasking between 2 or more projects concurrently;\n• Able to work independently and in a team-based environment;\n• Strong English written and verbal communication skills\n\nEligibility Criteria (Mandatory):\n• Must be eligible for registration with the Controlled Goods Program;\n• Must be eligible to obtain and maintain a government of Canada Reliability status and Secret Level 2/NATO SECRET security clearance.\n• Must be eligible to meet the requirements for U.S. International Traffic in Arms Regulations (ITAR).\n\nL3Harris is proud to be an equal opportunity employer and is committed to treating all of its employees and job applicants with respect and dignity and to maintaining a workplace free from discrimination. Anyone applying for a position will be considered without regard to the following: race, national or ethnic origin, colour, religion, age, nationality, ancestry, ethnicity, gender, sex, sexual orientation, gender identity or expression, marital status, family status, genetic characteristics, disability, citizenship status, or conviction for an offence for which a pardon has been granted or in respect of which a record suspension has been ordered, or any other characteristic that is protected by applicable human rights legislation.\n\nL3Harris maintains a drug-free workplace and conducts pre-employment drug and alcohol testing and background checks, in accordance with applicable law. Such results are only accessible and viewed by individuals at L3Harris who have direct responsibility in the hiring process. If you fail to report for a drug and alcohol test, refuse to undergo such test or test positive for the presence of drugs or alcohol, the hiring process may be concluded or your offer of employment may be rescinded, in L3Harris’ sole discretion.",
            "location": "Ottawa, ON, Canada",
            "employmentType": "",
            "datePosted": "",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "L3Harris",
                    "url": "https://careers.l3harris.com/en/job/ottawa/software-developer/4832/71465035248?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Randstad",
                    "url": "https://www.randstad.ca/jobs/software-developer_ottawa_44409735/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "IFathom",
                    "url": "https://ifathom.com/jobs/software-developer/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "ZipRecruiter",
                    "url": "https://www.ziprecruiter.com/c/Lim-Geomatics/Job/Software-Developer/-in-Ottawa,ON?jid=6003183daf395419&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Indeed",
                    "url": "https://ca.indeed.com/viewjob?jk=77ec2ae965f40927&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "SimplyHired",
                    "url": "https://www.simplyhired.ca/job/e1oYRuoCx0hEnjhQH4-Wny1C76ZQGzBKNwf5xiFNJGyKQrmimkYoUw?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/software-developer-at-trend-micro-4028861644?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Glassdoor",
                    "url": "https://www.glassdoor.ca/job-listing/software-developer-qtech-hybrid-systems-JV_IC2286068_KO0,18_KE19,39.htm?jl=1006039402015&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Python"
                },
                {
                    "name": "C#"
                },
                {
                    "name": "Go"
                },
                {
                    "name": "C"
                },
                {
                    "name": "Assembly"
                },
                {
                    "name": "PowerShell"
                },
                {
                    "name": "Perl"
                },
                {
                    "name": "SQL"
                },
                {
                    "name": "R"
                },
                {
                    "name": "MySQL"
                },
                {
                    "name": "Docker"
                },
                {
                    "name": "Kubernetes"
                },
                {
                    "name": "SSL"
                }
            ]
        },
        {
            "jobType": "developer",
            "title": "Senior Full Stack Developer",
            "company": "Luxoft",
            "description": "Project description\n\nApplying to the position, you may join one of the most respected and fastest growing institutional investors in the world. Our client is a professional investment management organization that globally invests the funds to ensure long-term sustainability. The company invests in all major asset classes, including public equity, private equity, real estate, infrastructure and fixed-income instruments.\nClient attracts and selects high-calibre individuals from top-tier institutions around the globe. Join our team and look forward to:\n• Diverse and inspiring colleagues and approachable leaders\n• Stimulating work in a fast-paced, intellectually challenging environment\n• Accelerated exposure and responsibility\n• Global career development opportunities\n• Being motivated every day by important social purpose and unshakable principles\n• A deeply rooted culture of Integrity, Partnership and High Performance\nIf you share a passion for performance, value a collegial and collaborative culture, and approach everything with the highest integrity, here's an opportunity.\n\nResponsibilities\n• Manage timelines/deliverables within the team towards the successful delivery of projects.\n• Design software solutions by interacting with portfolio managers, traders, operations staff and peers to understand requirements.\n• Develop solutions that are in line with client's technology biases, deliver efficiency and scalability, and enable new trading activities.\n• Provide knowledge transfer to team members and support staff through application demos, walkthroughs, and documentation.\n\nSKILLS\n\nMust have\n• Python\n• Angular\n• BI Tools ( Tableau is nice to have)\n• Git\n• Agile/scrum/Jira/confluence\n\nNice to have\n\nCapital market experience",
            "location": "Toronto, ON, Canada",
            "employmentType": "",
            "datePosted": "",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Luxoft",
                    "url": "https://career.luxoft.com/jobs/senior-full-stack-developer-9520?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "RBC Careers",
                    "url": "https://jobs.rbc.com/ca/en/job/R-0000102359/Senior-Full-Stack-Developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Motion Recruitment",
                    "url": "https://motionrecruitment.com/tech-jobs/toronto/direct-hire/senior-full-stack-developer/748225?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Virtusa",
                    "url": "https://www.virtusa.com/careers/ca/toronto/web-app-engineering/full-stack-developer/creq202543?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Recruiting In Motion",
                    "url": "https://jobs.recruitinginmotion.ca/jb/Senior-Full-Stack-Developer-Jobs-in-Toronto-ON/11144080?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Lever",
                    "url": "https://jobs.lever.co/blanc-labs/33927d53-39a6-4cb6-94c7-996cd96644d4?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Indeed",
                    "url": "https://ca.indeed.com/viewjob?jk=b694d5cc48f94b75&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "ZipRecruiter",
                    "url": "https://www.ziprecruiter.com/c/Royal-Bank-of-Canada/Job/Senior-Full-Stack-Developer/-in-Toronto,ON?jid=14226ca29b661c62&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Python"
                },
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Git"
                },
                {
                    "name": "Angular"
                },
                {
                    "name": "Jira"
                },
                {
                    "name": "Tableau"
                }
            ]
        },
        {
            "jobType": "developer",
            "title": "Senior Software Developer, GFT",
            "company": "Royal Bank of Canada",
            "description": "Job Summary\n\nAre you a talented, creative and results-driven professional who thrives on delivering high-performing applications? Come join us!\n\nGlobal Functions Technology (GFT) is part of RBC’s Technology and Operations division. GFT’s impact is far-reaching as we collaborate with partners from across the company to deliver innovative and transformative IT solutions. Our clients represent Risk, Finance, HR, CAO, Audit, Legal, Compliance, Financial Crime, Capital Markets, Personal and Commercial Banking and Wealth Management. We also lead the development of digital tools and platforms to enhance collaboration.\n\nThe Financial crimes – AML IT team is undertaking multiple complex regulatory initiatives as part of RBC’s Financial compliance requirements. In this role you will be responsible for strategically planning and managing successful implementation of the above mentioned. The role will coordinate, develop, lead, communicate and execute activities to ensure objectives are accomplished according on time.\n\nJob Description\n\nWHAT WILL YOU DO?\n• Manage the implementation of multiple concurrent technology initiatives of varying complexity in a time efficient manner. Monitor and control activities according to plan.\n• Continuously identify potential issues, conflicts, and risks. Analyze, mitigate and escalate where appropriate\n• Develop and execute on end-to-end delivery of technology projects and plan and execute all communication related to these.\n• Collaborate and contribute on cross-functional enterprise initiatives and manage the effective implementation of assigned deliverables.\n• Establish strong working relationships across business units and platforms to build influence and impact with key business partners. Collaborate with groups to define and achieve deliverables and ensure initiatives are effectively integrated into RBC procedures and processes.\n• Hands on development of technical modules and guide the junior developers if required.\n\nWHAT DO YOU NEED TO SUCCEED?\n\nMust have:\n• Undergraduate degree coupled with technology development experience in complex programs with high frequency of requests and multiple priorities.\n• Demonstrated ability in written and oral communication skills along with strong inter-personal and presentation skills.\n• Strong organizational, project management and time management capabilities.\n• A strong understanding of technology and/or financial services industry.\n• Deadline-driven and results-oriented; able to meet consistently high-quality standards while handling a variety of tasks and deadlines simultaneously.\n• Experience in Programming languages (Java, Scala, SQL, Unix scripting), frameworks (Spring boot, OpenShift containers), DevOps (Jenkins, UCD etc.) and Cloud (Azure, AWS etc.)\n\nNice-to-have:\n• Ability to facilitate between and influence key decision makers, strategic thinker.\n• Experience with AML domain.\n\nWhat’s in it for you?\n\nWe thrive on the challenge to be our best, progressive thinking to keep growing, and working together to deliver trusted advice to help our clients thrive and communities prosper. We care about each other, reaching our potential, making a difference to our communities, and achieving success that is mutual.\n• A comprehensive Total Rewards Program including bonuses and flexible benefits, competitive compensation, commissions, and stock where applicable\n• Leaders who support your development through coaching and managing opportunities\n• Ability to make a difference and lasting impact\n• Work in a dynamic, collaborative, progressive, and high-performing team\n• A world-class training program in financial services\n• Flexible work/life balance options\n• Opportunities to do challenging work\n\n#LI-Hybrid\n\n#LI-POST\n\nJob Skills\nActive Learning, Agile Methodology, Application Integrations, Detail-Oriented, Emerging Technologies, Enterprise Application Delivery, Group Problem Solving, Programming Languages, Software Development Life Cycle (SDLC)\n\nAdditional Job Details\n\nAddress:\n\nVANCOUVER MAIN BRANCH, 1025 GEORGIA ST W:VANCOUVER\n\nCity:\n\nVANCOUVER\n\nCountry:\n\nCanada\n\nWork hours/week:\n\n37.5\n\nEmployment Type:\n\nFull time\n\nPlatform:\n\nTECHNOLOGY AND OPERATIONS\n\nJob Type:\n\nRegular\n\nPay Type:\n\nSalaried\n\nPosted Date:\n\n2024-09-13\n\nApplication Deadline:\n\n2024-11-29\n\nNote: Applications will be accepted until 11:59 PM on the day prior to the application deadline date above\n\nInclusion and Equal Opportunity Employment\n\nAt RBC, we embrace diversity and inclusion for innovation and growth. We are committed to building inclusive teams and an equitable workplace for our employees to bring their true selves to work. We are taking actions to tackle issues of inequity and systemic bias to support our diverse talent, clients and communities.\n​​​​​​​\nWe also strive to provide an accessible candidate experience for our prospective employees with different abilities. Please let us know if you need any accommodations during the recruitment process.\n\nJoin our Talent Community\n\nStay in-the-know about great career opportunities at RBC. Sign up and get customized info on our latest jobs, career tips and Recruitment events that matter to you.\n\nExpand your limits and create a new future together at RBC. Find out how we use our passion and drive to enhance the well-being of our clients and communities at jobs.rbc.com.",
            "location": "Vancouver, BC, Canada",
            "employmentType": "",
            "datePosted": "4 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "RBC Careers",
                    "url": "https://jobs.rbc.com/ca/en/job/R-0000098936/Senior-Software-Developer-GFT?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "ZipRecruiter",
                    "url": "https://www.ziprecruiter.com/c/Royal-Bank-of-Canada/Job/Senior-Software-Developer,-GFT/-in-Vancouver,BC?jid=24cdd8e2a876b14a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Indeed",
                    "url": "https://ca.indeed.com/viewjob?jk=965edb1161150097&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Talent.com",
                    "url": "https://ca.talent.com/view?id=69e81bdb9023&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "BeBee Canada Meet Opportunities",
                    "url": "https://ca.bebee.com/job/c8a4ba3792451c91f02dfcae74b64c46?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jobillico",
                    "url": "https://www.jobillico.com/fr/offre-d-emploi/rbc-uiymvf/senior-software-developer-gft/14506110?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Fullstack Jobs",
                    "url": "https://fullstackjob.com/job/2KfZ6Em7uhGjNjZIaNVhBWwW6JZ/Senior%20Software%20Developer,%20Grow?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Glassdoor",
                    "url": "https://www.glassdoor.ca/job-listing/senior-software-developer-gft-rbc-JV_IC2278756_KO0,29_KE30,33.htm?jl=1009446547772&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Java"
                },
                {
                    "name": "C"
                },
                {
                    "name": "Scala"
                },
                {
                    "name": "SQL"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Jenkins"
                },
                {
                    "name": "AWS"
                },
                {
                    "name": "Azure"
                }
            ]
        },
        {
            "jobType": "developer",
            "title": "Software Developer – Mobile",
            "company": "Evercommerce",
            "description": "Software Developer – Mobile, Fieldpoint, (Hybrid, Toronto, ON)\n\nEverCommerce (Nasdaq: EVCM) is a leading service commerce platform, providing vertically-tailored, integrated SaaS solutions that help more than 690,000 global service-based businesses accelerate growth, streamline operations, and increase retention. Its modern digital and mobile applications create predictable, informed, and convenient experiences between customers and their service professionals. With its EverPro, EverHealth, and EverWell brands specializing in Home, Health, and Wellness service industries, EverCommerce provides end-to-end business management software, embedded payment acceptance, marketing technology, and customer experience applications. Learn more at EverCommerce.com.\n\nWe are building an extraordinary company and looking for talented, energetic, and motivated people to join our team. You can learn more about our Company, Culture and Values here: https://www.evercommerce.com/about-us/careers/\n\nWe are looking for a mid to senior full stack Software Developer to focus on our Fieldpoint brand. Fieldpoint is a developer of field service software. Our specialized integration with CRM, ERP and accounting systems provides our customers with enterprise visibility while streamlining sales and service operations. With over 25 years of experience, hundreds of valued customers in several verticals, and a solid network of reselling partners, Fieldpoint enables service organizations to run leaner, smarter and more profitably.\n\nResponsibilities:\n• Design, write, maintain, improve, support our mobile/web applications written in C#/.Net MAUI/Angular.\n• Effectively contribute suggestions and new ideas to enhance performance and usability.\n• Research and develop new solutions using new technologies to enhance our existing software applications.\n• Report to a Team Leader and/or Development Manager.\n• Willingly take on other tasks as required.\n\nRequired Experience and Skills:\n• 5+ years experience delivering scalable software solutions preferably in C#/.NET\n• 3+ years experience developing solutions using Angular\n• Strong understanding of Asynchronous programming, OOP and RESTful API design and construction\n• Contribution to the creation and maintenance of project documentation\n\nNice to haves:\n• Experience in .Net Xamarin/MAUI\n• Proficiency in HTML, CSS and SQL\n• Experience working with Docker/AWS environment\n• Experience working in an Agile development environment\n• Can translate business goals into actionable work assignments with minimal direction\n\nWhere: Hybrid (Toronto, ON)\nThe EverCommerce team is distributed globally, with teams in the U.S., Canada, Jordan, New Zealand, and Australia. We are looking for someone who is preferably close to one of our GTA offices. Please note that you must be eligible to work without sponsorship to qualify for this position, and this role may require limited travel to our Corporate Headquarters in Denver, Colorado, or to other office locations around North America.\n\nBenefits & Perks:\n• Flexibility to work – in-office, remote, or hybrid\n• Robust wellness benefits, including an annual wellness stipend\n• Flexible and generous (FTO) time-off\n• Employee Stock Purchase Program\n• Registered Retirement Savings Plan (RRSP) with 4% company match\n• Continued investment in your professional development through Udemy\n\nCompensation: The compensation for this position is $95,000 to $120,000 CAD per year. Final offer amounts are determined by multiple factors including location, local market variances, and candidate experience and expertise, and may vary from the amounts listed above.\n\nEverCommerce is an equal opportunity employer and we value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender identity, sexual orientation, age, marital status, veteran status, or disability status. We look forward to reviewing your credentials and getting to know more about your experience!",
            "location": "Oakville, ON, Canada",
            "employmentType": "",
            "datePosted": "2 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Careers At EverCommerce",
                    "url": "https://careers.evercommerce.com/us/en/job/R-104545/Software-Developer-Mobile?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/software-developer-%E2%80%93-mobile-at-evercommerce-4056358542?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "BeBee Canada Meet Opportunities",
                    "url": "https://ca.bebee.com/job/fb02cdce1518b66c59840f9314efdb56?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Adzuna",
                    "url": "https://www.adzuna.ca/details/4911031702?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jobs Trabajo.org",
                    "url": "https://ca.trabajo.org/job-3051-78023a4035d69cd03c1efe81739d78c6?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "C#"
                },
                {
                    "name": "HTML"
                },
                {
                    "name": "CSS"
                },
                {
                    "name": "C"
                },
                {
                    "name": "SQL"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Angular"
                },
                {
                    "name": "Docker"
                },
                {
                    "name": "AWS"
                }
            ]
        }
    ]
}