{
    "jobs": [
        {
            "jobType": "php_developer",
            "title": "Senior Full-Stack PHP Developer, Services",
            "company": "Equisoft",
            "description": "Senior Full-Stack PHP Developer, Services\n\nWhat is Equisoft? Equisoft is a global provider of advanced insurance and investment digital solutions, recognized as a valued partner by over 250 of the world’s leading financial institutions. We offer a complete ecosystem of end-to-end and scalable solutions that help our clients tackle any challenge in this era of digital disruption. Our business-driven approach, deep industry knowledge, innovative technology, and expert teams help our partners solve their biggest, most complex problems. With are diverse and multicultural team of experts based in North America, the Caribbean, Latin America, Europe, Africa, Asia and Australia, Equisoft helps its clients tackle any challenge in this era of digital disruption.\n\nWhy Choose Equisoft? With 950+ employees, we are a stable organization that offers career advancement and fosters a stimulant environment. If that’s not enough, then check out these other perks below:\n• Hiring Location: Canada (our local in Montreal or Quebec City office)\n• You are welcome to work in our office, hybrid or 100% remote\n• Full-time Permanent Role\n• Benefits available day 1: medical, dental, retirement plan, telemedicine program, employee assistance program, etc.\n• Flexible hours\n• Number of hours per week: 40\n• Educational Support (Udemy, LOMA Courses and Equisoft University)\n\nRole: The Senior Full-Stack PHP Developer, reports to the Manager, Software Development you will be one of the driving force behind the product Connect with 2 other PHP developers that work on this application. The candidate will collaborate in the maintenance and evolution of the application so that it can effectively support our customers as well as remain competitive on the market. If you would like to be part of a creative technical team focused on the best practices, innovation and collaborate as well as working in an agile and constantly evolving environment.\n\nEquisoft/Connect is an indispensable CRM for over 10,000 financial advisors across North America. Our tool provides for advisors a complete view of their clients' data and an up-to-date investment and insurance portfolio. It helps them provide outstanding service to as many people as possible.\n\nYour Day with Equisoft:\n\nBy joining the Equisoft, with your coffee/tea as well as your high-performance laptop, you will spend your days communicating with your team to ensure that everyone is working on what matters most. From our perspective, helping each other, sharing ideas, passion and creativity are the main key elements of our approach regarding product development. Our office life is very active, there is no doubt that you will want to keep an eye on the different threads in our slack channels in order to keep up with the social activities, laugh out loud at your colleagues' jokes or share with us your best recipe or a little slice of anecdotal life! Then, during your lunch hour, because we believe in sharing knowledge, you will have the chance to participate in training sessions given by your peers or even present one! You can also take the advantage to beat your colleagues at board games. At the end of the day, you will have an occasion to move around and play spike ball and unwind by taking part of our BBQs! All of this while contributing to the evolution of one of our core products and do much more than just code:\n• Design and implement new functionalities and to build upon the application architecture. For us, this means writing code that is robust, high-performance, secure and unwavering.\n• Collaborate in an Agile environment along with a dynamic team composed of software developers, architects, product managers and quality assurance specialists\n• Reviewing your colleagues’ code. We want to benefit from your input and expertise!\n• Actively participating in the various scrums (the daily, retrospective and planning meetings) of your team. We want to hear your opinions!\n• Participate in the analysis of functionalities regarding the business needs as well as the technological solutions.\n• Contribute and participate to the functional testing and documentation of existing and future application.\n• Ensure quality control by establishing and conducting test scenarios to validate that the systems and programs developed meet the specifications.\n• Participate in the maintenance activities of the applications and functionalities of the product.\n• Collaborate with different teams to solve customer issues.\n\nRequirements:\n\nTechnical\n• Bachelor's Degree in computer engineering or information Technology or College Diploma combined to 3 years of relevant experience\n• 7 to 10 years of experience in a similar role\n• Excellent Knowledge and experience with PHP, JavaScript, TypeScript and SQL\n• Knowledge in Kotlin and React (asset)\n• Good knowledge of SOLID principles and OOP\n• Good knowledge of TDD and unit tests\n• Knowledge of Agile and Kaban methodologies\n• Knowledge of security challenges with web-based applications\n• Experience in solving complex software engineering problems\n• Experience with functional and organic analyses\n\nSoft skills\n• Strong sense of organization and prioritizing\n• Analytical and problem-solving skills\n• Ability to communicate, write and synthesize information\n• Ability to multi-task in a rapid-paced environment\n• Team spirit, tact, diplomacy, autonomy, rigor, and discipline\n• An iron-clad dedication to quality\n• Web-based experience or academic profile\n• A spirit of collaboration\n• Have a curiosity and a thirst for learning\n• Experience in the finance industry\n• Have a good sense of humor - we like to have fun while working\n\nEquisoft is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.\n\nWe thank you for your interest in our company and we guarantee that all submitted applications will be considered.\nOnly those whose applications are selected will be contacted for interview purposes. By submitting your application, you consent to Equisoft collecting, using & storing your personal data in order to apply for a job and for Equisoft to analyze your application. Due to the nature of its products and services, Equisoft will perform thorough background checks prior to confirming one’s employment.",
            "location": "Montreal, Quebec, Canada",
            "employmentType": "",
            "datePosted": "",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Indeed",
                    "url": "https://ca.indeed.com/viewjob?jk=7bc18361f68207f7&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Ladders",
                    "url": "https://www.theladders.com/job/senior-full-stack-php-developer-services-equisoft-inc-montreal-qc_74235860?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Talentify",
                    "url": "https://www.talentify.io/job/php-full-stack-developer-services-montreal-quebec-equisoft-req1024?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "SimplyHired",
                    "url": "https://fr.simplyhired.ca/job/ajsdP_CUIvpMLbdtOyatTb9qYQqhUTmVEoeqdM3VWw-OY6vDble8iQ?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jobs Trabajo.org",
                    "url": "https://ca.trabajo.org/job-3051-5ce33adfc20708f53c550d6c9d0fff93?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "ClickaJobs",
                    "url": "https://ca.clickajobs.com/job/Senior-Full-Stack-PHP/montr%C3%A9al/25639884?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Java"
                },
                {
                    "name": "Go"
                },
                {
                    "name": "JavaScript"
                },
                {
                    "name": "TypeScript"
                },
                {
                    "name": "PHP"
                },
                {
                    "name": "C"
                },
                {
                    "name": "SQL"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Kotlin"
                },
                {
                    "name": "SOLID principles"
                },
                {
                    "name": "TDD"
                },
                {
                    "name": "React"
                }
            ]
        },
        {
            "jobType": "php_developer",
            "title": "PHP Web Developer",
            "company": "WHC Online Solutions Inc.",
            "description": "About Us\n\nAt Web Hosting Canada (WHC), we are passionate about helping Canadians succeed online by offering reliable website, domain, and email services tailored to their needs. Our mission extends beyond being a leader in online solutions—we strive to create a workplace that fosters growth, innovation, and connection. If you're someone who thrives in a dynamic, caring environment and is excited about shaping Canada's tech landscape, we'd love for you to join our team!\n\nHow You Fit In\n\nAs a PHP Back-end Web Developer working at WHC, you’ll be participating in building, improving and expanding WHC’s systems to help small businesses make the most out of their online presence. We are hiring for a fully remote position, open to applicants worldwide.\n\nYou Will Make an Impact By\n• Building new features and improvements for WHC's management platform (ERP)\n• Building new features and improvements for WHC's client-facing web platform\n• Troubleshooting and resolving incoming bugs within our production environment\n• Improving our Managed WordPress hosting application, including WordPress plugin development\n\nWho You Are:\n• You are a skilled web developer with more than 2 years with LAMP technologies like PHP, MySQL, JavaScript, Apache and HTML, and appreciate the fast development pace of Agile Methodology within a small, skilled team\n• You have some experience working with Linux on the command line, Bash, as well as version control systems like Git\n• You know WordPress or other content management systems well\n• You understand how web hosting and domain names work\n• You are autonomous, reliable, and intent on creating positive user experiences within the applications you develop.\n\nQualifications:\n• 2+ years experience with PHP web development\n• 2+ years experience working with JavaScript and jQuery\n• 2+ years experience working with MySQL and comfortable building complex SQL queries\n• Experience with code versioning tools such as Git\n• Knowledge of Bash scripting and command-line server management is an asset\n• Having completed a minimum of 3-year University level degree in Computer Science, Software/Computer Engineering, or equivalent degree\n• Good working knowledge of English both written and oral communication\n• Must pass a security background check\n\nWhat We Offer:\n• A growing tech company, with driven, passionate people and a shared purpose.\n• A modern Work From Anywhere approach to working remotely AND a new office in Montreal (with ping pong and foosball), should you choose to work from there.\n• Group insurance, personal days & other perks\n• Highly collaborative work environment with a proactive leadership team\n\nJoin us on our journey to help Canadians succeed online by delivering reliable websites, domains, and email services. Apply now to become a part of a company that values creativity, fun, and sustainability!\n\nPlease submit your resume and a cover letter (optional) detailing your experience and why you’re a great fit for the role.\n\nWHC is an equal-opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees.\n• ****\n\nÀ propos de WHC\n\nChez Hébergement Web Canada (WHC), nous sommes passionnés par l'idée d'aider les Canadiens à réussir en ligne en offrant des services fiables de sites web, de domaines et de courriels adaptés à leurs besoins. Notre mission va au-delà du simple fait d’être un leader dans les solutions en ligne—nous nous efforçons de créer un milieu de travail qui favorise la croissance, l'innovation et la connexion. Si vous êtes quelqu'un qui s'épanouit dans un environnement dynamique et bienveillant et qui est enthousiaste à l'idée de façonner le paysage technologique du Canada, nous serions ravis de vous accueillir dans notre équipe!\n\nCe qu’on recherche:\n\nHébergement Web Canada (WHC) est à la recherche d'un développeur web PHP pour participer à la création, à l'amélioration et à l'expansion des systèmes de WHC pour aider les petites entreprises à tirer le meilleur parti de leur présence en ligne. Nous recrutons pour un poste à distance, ouvert aux candidats à l'international.\n\nVous aurez un impact en...\n• Dévelopant des nouvelles fonctionnalités et améliorations à la plateforme de gestion de WHC (ERP)\n• Dévelopant des nouvelles fonctionnalités et améliorations aux plateformes et services utilisés par les clients WHC\n• Dépanner et résoudre les bugs dans notre environnement de production\n• Améliorer notre application WordPress infogérée, y compris le développement de plugins WordPress.\n\nLe/la candidat(e) idéal(e)\n• Vous êtes un développeur web expérimenté avec plus de 2 ans d'expérience avec les technologies LAMP comme PHP, MySQL, JavaScript, Apache et HTML, et appréciez le rythme rapide de développement de la méthodologie Agile au sein d'une petite équipe compétente.\n• Vous avez de l'expérience avec Linux en ligne de commande, Bash, ainsi qu'avec les systèmes de contrôle de version comme Git\n• Vous connaissez WordPress ou d'autres systèmes de gestion de contenu,\n• Vous comprenez comment fonctionne un hébergement web et un nom de domaine\n• Vous êtes autonome, fiable et axés sur la création d'une expérience utilisateur positive au sein des applications que vous développez.\n\nQualifications:\n• Plus de 2 ans d'expérience dans le développement web PHP.\n• Plus de 2 ans d'expérience à travail avec JavaScript et jQuery.\n• Plus de 2 ans d'expérience à travailler avec MySQL et confortable à construire des requêtes SQL complexes.\n• Expérience en développement sur WordPress CMS (y compris plugins/thèmes) un atout.\n• Expérience avec les outils de versionnement de code tels que Git.\n• Connaissance de l'industrie de l'hébergement, y compris le panneau de contrôle cPanel et WHMCS un atout certain.\n• Connaissance des scripts Bash et de la gestion des serveurs en ligne de commande, un atout.\n• Avoir obtenu un diplôme universitaire d'au moins trois ans en informatique, en génie logiciel ou en génie informatique, ou un diplôme équivalent.\n• Bonnes aptitudes à la communication écrite et verbale en anglais.\n• Doit réussir une vérification des antécédents en matière de sécurité.\n\nCe que nous offrons:\n• Un poste au sein d’une entreprise tech en pleine croissance, avec des gens passionnés et motivés à travailler ensemble vers un objectif commun.\n• Une nouvelle approche “Travaillez de Partout” au travail à distance ET un merveilleux bureau à Montréal, si vous choisissez d’y travailler!\n• Assurance Collective, journées personnelles et autres bénéfices\n• Un environnement de travail proactif axé sur la collaboration et dirigé par une équipe solide\n\nRejoignez-nous dans notre mission d'aider les Canadiens à réussir en ligne en offrant des services fiables de sites web, de domaines et de courriels. Postulez dès maintenant pour faire partie d'une entreprise qui valorise la créativité, le plaisir et la durabilité!\n\nMerci de soumettre votre CV et une lettre de présentation (optionnelle) qui détaille votre expérience et les raisons pour lesquelles vous conveniez parfaitement à ce poste.\n\nWHC est un employeur qui respecte le principe d’égalité d'accès à l'emploi. Nous célébrons la diversité et nous nous engageons à créer un environnement inclusif pour tous les employés.",
            "location": "Montreal, Quebec, Canada",
            "employmentType": "",
            "datePosted": "",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Indeed",
                    "url": "https://ca.indeed.com/viewjob?jk=4bbb66e490252bb2&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "ZipRecruiter",
                    "url": "https://www.ziprecruiter.com/c/WHC-Online-Solutions-Inc./Job/PHP-Web-Developer/-in-Montreal,QC?jid=46ba44eb34b51406&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Glassdoor",
                    "url": "https://www.glassdoor.ca/job-listing/php-web-developer-whc-online-solutions-inc-JV_IC2296722_KO0,17_KE18,42.htm?jl=1009452872558&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "A Beautiful Birth Doula Services",
                    "url": "https://www.beautifulbirth.co/workspread/job/php-web-developer-at-act360-web-it-inc-remote-e73fc6e83668af00jktk-d3d3LmJlYX?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Java"
                },
                {
                    "name": "Go"
                },
                {
                    "name": "JavaScript"
                },
                {
                    "name": "HTML"
                },
                {
                    "name": "PHP"
                },
                {
                    "name": "C"
                },
                {
                    "name": "Bash"
                },
                {
                    "name": "SQL"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Git"
                },
                {
                    "name": "MySQL"
                }
            ]
        },
        {
            "jobType": "php_developer",
            "title": "PHP Developers Canada",
            "company": "Kovasys",
            "description": "We are looking for PHP Developers Canada who are eligible to work in Canada.\n\nRequirements\n• 4+ years working as a PHP developer\n• Experience with Laravel or Symfony or similar frameworks\n• Good knowledge of JavaScript (nice to have experience with Angular or React)",
            "location": "Canada",
            "employmentType": "",
            "datePosted": "",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Kovasys IT Recruitment Agency",
                    "url": "https://kovasys.com/fr/job/php-developers-canada/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Java"
                },
                {
                    "name": "Go"
                },
                {
                    "name": "JavaScript"
                },
                {
                    "name": "PHP"
                },
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "React"
                },
                {
                    "name": "Angular"
                }
            ]
        },
        {
            "jobType": "php_developer",
            "title": "Full-stack PHP developer",
            "company": "Graphically Speaking",
            "description": "Careers\n\nGraphically Speaking is an industry-leading, full-service web development firm, with a full-time team of web specialists who collectively produce hundreds of websites every year.\n\nOur Value Statements:\n• Provide great value, quality and service to our customers.\n• Be a great place to work.\n• Treat others as you would like to be treated.\n• Act with honesty and integrity.\n• Individual contribution and responsibility.\n• Continuous improvement in everything we do.\n\nWe are seeking a highly motivated, energetic, passionate individual to join our team as a Full Stack PHP Developer. There is lots of room for advancement and a great environment to acquire new and refine existing skills.\n\nAbout the role:\n\nAs a Full Stack PHP Developer, you will be working closely with our Project Managers, Business Analysts, UX Designers and Digital Marketers to develop and maintain high quality websites, estimate and manage time effectively and communicate using project management software.\n\nKey Experience:\n• 5+ years of professional experience as a PHP developer\n• Experience with open source projects like WordPress, Magento 2, Drupal, etc\n• Experience with JS Frameworks, CSS3 (LESS & SASS) and HTML5\n• Experience with Rest API or Ecommerce API's (SOAP, SDK's or the like)\n• Good knowledge of versioning (Git/SVN)\n• Good knowledge of best practices\n• Must have solid projects and/or experience to demonstrate and explain your Frontend & Backend skills\n\nOther requirements:\n• Computer Diploma or Degree\n• Strong organization and communication skills\n• Outstanding attention to detail and quality control\n• Effective time management and superior organizational skills\n• Ability and desire to execute quickly and effectively in a fast-paced environment\n• Strong English skills, written and oral\n\nNice to have:\n• Proficient in LAMP stack (Linux, Apache, MySQL and PHP) setup and configurations\n• Other CMS & ecommerce solutions\n\nWhy you would want to work here?\n• Competitive salary\n• MSP coverage and extended medical and dental\n• Flex time\n• Training and an opportunity to grow and advance with a top digital agency\n• Healthy snacks!\n\nItems to include when applying:\n• Cover letter\n• Resumé\n• 2-3 links to recently completed web development projects\n\nJob Types: Full-time, Permanent\n\nExperience:\n• PHP developer: 5 years (Preferred)\n\nLocation:\n• Vancouver, BC (Required)\n\nEmail your resume and cover letter to:\n\nDarrell Hadden, President\ndarrell@graphicallyspeaking.ca\n\nPlease note, only qualified applicants will be contacted. No phone calls please.",
            "location": "Vancouver, BC, Canada",
            "employmentType": "",
            "datePosted": "",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Indeed",
                    "url": "https://ca.indeed.com/viewjob?jk=e5df1289c7d66558&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Glassdoor",
                    "url": "https://www.glassdoor.ca/job-listing/full-stack-php-developer-graphically-speaking-JV_IC2278756_KO0,24_KE25,45.htm?jl=1008377028419&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Workopolis",
                    "url": "https://www.workopolis.com/jobsearch/viewjob/3wcwZOzQBK4a5ShaffcxBqzMoCDVvKZdCLqc8wCeBMgISx3U2aNQpbkOoaJK1YxA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "SimplyHired",
                    "url": "https://www.simplyhired.ca/job/7dftR6nvLoWESHNsMEfeLaObfszxEjazFeoV89kG_cMJcSiwbsMASg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Go"
                },
                {
                    "name": "HTML"
                },
                {
                    "name": "CSS"
                },
                {
                    "name": "PHP"
                },
                {
                    "name": "C"
                },
                {
                    "name": "SQL"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Git"
                },
                {
                    "name": "SVN"
                },
                {
                    "name": "MySQL"
                }
            ]
        },
        {
            "jobType": "php_developer",
            "title": "Senior PHP Developer",
            "company": "Software International",
            "description": "Software International (SI) supplies technical talent to Fortune 100/500/1000 companies in Canada/US. We currently have a long term, renewable contract as a Senior PHP Developer with our web development and new media marketing client that primarily supports North American clients on various website and backend infrastructure services.\n\nRole(s) Required: Senior PHP Developer\n\nLocation: Remote (Canada/US or South America)\n\nRequired Start Date: ASAP\n\nRequired End Date: 12 months + renewable every year\n\nType: Contract\n\nTotal Hours Approved Per Role: 40h/week\n\nRate: $39/hr (approx $6,240 CDN/month, $4,500 USD/month)\n\nEnd Client Location: US/Canada\n\nSr. Developer (PHP Programmer)\n\nA boutique web development and new media marketing company seeking talented Senior PHP Developers.\n\nThe core product is a member-driven application that interacts internally with a multitude of systems and processes, as well as externally with affiliate applications and reporting frameworks. Payment processing and email campaign play a large role in the on-going objective to obtain new users and grow the platform.\n\nWere looking for candidates who are interested in working on a live application with real users, who want to contribute to the technical requirements of the application and the business, someone who is not shy of innovation when it comes to solving technical hurdles.\n\nThe Ideal Candidate Will:\n• Have strong knowledge of the PHP language and have experience with frameworks like Laravel, Symfony or similar.\n• Experience implementing and using RESTful APIs in a microservice architecture\n• Have usable understanding of front-end technologies.\n• Understand the concepts of object oriented programming.\n• Have familiarity with optimizing interactions with backend storage, such as MySQL.\n• Have experience developing in a largely-distributed environment.\n• Have prior experience working with the design and integration of online payment gateways such as PayPal. Stripe, PayU, Square, Visa or others\n• Be eager to make an impact on the organization.\n\nResponsibilities\n• Develop, debug, and maintain website applications using our in-house methodologies and process flows.\n• Solve complex, as well as basic, technology issues as they arise.\n• Timely communication of issues and status information to Team Leads concerning system development activities.\n• Provide architectural input for modifications to existing systems, as well as creating new systems from the ground up.\n• Working closely with the project manager and senior staff to ensure stated business objectives are met.\n• Other duties as may be assigned by management.\n\nExpert Level Skills Required In:\n• PHP (7+ years)\n• MySql (4+ years)\n• OOP Concepts (3+ years)\n• JSON\n• Remote Processing\n• Prior experience working with billing/invoice/financial software components\n\nIntermediate Level Skills Required In:\n• Linux-based systems administration\n• Knowledge of open source solutions like AWS.\n• Proficient understanding when committing code to Git, Branching and Merging code.\n• Integration of multiple data sources and databases into one system.\n• Payment Gateway Integration.\n\nAdditional Skills Preferred:\n• Large volume email dispatching\n• React\n• Javascript\n• HTML5\n• CSS3\n• RabbitMq\n• Elasticsearch\n\nJoining Period: Immediate\n\nNote : Excellent written and oral English communication skills needed, as the team is dispersed all over the globe and English is the common language.\n• Some clients are located in Canada/US, so being flexible to work on EST hours at times is key",
            "location": "Toronto, ON, Canada",
            "employmentType": "",
            "datePosted": "",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Indeed",
                    "url": "https://ca.indeed.com/viewjob?jk=4eb0fee43713c9ba&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "ZipRecruiter",
                    "url": "https://www.ziprecruiter.com/c/Targeted-Talent/Job/Senior-PHP-Developer/-in-Edmonton,AB?jid=f310f572435b822a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jobgether",
                    "url": "https://jobgether.com/offer/66319b68ebcdda2989a75c11-senior-php-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Recruiterflow",
                    "url": "https://recruiterflow.com/targetedtalent/jobs/396?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Glassdoor",
                    "url": "https://fr.glassdoor.ca/job-listing/senior-php-developer-software-international-JV_IC2281069_KO0,20_KE21,43.htm?jl=1009223131577&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Blind",
                    "url": "https://www.teamblind.com/jobs/122899248?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jooble",
                    "url": "https://ca.jooble.org/jdp/-9157316984720229052?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Who Doo U Node.com",
                    "url": "https://www.whodoounode.com/employment/senior-php-developer-listing-26650.aspx?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Java"
                },
                {
                    "name": "HTML"
                },
                {
                    "name": "CSS"
                },
                {
                    "name": "PHP"
                },
                {
                    "name": "C"
                },
                {
                    "name": "SQL"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Git"
                },
                {
                    "name": "React"
                },
                {
                    "name": "MySQL"
                },
                {
                    "name": "Elasticsearch"
                },
                {
                    "name": "AWS"
                }
            ]
        },
        {
            "jobType": "php_developer",
            "title": "Senior PHP Application Developer – CONTRACT",
            "company": "Ward Technology Talent",
            "description": "Senior PHP Applications Developer (CONTRACT)\n\nIn this role you will plan, architect, design, develop, implement, test, and solve problems with complex applications involving authentication and databases used by the end users.\n\nYou are expected to demonstrate innovation and leadership in developing and enhancing application services. As the Senior Application Developer, you participate in the future planning and direction of application services and serve as the resource on applications to other specialists, documenting code and for preparing project documentation that can be used for training purposes and for making future enhancements.\n\nResponsibilities Will Include\n• Guiding and modernizing team development efforts towards successful project delivery.\n• Providing technical guidance to other developers through mentorship.\n• Maintaining high standards of software quality within the team by establishing good practices and habits.\n• Identifying and encouraging areas for growth and improvement within the team.\n• Collaborating with other software developers and Product Delivery Leads to plan, design,\n• Develop, test, and maintain no code/low code web-based business forms and workflows and custom based applications.\n• Assisting in the collection and documentation of user requirements, development of user stories, estimates and work plans.\n• Preparing reports, analytics, manuals and other documentation on the status, operation and maintenance of applications.\n• Designing, developing, and unit testing applications in accordance with established standards.\n• Participating in peer-reviews of solution designs and related code.\n• Working with other developers in the migration of legacy applications to current technologies.\n• Analyzing and resolving technical and application problems.\n• Assessing opportunities for application and process improvement and prepare documentation of rationale to share with team members and IT management.\n• Researching and evaluating a variety of software products.\n• Executing institutional risk and security assessments with continuous improvement plans.\n\nRequired Skills\n• Bachelor’s degree in computer science or Computer/Electrical Engineering or an acceptable equivalent combination of education and experience.\n• 5+ years of recent and related experience in designing, developing and maintaining highly complex, multi-tier solutions, and enterprise-level programs in a networked environment\n• Experience in integrating databases with enterprise-grade Web technologies and projects is required.\n• Experience in Service-Oriented Architecture (SOA), Object- Oriented design architecture, and framework (e.g., Laravel).\n• Highly proficient with Web technologies and servers. (e.g., Apache, Tomcat, etc.).\n• Experience developing in Windows and Linux/Unix environments.\n• Experience in web programming and scripting, including PHP, JSON, AJAX, XML, HTML, CSS, and JavaScript.\n• Knowledge of Python and Perl will be an asset.\n• Strong database back-end skills, including design, implementation, and testing of RDBMS, OLTP, and OLAP databases, PostgreSQL, MSSQL, and MySQL.\n• Proven application development risk and security execution.\n• Experience with debugging, performance profiling and optimization, automated testing, and Cloud technologies\n• Experience with agile development methodologies including Kanban and Scrum\n• Proven strong understanding of Git version control as systems and process.\n• Experience with business process analysis, workflow modelling, software development lifecycle, secure development procedures, and creating user and technical specification documents.\n• Proficiency in professional project management methodologies and best practices.\n• Experience developing System Design documentation (SDS) and application architecture\n• Convert functional requirement document into technical document\n• Knowledge of Incident, Problem and Change management process\n• Conduct root cause analysis and prepare incident reports for the management team\n• Demonstrated ability to utilize logic in the interpretation of guidelines.\n• Superior analytical, evaluative, and problem-solving abilities.\n• Demonstrated excellent oral and written communication skills.\n• Demonstrated training and presentation expertise.\n• Demonstrated willingness to learn and develop in a new technology stack.\n\nIf you have the required experience please forward a MS Word copy of your resume.",
            "location": "Toronto, ON, Canada",
            "employmentType": "",
            "datePosted": "",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/senior-php-application-developer-%E2%80%93-contract-at-ward-technology-talent-4025768800?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jooble",
                    "url": "https://ca.jooble.org/jdp/3503230838155112526?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Talent.com",
                    "url": "https://ca.talent.com/view?id=b95ecbcbee34&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "BeBee Canada Meet Opportunities",
                    "url": "https://ca.bebee.com/job/61ae8cab18ce2bd0775968849118780e?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jobs Trabajo.org",
                    "url": "https://ca.trabajo.org/job-3051-141d167e85106d1760f5c8967255ae71?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "JobLeads",
                    "url": "https://www.jobleads.com/ca/job/senior-php-application-developer-contract--old-toronto--e73d7fba52936a5d66dd46fa9d9d59f5b?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "GrabJobs",
                    "url": "https://grabjobs.co/canada/job/full-time/others/senior-php-application-developer-contract-126420427?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Learn4Good",
                    "url": "https://www.learn4good.com/jobs/canada/info_technology/3663562118/e/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Python"
                },
                {
                    "name": "Java"
                },
                {
                    "name": "JavaScript"
                },
                {
                    "name": "HTML"
                },
                {
                    "name": "CSS"
                },
                {
                    "name": "PHP"
                },
                {
                    "name": "C"
                },
                {
                    "name": "Perl"
                },
                {
                    "name": "SQL"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Git"
                },
                {
                    "name": "MySQL"
                },
                {
                    "name": "PostgreSQL"
                },
                {
                    "name": "Scrum"
                },
                {
                    "name": "Kanban"
                }
            ]
        },
        {
            "jobType": "php_developer",
            "title": "PHP Web Developer – Toronto,ON",
            "company": "Kovasys",
            "description": "My established client in the transportation software industry is looking for a PHP Developer in the east end of Toronto.\n\nRequirements for the position include:\n\n– 4+ years of PHP developement\n\n– Experience with MYSQL\n\n– Experience with Linux\n\n– Experience with MVC / Restful",
            "location": "Toronto, ON, Canada",
            "employmentType": "",
            "datePosted": "",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Kovasys IT Recruitment Agency",
                    "url": "https://kovasys.com/job/php-web-developer-torontoon/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "PHP"
                },
                {
                    "name": "C"
                },
                {
                    "name": "SQL"
                },
                {
                    "name": "R"
                }
            ]
        },
        {
            "jobType": "php_developer",
            "title": "PHP Developer",
            "company": "CB Canada",
            "description": "Ref ID : 05050-0012410674\n\nClassification : Software Developer\n\nCompensation : DOE\n\nRobert Half has partnered with a top firm for a talented and professional long-term contract PHP Developer! Apply today if you want to be responsible for implementing new features, maintaining existing code, and refactoring existing code across a breadth of products used both internally and externally at the company.\n\nCandidates with a growth mindset and the ability to work both independently and with a team will be the best fit for this position.\n\nThis role is with a company in the Insurance industry.\n\nResponsibilities\n• Join up with Scrum team to ensure factual work estimates\n• Periodically exercise code-review and band together with other developers\n• Rectify and produce production support\n• Produce clear and consistent updates around solutions and time estimate to client-facing program management teams\n• This job might be for you if you can maintain and develop new features to internal and external facing software to enhance the customer experience and resolve issues on various operating systems\n\nJob Requirements :\n• Less than one year of experience required\n• Experience with at least one framework / library, e.g. Vue.js, Polymer, Angular.js, React.js, Ractive.js, Knockout.js, Ember.js, Bootstrap, etc.\n• Candidates who can write clean, standardized code that performs optimally in highly concurrent environments will be the best fit for this position\n• Candidates with experience with software development life cycles, e.g. Agile, Big Bang, Spiral, Waterfall, etc., will be the best fit for this position\n• Prior work with API design\n• Proven knowledge of Laravel\n• General familiarity with Lamp Stack\n• Microservices experience preferred\n• Comprehensive knowledge of MySQL\n• Well-founded grasp of PHP\n• Knowledge of SQL\n• Proficiency in SQL Queries\n• RESTful Service experience\n• We are particularly looking for candidates with familiarity with scrum\n• We are particularly looking for candidates with knowledge of education standards such as QTI / APIP, SIF, AIF\n• This position requires familiarity with full-stack development (front-end, to middle / application tier, to database)\n\nRobert Half is the world’s first and largest specialized talent solutions firm that connects highly qualified job seekers to opportunities at great companies.\n\nWe offer contract, temporary and permanent placement solutions for finance and accounting, technology, marketing and creative, legal, and administrative and customer support roles.\n\nRobert Half puts you in the best position to succeed by advocating on your behalf and promoting you to employers. We provide access to top jobs, competitive compensation and benefits, and free online training.\n\nStay on top of every opportunity even on the go. https : / / www.roberthalf.ca / en / mobile\">\n\nDownload the Robert Half app and get 1-tap apply, instant notifications for AI-matched jobs, and more.\n\nQuestions? Call your local office at 1.888.490.4429. All applicants applying for Canadian job openings must be authorized to work in Canada.\n\n2022 Robert Half. By clicking Apply Now, you’re agreeing to https : / / www.roberthalf.ca / en / terms-of-use\">\n\nRobert Half’s Terms of Use .",
            "location": "Markham, ON, Canada",
            "employmentType": "",
            "datePosted": "",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Talent.com",
                    "url": "https://ca.talent.com/view?id=72f913eeb731&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jobs Trabajo.org",
                    "url": "https://ca.trabajo.org/job-3051-c108286a28b9c35cc5626b279016def4?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "PHP"
                },
                {
                    "name": "C"
                },
                {
                    "name": "SQL"
                },
                {
                    "name": "R"
                },
                {
                    "name": "React"
                },
                {
                    "name": "Angular"
                },
                {
                    "name": "Vue.js"
                },
                {
                    "name": "Bootstrap"
                },
                {
                    "name": "MySQL"
                },
                {
                    "name": "Scrum"
                }
            ]
        },
        {
            "jobType": "php_developer",
            "title": "PHP Developer",
            "company": "Priyasoft Inc.",
            "description": "Overview\nWe are seeking a skilled and motivated PHP Developer to join our dynamic team. The ideal candidate will have a strong background in web development and a passion for creating efficient, scalable applications. You will be responsible for developing and maintaining high-quality web applications, collaborating with cross-functional teams, and contributing to the overall architecture of our systems.\n\nDuties\n• Design, develop, and maintain robust PHP applications that meet business requirements.\n• Collaborate with front-end developers to integrate user-facing elements using server-side logic.\n• Write clean, maintainable, and efficient code while adhering to best practices.\n• Troubleshoot and debug applications to optimize performance and usability.\n• Participate in code reviews and provide constructive feedback to peers.\n• Implement APIs and work with various data sources to ensure seamless integration.\n• Stay updated with emerging technologies and industry trends to continuously improve development processes.\n\nSkills\nThe successful candidate should possess the following skills:\n• Proficiency in PHP programming language.\n• Experience with front-end technologies such as Bootstrap, jQuery, and React.\n• Knowledge of version control systems like GIT.\n• Understanding of system architecture principles.\n• Experience working with Node.js and Redux is a plus.\n• Strong problem-solving skills and attention to detail.\n• Ability to work collaboratively in a team-oriented environment.\n\nIf you are passionate about web development and eager to contribute to innovative projects, we encourage you to apply for this exciting opportunity as a PHP Developer.\n\nJob Type: Fixed term contract\nContract length: 5 months\n\nPay: $18.00-$20.00 per hour\n\nExpected hours: 40 per week\n\nSchedule:\n• 8 hour shift\n• Day shift\n• Monday to Friday\n\nAbility to commute/relocate:\n• Brampton, ON: reliably commute or plan to relocate before starting work (required)\n\nEducation:\n• Bachelor's Degree (preferred)\n\nLanguage:\n• Hindi (required)\n\nWork Location: In person\n\nExpected start date: 2024-11-15",
            "location": "Brampton, ON, Canada",
            "employmentType": "",
            "datePosted": "29 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "SimplyHired",
                    "url": "https://www.simplyhired.ca/job/xY7h-RN9puiScct6oCGFVxLF83_bpWZ2LTkn4yfktYnJKSoVemBObg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "PHP"
                },
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "React"
                },
                {
                    "name": "Bootstrap"
                },
                {
                    "name": "Node.js"
                }
            ]
        },
        {
            "jobType": "php_developer",
            "title": "Canada: Intermediate PHP Developer (CANAD004002)",
            "company": "ScanSource Canada Inc.",
            "description": "Summary:\n\nWe are looking for an intermediate developer with stellar PHP and front-end experience for our web-based application. Your primary responsibility will be to provide maintenance updates and bug fixes, implement new features and improvements, and support modernization efforts for an established platform.\n\nThis position requires competency with PHP, modern front-end technologies, a solid understanding of common programming best practices, a history of building and refactoring maintainable code, and experience developing production-ready, security-conscious web applications.\n\nEffective communication is extremely important. You will be working with multiple teams at different levels of technical interests, from designers and developers to project management and other stakeholders.\n\nYou will be tasked with solving complex problems in practical and sustainable ways. Building these solutions will involve transferring knowledge to the rest of the team with an emphasis on educating and providing mentorship to less experienced team members.\n\nEssential Job Duties:\n• Build a web application as part of a team\n• Introduce new features, functionality, or improvements\n• Modernize legacy code by refactoring and redeveloping as needed\n• Implement and expand coverage of unit testing\n• Serve as a mentor to less experienced developers on the team\n• Assist with the design process of new features and provide feedback on technical feasibility and/or complexity\n• Approach software development in a manner that values the long-term benefits of building things the right way\n• Strong attention to detail, especially around code quality, performance, user experience, and accessibility\n• Commitment to continuous improvement of our systems and processes as well as personal improvement\n• Capable of communicating complex technical issues to cross-functional audiences\n• Other duties as assigned\n\nReporting Relationships:\n• Reports to Development Manager\n• Frequent interaction with Product Owners and stakeholders\n\nRequirements:\n• 3+ years of relevant software development experience shipping production-ready code\n• 2+ years of experience shipping software built on PHP\n• High proficiency in MySQL and relational database concepts, techniques, and optimizations\n• Adept front-end skills, e.g. Typescript/JavaScript/ECMAScript, Sass/SCSS/CSS, and familiarity with associated tools (npm, yarn, etc)\n• Degree in software development related field or equivalent experience\n• Proficient in use of git for version control\n\nPreferred:\n• Experience with or knowledge of server infrastructure, tools, and software\n• Knowledge of React (preferred), Angular, Vue.js, or other front-end frameworks\n• Experience with GitHub or similar\n• Experience with Docker and containerization concepts\n• Production experience with Amazon Web Services or other cloud platforms\n\nPhysical Requirements:\n• Ability to sit at a computer terminal for long periods of time.\n\nCompensation:\n\nCompensation Range: $85,000-$92,000 CAD\n\nActual annual salary offered to a candidate will be based on a number of variables including work experience, education and skills/ achievements, and will be mutually agreed upon at the time of offer. This position is not eligible for a variable pay component as part of the hiring range.\n\nWhile we’re committed to providing top-tier solutions, we’re just as committed to supporting our own team. Our employees enjoy a variety of comprehensive benefits, including medical/dental/vision coverage, life insurance, and a 401(k) plan with matching provision. Outside of CA, ScanSource grants 128 hours of paid time off (PTO) each calendar year (prorated for date of hire). In the state of CA, employees accrue a set number of hours each pay period equaling the same 128 hours of PTO. ScanSource also celebrates 8 paid company holidays.\n\nScanSource, Inc. is an Equal Opportunity Employer\n\nEOE/M/F",
            "location": "Alberta, Canada",
            "employmentType": "",
            "datePosted": "",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Indeed",
                    "url": "https://ca.indeed.com/viewjob?jk=abebeb4a1f2124e2&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Glassdoor",
                    "url": "https://www.glassdoor.ca/job-listing/canada-intermediate-php-developer-canad004002-scansource-canada-inc-JV_KO0,45_KE46,67.htm?jl=1009323517239&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Frenoaltiempo.com",
                    "url": "https://frenoaltiempo.com/career/job/php-developer-4704-at-alteo-canada-RWRMd3FXb3ViU2tNRzBLS1VDT1g2UEtkbVE9PQ==?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Sabre Foods",
                    "url": "https://sabrefoods.com/work/job/php-developer-4704-at-alteo-canada-YUkrZStaZGFweFZrd092aW1BZ04xbjB2aEE9PQ==?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Salva Lo Público",
                    "url": "https://salvalopublico.es/wp-job/job/php-developer-4704-at-alteo-canada-Q1pST01vcnBWMldxVysvTHhZbml0ZlhSSFE9PQ==?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Medinahaier",
                    "url": "https://medinahaier.com/job-library/job/php-developer-4704-at-alteo-canada-YWFjREFUeGpSd2dtb0Y1M2I2dFloai9VNXc9PQ==?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Empretus.com",
                    "url": "https://empretus.com/joblib/job/php-developer-4704-at-alteo-canada-NVQ2NUdXL1hDVU9pTGdMeTduSkt5SkNSUHc9PQ==?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Java"
                },
                {
                    "name": "JavaScript"
                },
                {
                    "name": "CSS"
                },
                {
                    "name": "PHP"
                },
                {
                    "name": "C"
                },
                {
                    "name": "SQL"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Git"
                },
                {
                    "name": "GitHub"
                },
                {
                    "name": "React"
                },
                {
                    "name": "Angular"
                },
                {
                    "name": "Vue.js"
                },
                {
                    "name": "MySQL"
                },
                {
                    "name": "Docker"
                }
            ]
        }
    ]
}