{
    "jobs": [
        {
            "jobType": "principal_software_engineer",
            "title": "Principal Software Engineer Team Lead- Canada",
            "company": "Bellwood Labs",
            "description": "About the job\n\nWe are seeking a Principal Software Engineer Team Lead to lead a successful team that is building a significant Enterprise financial product to serve as the primary technical contact with the business and provide technical and relational leadership to our team of software engineers.\n\nThis is a unique opportunity to work alongside an experienced team that excels at building quality client products at scale.\n\nQualifications\n\nEssential skills: Deep experience with Java / Spring Boot, Go, or Node, as well as Amazon Web Services (AWS) and Cloud Architecture. Familiarity with financial accounting principles and Oracle ERP is a plus.\n\nHelpful skills: Kubernetes, Docker and GitHub Actions\n\nThe role also requires a voracious appetite to learn and apply new skills. You should be skilled at building web-based software or mobile apps, and excel at building software with different sets of tools and in different client environments.\n\nKey Responsibilities include:\n• Understand the big picture and business context of the client, and collaborate with Product Owners and Business stakeholders to digest the vision of the product into Epics, Sprints, and Tasks\n• Design, build, scale, and enhance Software Products, Apps, and Platforms based on Client Needs and Business Requirements\n• Communicate Technical Topics clearly, in language that can be easily understood by Clients\n• Collaborate with Designers, and Product Teams to propose solutions to meet the goals of Clients and their Products\n• Define, refine, and document Best Practices that enable excellent team performance\n• Technical leadership of a development team, including people-leadership of up to 7 Bellwood developers\n• 4 weeks of on-site quarterly planning meetings per year in Atlanta, and up to 4 Bellwood Retreats per year\n\nWe’re looking for someone who:\n• Has 7+ years of full-stack software development experience\n• Has experience building and scaling Software Products and enjoys mentoring and leading other developers\n• Has experience architecting and deploying Software Products to Cloud Providers like Google Cloud, Amazon Web Services, or Azure\n\nTravel Requirements\n\nThis position requires mandatory travel to attend four key company events annually and four quarterly client planning events per year. These events are essential for our organizational goals and provide valuable opportunities for team engagement and collaboration. The company will arrange and cover all travel and accommodation expenses. Additional travel related to the role may also be required.\n\nBenefits\n• Hybrid/Remote Role\n• Unlimited PTO\n• Subsidized Medical, Dental, and Vision Insurance\n• Short/Long Term Disability\n• Profit Sharing\n• Referral Bonuses\n• Company Retreats\n\nCompany Description\n\nBellwood is a dynamic Product Development Consultancy. We're a team of developers, designers, marketers and entrepreneurs that companies turn to when they want to take a software product from conception to creation.\n\nOur Mission\n\nBellwood seeks to be and be known as the most trusted partner to Build and Scale software products.\n\nOur Core Values\n• We Embrace Your Goals\n• We Own our Commitments\n• We Succeed through Empathy\n• We Take the Next Step\n\nJoin our tight-knit team of sharp technologists to leverage your talents and grow your skills. We are looking forward to meeting with you!",
            "location": "Toronto, ON, Canada",
            "employmentType": "",
            "datePosted": "6 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Built In Toronto",
                    "url": "https://builtintoronto.com/job/principal-software-engineer-team-lead-canada/3561044?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "BeBee Canada Meet Opportunities",
                    "url": "https://ca.bebee.com/job/bd6a1ecb3b713f1e1d1ad8861b8819d5?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Java"
                },
                {
                    "name": "Go"
                },
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Git"
                },
                {
                    "name": "GitHub"
                },
                {
                    "name": "Spring Boot"
                },
                {
                    "name": "Docker"
                },
                {
                    "name": "Kubernetes"
                },
                {
                    "name": "GitHub Actions"
                },
                {
                    "name": "AWS"
                },
                {
                    "name": "Azure"
                },
                {
                    "name": "Google Cloud"
                }
            ]
        },
        {
            "jobType": "principal_software_engineer",
            "title": "Senior Staff / Principal Software Developer",
            "company": "Intuit",
            "description": "Come join Intuit's community of 'Builders' as a Senior Staff/ Principal Software Developer and help us power prosperity around the world.\n\nIntuit's Builders co-create with cross-functional partners and exhibit extreme ownership in the end-to-end product development lifecycle, including ideation, rapid experimentation, customer research, and execution. AI-native experiences are designed from the ground up with AI in mind, taking advantage of the unique benefits of AI to solve customers’ problems. Our Builders are customer obsessed, demonstrate boundaryless collaboration & focus on transformative AI.This is a hybrid role with the expectation of working from our Toronto office 2 days per week.\nResponsibilities\n• Drives velocity in the organization by accelerating customer, business, and technology outcomes by identifying and driving key opportunities across the company.\n• Drives significant technology initiatives end-to-end, including horizontal layers of the architecture.\n• Understands customer behaviors and partners with cross-functional partners to influence and drive end-to-end solutions for customer problems.\n• Drives design and implementation of durable software solutions that will solve critical customer problems in a fast-paced environment\n• Executes with a boundaryless mindset and contributes to solutions outsideof their primary area of ownership.\n• Knowledge of building AI native applications\n• Guides the applicability of AI to customer problemsthrough a deep understanding of the value and limitations of AI technologies.\n• Understands evaluation tools to validate and measure the accuracyof solutions.\n• High-level understanding of how AI models work, the different types of AI models that exist, and their pros and cons.\n• Understanding of the latest tools and technologies that apply AI to real-world applications.\n• Creates robust, scalable, and secure technical designs, effectively implementing them to balance short-term and long-term objectives, ensuring high availability and optimal performance of applications\n• Passionate for continuous learning, experimenting, and applyingcutting-edge technology and software paradigms to solve customer problems\n\nTeam/ Collaboration:\n• Partners with other groups both inside and outside of Intuit for cross-functional design, development, and integration\n• Works with cross-functional team members from Architecture, Product Management, and Operations to design, develop, test, and release features\n\nCommunity:\n• Contributes to standards, patterns, and best practices that improve the engineering community.\n• Provide perspective on leading industry trends, recommendations on new and emerging technologies, technology prototypes, patent proposals, and engineering process improvements.",
            "location": "Toronto, ON, Canada",
            "employmentType": "",
            "datePosted": "",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Intuit Careers",
                    "url": "https://jobs.intuit.com/job/toronto/senior-staff-principal-software-developer/27595/71143472032?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/senior-staff-principal-software-developer-at-intuit-4046734513?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Glassdoor",
                    "url": "https://www.glassdoor.ca/job-listing/senior-staff-principal-software-developer-intuit-JV_IC2281069_KO0,41_KE42,48.htm?jl=1009498159033&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Taro",
                    "url": "https://www.jointaro.com/jobs/intuit/senior-staff-software-developer-ceed5411/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "SimplyHired",
                    "url": "https://www.simplyhired.ca/job/M6nHVWuuUtKQOB9ulDXH9glG5PIuCjrjtT-ZGVUKE9ddlCddQzSKCw?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Talent.com",
                    "url": "https://ca.talent.com/view?id=e48ea437c1d5&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Ladders",
                    "url": "https://www.theladders.com/job/senior-staff-software-application-developer-marvell-toronto-on_73962201?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Ca.bebee.com",
                    "url": "https://ca.bebee.com/job/3d237c7acada0c81e2386a8931aedb13?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "C"
                },
                {
                    "name": "R"
                }
            ]
        },
        {
            "jobType": "principal_software_engineer",
            "title": "Principal Software Engineer",
            "company": "Microsoft",
            "description": "Microsoft Teams is the new chat-based application in Office 365. It's a hub for teamwork, giving teams instant access to everything they need right in Office 365. Microsoft Teams is the canvas that keeps all your content, tools, people, and conversations together in one place. It is the hottest product at Microsoft and we’re on course to disrupt the team collaboration space. You will also have the opportunity to work on generative AI, Large Language Models (LLM), and world class AI stack that power Team’s Copilot and other Team’s AI product. You will be part of a team that is at the forefront of AI innovation and research, and that leverages the latest advances in deep learning, natural language processing, and conversational AI.\n\nIn the Messaging Services team, we are continuously evolving our messaging micro-services to support new messaging features while maintaining a high performance, scalable and cost-effective eco-system. We are looking for an experienced Principal Software Engineer who can help us build revolutionary, robust and scalable back-end services. This is a unique opportunity to hone your system design skills, and will give you exposure to cutting edge technology stack (.NET Core, Typescript, Service Fabric, Redis, Azure Cosmos DB) as well as cross-org collaboration opportunities. You will have E2E (End-to-End) ownership and make huge impact in this critical area.\n\nAs a team we’re proud of what we build and how we build it. We run lean, obsess about customers and use an evidence-based approach to decision making. We have live-site first, metrics-driven culture that prevents us from accumulating debt and necessity to put out fires on daily basis. You will be in a position that carries a ton of responsibility and provides opportunities to impact customers’ satisfaction and grow the business exponentially.\n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nResponsibilities\n• Partner with appropriate stakeholders to determine user requirements for a set of scenarios.\n• Lead identification of dependencies and the development of design documents for a product, application, service, or platform and lead by example and mentor others to produce extensible and maintainable code used across products.\n• Apply state-of-the-art techniques in deep learning, natural language processing, and conversational AI to build and improve the AI capabilities of Microsoft Teams.\n• Experiment, prototype, and evaluate new ideas and approaches for AI-powered messaging features.\n• Work closely with other AI teams across Microsoft to leverage and share best practices and resources.\n• You are expected to dive deep into Azure technologies and distributed database systems. You will collaborate with partners, internal and external to Microsoft Teams organization, in order to design and build features that drive growth in our user base.\n• Leverage subject-matter expertise of cross-product features with appropriate stakeholders (e.g., project managers) to drive multiple group's project plans, release plans, and work items.\n• Other\n• Embody our culture and values\n\nQualifications\n\nRequired Qualifications:\n• Bachelor's Degree in Computer Science or related technical field AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\n• OR equivalent experience.\n\nOther Requirements:\n\nAbility to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include but are not limited to the following specialized security screenings:\n• Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n\nPreferred Qualifications:\n• Experience working with Service Fabric or Kubernetes, CosmosDB, Kafka, Event-hub, Gen AI, RAG.\n• Experience working with M365 components like AAD, Exchange, Substrate, SharePoint.\n• Drive to improve performance, availability and supportability of services.\n• Drive to increase efficiencies through automation.\n• Passionate about solving challenging problems.\n• Solid cross team/organization collaboration skills.\n\nSoftware Engineering IC5 - The typical base pay range for this role across Canada is CAD $135,800 - CAD $253,000 per year.\n\nFind additional pay information here:\n\nhttps://careers.microsoft.com/v2/global/en/canada-pay-information.html\n\nMicrosoft will accept applications for the role until November 20, 2024.\n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
            "location": "Vancouver, BC, Canada",
            "employmentType": "",
            "datePosted": "11 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Indeed",
                    "url": "https://ca.indeed.com/viewjob?jk=a7b928f301963a75&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Wellfound",
                    "url": "https://wellfound.com/jobs/3117810-principal-software-engineer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Itjobs.ca",
                    "url": "https://www.itjobs.ca/en/offer/bc/vancouver/principal-software-engineer/8e36b240-1d39-4ceb-83d0-511568ffbdcc_en/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jobillico",
                    "url": "https://www.jobillico.com/en/job-offer/microsoft-canadagOwtGc/principal-software-engineer/14798651?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Glassdoor",
                    "url": "https://www.glassdoor.ca/job-listing/principal-software-engineer-microsoft-JV_IC2278756_KO0,27_KE28,37.htm?jl=1009517097643&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Taro",
                    "url": "https://www.jointaro.com/jobs/microsoft/principal-software-engineer-5a8b589a/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "SimplyHired",
                    "url": "https://www.simplyhired.ca/job/UExRY0WIPLUlk4C1-rWILT7zmqsgQxSTXHTiAuSG4SLqSxlVVrSvpg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "BeBee Canada Meet Opportunities",
                    "url": "https://ca.bebee.com/job/d8135bc804063d3bc10a3e72c8aaa1f1?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Python"
                },
                {
                    "name": "Java"
                },
                {
                    "name": "C++"
                },
                {
                    "name": "C#"
                },
                {
                    "name": "JavaScript"
                },
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Kubernetes"
                },
                {
                    "name": "Azure"
                },
                {
                    "name": "Kafka"
                }
            ]
        },
        {
            "jobType": "principal_software_engineer",
            "title": "Principal Software Engineering Manager - AI performance",
            "company": "Microsoft",
            "description": "The Artificial Intelligence (AI) Frameworks team at Microsoft develops AI software that enables running AI models everywhere, from world’s fastest AI supercomputers, to servers, desktops, mobile phones, IoT devices and internet browsers. We collaborate with our hardware teams and partners, both internal and external, and operate at the intersection of AI algorithmic innovation, purpose-built AI hardware, systems, and software. We are a team of highly capable and motivated people that pride themselves on a collaborative and inclusive culture. \n\nWe own inference performance of OpenAI and other state of the art Large Language Models (LLMs) and work directly with OpenAI on the models hosted on the Azure OpenAI service serving some of the largest workloads on the planet with trillions of inferences per day in major Microsoft products, including Office, Windows, Bing, SQL Server, and Dynamics.\n\nAs a Principal Software Engineering Manager on the team, you will have the opportunity to work on multiple levels of the AI software stack, including the fundamental abstractions, programming models, compilers, runtimes, libraries and APIs to enable large scale training and inferencing of models. You will benchmark OpenAI and other LLMs for performance on GPUs and Microsoft HW, debug and optimize performance, monitor performance and enable these models to be deployed in the shortest amount of time and the least amount of HW possible helping achieve Microsoft Azure's capex goals.\n\n   \n\nThis is a technical management role: it requires managing an engineering team, helping set the technical direction of the team, and hands on software design and development skills. We’re looking for someone who has a demonstrated history of solving hard technical problems and is motivated to tackle the hardest problems in building a full end-to-end AI stack.  An entrepreneurial approach and ability to take initiative and move fast are essential. \n\nMicrosoft’s mission is to empower every person and every organization on the planet to achieve more. As employees we come together with a growth mindset, innovate to empower others, and collaborate to realize our shared goals. Each day we build on our values of respect, integrity, and accountability to create a culture of inclusion where everyone can thrive at work and beyond.\n\nResponsibilities\n\nManage and lead engineering team and be willing and able to be hands-on to lend momentum to the team when needed.\n• Apply engineering principles for defining robust and maintainable architectures and designs.\n• Collaborate broadly across multiple disciplines from hardware designers to ML developers.\n• Identify requirements, scope solutions, estimate work, schedule deliverables.\n• Technical leadership and mentoring of software engineers. \n• Embody our Culture and Values\n\nQualifications\n\nRequired Qualifications:\n• Bachelor's Degree in Computer Science, or related technical discipline AND 6+ years technical engineering experience with coding in languages including, but not limited to, C, C++, Python\n• OR equivalent experience.\n• 6+ years of technical leadership experience in a software team\n\nOther Requirements\n• Ability to meet Microsoft, customer and/or government security screening requirements are required for this role. These requirements include, but are not limited to the following specialized security screenings:\n• Microsoft Cloud Background Check: This position will be required to pass the Microsoft Cloud background check upon hire/transfer and every two years thereafter.\n\nPreferred Qualifications\n• Bachelor's Degree in Computer Science or related technical field AND 10+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\n• o OR Master's Degree in Computer Science or related technical field AND 8+ years technical engineering experience with coding in languages including, but not limited to, C, C++, C#, Java, JavaScript, or Python\n• o OR equivalent experience.\n• Technical background and solid foundation in software engineering principles, CPU/GPU architecture, performance analysis and optimization of high performance applications such as LLM inferencing.\n• Exposure to DNN/LLM training and inference and experience in one or more deep learning frameworks (PyTorch, TensorFlow, ONNX, etc.)\n• Ability to plan and influence technical designs on projects that will have potential long-term impact to Microsoft.\n• Great cross-team collaboration skills and the desire to collaborate in a team of researchers and developers\n• Excellent communication skills (both written and oral)\n\nSoftware Engineering M5 - The typical base pay range for this role across Canada is CAD $135,800 - CAD $253,000 per year.\n\nFind additional pay information here: https://careers.microsoft.com/v2/global/en/canada-pay-information.html\n\nMicrosoft will accept applications for the role until November 20, 2024.\n\n/span>\n\nMicrosoft is an equal opportunity employer. Consistent with applicable law, all qualified applicants will receive consideration for employment without regard to age, ancestry, citizenship, color, family or medical care leave, gender identity or expression, genetic information, immigration status, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran or military status, race, ethnicity, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable local laws, regulations and ordinances. If you need assistance and/or a reasonable accommodation due to a disability during the application process, read more about requesting accommodations.",
            "location": "Vancouver, BC, Canada",
            "employmentType": "",
            "datePosted": "4 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/principal-software-engineering-manager-ai-performance-at-microsoft-4075794643?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Indeed",
                    "url": "https://ca.indeed.com/viewjob?jk=27a58e9dfacd7e41&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Itjobs.ca",
                    "url": "https://www.itjobs.ca/en/offer/bc/vancouver/principal-software-engineering-manager-ai-performance/ca5d5c34-f176-4f79-a84f-dd92b10e7cb1_en/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jobillico",
                    "url": "https://www.jobillico.com/fr/offre-d-emploi/microsoft-canadakUjaMk/principal-software-engineering-manager-ai-performance/14835595?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Glassdoor",
                    "url": "https://fr.glassdoor.ca/job-listing/principal-software-engineering-manager-ai-performance-microsoft-JV_IC2278756_KO0,53_KE54,63.htm?jl=1009526103378&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Techjobs.ca",
                    "url": "https://www.techjobs.ca/en/offer/bc/vancouver/principal-software-engineering-manager-ai-performance/ca5d5c34-f176-4f79-a84f-dd92b10e7cb1_en/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jobs.ca",
                    "url": "https://www.jobs.ca/offer/principal-software-engineering-manager-ai-performance/ca5d5c34-f176-4f79-a84f-dd92b10e7cb1_en/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Glassdoor",
                    "url": "https://www.glassdoor.com/job-listing/principal-software-engineering-manager-ai-performance-microsoft-JV_IC2278756_KO0,53_KE54,63.htm?jl=1009526103378&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Python"
                },
                {
                    "name": "Java"
                },
                {
                    "name": "C++"
                },
                {
                    "name": "C#"
                },
                {
                    "name": "JavaScript"
                },
                {
                    "name": "C"
                },
                {
                    "name": "SQL"
                },
                {
                    "name": "R"
                },
                {
                    "name": "TensorFlow"
                },
                {
                    "name": "PyTorch"
                },
                {
                    "name": "Azure"
                },
                {
                    "name": "Artificial Intelligence"
                }
            ]
        },
        {
            "jobType": "principal_software_engineer",
            "title": "Principal Software Engineer 1 - Game of Thrones: Legends",
            "company": "Zynga",
            "description": "Zynga is a global leader in interactive entertainment with a mission to connect the world through games and a wholly-owned subsidiary of Take-Two Interactive Software, Inc. (NASDAQ: TTWO). With massive global reach in more than 175 countries and regions, the combined diverse portfolio of popular game franchises has been downloaded more than 6 billion times on mobile, including Star Wars™: Hunters, CSR Racing™, Dragon City, Empires & Puzzles™, FarmVille™, Golf Rival™, Hair Challenge™, Harry Potter: Puzzles & Spells™, High Heels!™, Merge Dragons!™, Merge Magic!™, Monster Legends, Toon Blast™, Top Eleven, Toy Blast™, Two Dots, Words With Friends™, and Zynga Poker™.Founded in 2007, Zynga is headquartered in California with locations in North America, Europe, and Asia. For more information, visit www.zynga.com or follow Zynga on Twitter, Instagram, Facebook, or the Zynga blog\n\nSummary\n\nZynga is looking for a strong principal software engineer to join our “Game of Thrones: Legends” team!\n\nAs a Principal Engineer you'll develop and architect critical game components and systems that directly relate to the success of our games. We are committed to providing an exciting and challenging career, centered around developing high quality mechanics that scale! Come join us ... and make games for a living. We are having a ball!\n\nResponsibilities\n\nCandidates will be developing primarily in Unity and C# based technology stack. Engineers work together with team members and jointly own the success of their features throughout the entire development pipeline. Stages include Design -> Architecture -> Development -> Testing -> Production Ramp. You will be joining a high quality team of dedicated individuals that are all committed to success.\n\nAdditional Responsibilities Include\n• Define, architect, & develop core engine components primarily in Unity C#\n• Develop, innovate & integrate new technologies and tools (working with content teams)\n• Build and collaborate with data objects in relational and non-relational storage models\n• Optimize code & memory for high performance and low latency\n• Scope out tasks and systems, looking for future improvements\n• Help mentor other engineers in core language and technology struggles\n\nYou will be addressing critical issues on one of our most exciting game titles. You must be able to write coherent, organized code and be comfortable working on a complicated code-base with high levels of abstraction.\n\nRequired Skills\n• BS, MS or PhD in Computer Science or related technical field (or equivalent)\n• 5+ years industry experience as a Software Developer\n• Strong programming experience in Unity C# development environments or one of the following: C/C++, Java, Python, Javascript/AJAX\n• Strong Object Oriented design and architecture skills\n• A solid foundation in computer science, with strong proficiencies in data structures, algorithms, and software design\n• Excellent communication skills - particularly the ability to discuss timelines, design concerns and provide helpful feedback to team members\n\nPluses\n\nThe following skills are considered strong plusses but are not required:\n• Prior game development experience and/or experience in live ops situations\n• Experience with GIT\n• 3rd party SDK experience\n• Experience with Amazon AWS and related technologies\n\nWhat We Offer You\n• Competitive salary, bonus plan and ESPP (Employee Stock Purchase Plan)\n• 401K Company Match Contribution (US)\n• RRSP/DPSP company match contribution (Canada)\n• Health coverage, dental, disability, critical illness, EAP, and life insurance (Canada)\n• Medical, dental, vision, EAP, life insurance, and disability benefits (US)\n• Virtual mental health and neurodiversity support programs\n• Global Fitness reimbursement program\n• Global Wellbeing Program\n• Financial wellness program with unlimited access to certified financial planners\n• Discretionary Time Off policy for many employees\n• Family planning support program\n• Generous paid parental, pregnancy-related disability, caregiver, and compassionate leaves\n• Zynga happy hours and frequent employee events\n• Flexible working hours on many teams\n• Culture of diversity and inclusion including employee resource groups\n• Work with cool people and impact millions of daily player\n\nWe will consider all qualified job-seekers with criminal histories in a manner consistent with applicable law.\n\nWe are proud to be an equal opportunity employer, which means we are committed to creating and celebrating diverse thoughts, cultures, and backgrounds throughout our organization. Employment with us is based on substantive ability, objective qualifications, and work ethic – not an individual’s race, creed, color, religion, sex or gender, gender identity or expression, sexual orientation, national origin or ancestry, alienage or citizenship status, physical or mental disability, pregnancy, age, genetic information, veteran status, marital status, status as a victim of domestic violence or sex offenses, reproductive health decision, or any other characteristics protected by applicable law.\n\nAs an equal opportunity employer, we are committed to providing the necessary support and accommodation to qualified individuals with disabilities, health conditions, or impairments (subject to any local qualifying requirements) to ensure their full participation in the job application or interview process. Please contact us at accommodationrequest@zynga.com to request any accommodations or for support related to your application for an open position.\n\nPlease be aware that Zynga does not conduct job interviews or make job offers over third-party messaging apps such as Telegram, WhatsApp, or others. Zynga also does not engage in any financial exchanges during the recruitment or onboarding process, and will never ask a candidate for their personal or financial information over an app or other unofficial chat channel. Any attempt to do so may be the result of a scamp or phishing attack, and you should not engage. Zynga’s in-house recruitment team will only contact individuals through their official Company email addresses (i.e., via a zynga.com, naturalmotion.com, smallgiantgames.com, themavens.com, gram.gs email domain).",
            "location": "Toronto, ON, Canada",
            "employmentType": "",
            "datePosted": "3 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/principal-software-engineer-1-game-of-thrones-legends-at-zynga-4076646089?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Recruit.net",
                    "url": "https://www.recruit.net/job/software-engineer-game-thrones-legends-jobs/4AC2C522BAB75E8C?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Python"
                },
                {
                    "name": "Java"
                },
                {
                    "name": "C++"
                },
                {
                    "name": "C#"
                },
                {
                    "name": "Go"
                },
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Unity"
                },
                {
                    "name": "AWS"
                }
            ]
        },
        {
            "jobType": "principal_software_engineer",
            "title": "Principal Software Engineer 2 - Game Services, ZGMT",
            "company": "Zynga",
            "description": "Zynga is a global leader in interactive entertainment with a mission to connect the world through games and a wholly-owned subsidiary of Take-Two Interactive Software, Inc. (NASDAQ: TTWO). With massive global reach in more than 175 countries and regions, the combined diverse portfolio of popular game franchises has been downloaded more than 6 billion times on mobile, including Star Wars™: Hunters, CSR Racing™, Dragon City, Empires & Puzzles™, FarmVille™, Golf Rival™, Hair Challenge™, Harry Potter: Puzzles & Spells™, High Heels!™, Merge Dragons!™, Merge Magic!™, Monster Legends, Toon Blast™, Top Eleven, Toy Blast™, Two Dots, Words With Friends™, and Zynga Poker™.Founded in 2007, Zynga is headquartered in California with locations in North America, Europe, and Asia. For more information, visit www.zynga.com or follow Zynga on Twitter, Instagram, Facebook, or the Zynga blog\n\nCome join the team at Zynga making an impact across all of the company’s games - Mobile Game Tech! On the Identity team, we focus on shared client & server tech that drives the core authentication and identification components for games. We're seeking outstanding engineers with a passion for technology and the ability to collaborate with a diverse team. The Principal Software Engineer position will play a key role in helping to architect and build backend services for our games.\n\nMain Responsibilities\n• Design and architect new backend applications/services running in AWS\n• Optimize & refactor existing services to improve reliability, scalability and to lower cost\n• Create documentation and tech plans for new architecture/system designs\n• Take a hands-on approach in architecting, writing and reviewing code.\n• Review detailed tech plans from others, aligning with the team and Zynga-wide technical vision.\n• Proactively identify & recommend improvements to address systemic pain points and tech debt.\n• Follow engineering best practices to ensure code quality, performance and reliability.\n• Work collaboratively across disciplines to understand product/customer requirements and propose technical solutions.\n• Provide production & integration support for shared technology across Zynga games.\n\nDesired Skills And Experience\n• B.S. in Computer Science, or equivalent.\n• 6+ years of hands-on software development experience.\n• Experience in programming RESTful services using Java, GoLang, and/or Python\n• Strong familiarity and experience using AWS and/or other cloud computing platforms (IaaS, PaaS, SaaS)\n• Deep understanding of algorithms, design patterns, debugging and performance optimization.\n• Excellent interpersonal skills and the ability to interface with senior leadership with confidence and clarity\n• Experience in object-oriented design of applications/systems\n• Experience with database systems (SQL, NoSQL)\n• Familiarity with containers and Kubernetes a plus\n• Familiarity with web development using JavaScript, Angular, and/or React a plus\n• Familiarity with C# and Unity a plus\n• Experience working with external groups/teams on technical implementations and procedures.\n\nWhat We Offer You\n• Competitive salary, bonus plan and ESPP (Employee Stock Purchase Plan)\n• 401K Company Match Contribution (US)\n• RRSP/DPSP company match contribution (Canada)\n• Health coverage, dental, disability, critical illness, EAP, and life insurance (Canada)\n• Medical, dental, vision, EAP, life insurance, and disability benefits (US)\n• Virtual mental health and neurodiversity support programs\n• Global Fitness reimbursement program\n• Global Wellbeing Program\n• Financial wellness program with unlimited access to certified financial planners\n• Discretionary Time Off policy for many employees\n• Family planning support program\n• Generous paid parental, pregnancy-related disability, caregiver, and compassionate leaves\n• Zynga happy hours and frequent employee events\n• Flexible working hours on many teams\n• Culture of diversity and inclusion including employee resource groups\n• Work with cool people and impact millions of daily players\n\nWe will consider all qualified job-seekers with criminal histories in a manner consistent with applicable law.\n\nWe are proud to be an equal opportunity employer, which means we are committed to creating and celebrating diverse thoughts, cultures, and backgrounds throughout our organization. Employment with us is based on substantive ability, objective qualifications, and work ethic – not an individual’s race, creed, color, religion, sex or gender, gender identity or expression, sexual orientation, national origin or ancestry, alienage or citizenship status, physical or mental disability, pregnancy, age, genetic information, veteran status, marital status, status as a victim of domestic violence or sex offenses, reproductive health decision, or any other characteristics protected by applicable law.\n\nAs an equal opportunity employer, we are committed to providing the necessary support and accommodation to qualified individuals with disabilities, health conditions, or impairments (subject to any local qualifying requirements) to ensure their full participation in the job application or interview process. Please contact us at accommodationrequest@zynga.com to request any accommodations or for support related to your application for an open position.\n\nPlease be aware that Zynga does not conduct job interviews or make job offers over third-party messaging apps such as Telegram, WhatsApp, or others. Zynga also does not engage in any financial exchanges during the recruitment or onboarding process, and will never ask a candidate for their personal or financial information over an app or other unofficial chat channel. Any attempt to do so may be the result of a scamp or phishing attack, and you should not engage. Zynga’s in-house recruitment team will only contact individuals through their official Company email addresses (i.e., via a zynga.com, naturalmotion.com, smallgiantgames.com, themavens.com, gram.gs email domain).",
            "location": "Toronto, ON, Canada",
            "employmentType": "",
            "datePosted": "3 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/principal-software-engineer-2-game-services-zgmt-at-zynga-4076646104?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Recruit.net",
                    "url": "https://www.recruit.net/job/software-engineer-game-services-zmgt-jobs/81C0CFCCEA4DE4BB?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Python"
                },
                {
                    "name": "Java"
                },
                {
                    "name": "C#"
                },
                {
                    "name": "Go"
                },
                {
                    "name": "JavaScript"
                },
                {
                    "name": "C"
                },
                {
                    "name": "SQL"
                },
                {
                    "name": "R"
                },
                {
                    "name": "React"
                },
                {
                    "name": "Angular"
                },
                {
                    "name": "Unity"
                },
                {
                    "name": "Kubernetes"
                },
                {
                    "name": "AWS"
                }
            ]
        },
        {
            "jobType": "principal_software_engineer",
            "title": "Principal Software Engineer 1 – Game of Thrones: Legends",
            "company": "Zynga",
            "description": "Careers Category: Engineering\n\nCareers location: Austin, TX; Bay Area, CA; Carlsbad, CA; Chicago, IL; Eugene, OR; Toronto, Canada\n\nConnected Worker Type: Connected\n\nRequisition Id: R_113732\n\nSummary\n\nZynga is looking for a strong principal software engineer to join our “Game of Thrones: Legends” team!\n\nAs a Principal Engineer you'll develop and architect critical game components and systems that directly relate to the success of our games. We are committed to providing an exciting and challenging career, centered around developing high quality mechanics that scale! Come join us … and make games for a living. We are having a ball!\n\nResponsibilities\n\nCandidates will be developing primarily in Unity and C# based technology stack. Engineers work together with team members and jointly own the success of their features throughout the entire development pipeline. Stages include Design -> Architecture -> Development -> Testing -> Production Ramp. You will be joining a high quality team of dedicated individuals that are all committed to success.\n\nAdditional Responsibilities\n• Define, architect, & develop core engine components primarily in Unity C#\n• Develop, innovate & integrate new technologies and tools (working with content teams)\n• Build and collaborate with data objects in relational and non-relational storage models\n• Optimize code & memory for high performance and low latency\n• Scope out tasks and systems, looking for future improvements\n• Help mentor other engineers in core language and technology struggles\n\nYou will be addressing critical issues on one of our most exciting game titles. You must be able to write coherent, organized code and be comfortable working on a complicated code-base with high levels of abstraction.\n\nRequired Skills\n• BS, MS or PhD in Computer Science or related technical field (or equivalent)\n• 5+ years industry experience as a Software Developer\n• Strong programming experience in Unity C# development environments or one of the following: C/C++, Java, Python, Javascript/AJAX\n• Strong Object Oriented design and architecture skills\n• A solid foundation in computer science, with strong proficiencies in data structures, algorithms, and software design\n• Excellent communication skills – particularly the ability to discuss timelines, design concerns and provide helpful feedback to team members\n\nPLUSES\n\nThe following skills are considered strong plusses but are not required:\n• Prior game development experience and/or experience in live ops situations\n• Experience with GIT\n• 3rd party SDK experience\n• Experience with Amazon AWS and related technologies\n\nWhat We Offer You\n• Competitive salary, bonus plan and ESPP (Employee Stock Purchase Plan)\n• 401K Company Match Contribution (US)\n• RRSP/DPSP company match contribution (Canada)\n• Health coverage, dental, disability, critical illness, EAP, and life insurance (Canada)\n• Medical, dental, vision, EAP, life insurance, and disability benefits (US)\n• Virtual mental health and neurodiversity support programs\n• Global Fitness reimbursement program\n• Global Wellbeing Program\n• Financial wellness program with unlimited access to certified financial planners\n• Discretionary Time Off policy for many employees\n• Family planning support program\n• Generous paid parental, pregnancy-related disability, caregiver, and compassionate leaves\n• Zynga happy hours and frequent employee events\n• Flexible working hours on many teams\n• Culture of diversity and inclusion including employee resource groups\n• Work with cool people and impact millions of daily players\n\nWe are an equal opportunity employer and we are committed to building a diverse and talented workforce. We do not discriminate on the basis of race, sex, religion, colour, national origin, gender, gender identity, sexual orientation, age, marital status, veteran status, medical condition, disability, or any other class or characteristic protected by applicable law. We welcome job-seekers, players, employees, and partners from all backgrounds to join us!\n\nWe will consider all qualified job-seekers with criminal histories in a manner consistent with applicable law.\n\nWe are committed to providing reasonable accommodations to qualified individuals with physical or mental disabilities in order to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us at AccommodationRequest@zynga.com to request an accommodation associated with your application for an open position.\n\nThe pay range for this position in California at the start of employment is expected to be between $123,500 and $182,780 per year.\n\nHowever, base pay offered is based on market location, and may vary further depending on individualized factors for job candidates, such as job-related knowledge, skills, experience, and other objective business considerations. Subject to those same considerations, the total compensation package for this position may also include other elements, including a bonus and/or equity awards, in addition to a full range of medical, financial, and/or other benefits. Details of participation in these benefit plans will be provided if an employee receives an offer of employment. If hired, employee will be in an “at-will position” and the Company reserves the right to modify base salary (as well as any other discretionary payment or compensation or benefit program) at any time, including for reasons related to individual performance, Company or individual department/team performance, and market factors.\n\nWe are proud to be an equal opportunity employer, which means we are committed to creating and celebrating diverse thoughts, cultures, and backgrounds throughout our organization. Employment with us is based on substantive ability, objective qualifications, and work ethic – not an individual’s race, creed, color, religion, sex or gender, gender identity or expression, sexual orientation, national origin or ancestry, alienage or citizenship status, physical or mental disability, pregnancy, age, genetic information, veteran status, marital status, status as a victim of domestic violence or sex offenses, reproductive health decision, or any other characteristics protected by applicable law.\n\nAs an equal opportunity employer, we are committed to providing the necessary support and accommodation to qualified individuals with disabilities, health conditions, or impairments (subject to any local qualifying requirements) to ensure their full participation in the job application or interview process. Please contact us at accommodationrequest@zynga.com to request any accommodations or for support related to your application for an open position.\n\nPlease be aware that Zynga does not conduct job interviews or make job offers over third-party messaging apps such as Telegram, WhatsApp, or others. Zynga also does not engage in any financial exchanges during the recruitment or onboarding process, and will never ask a candidate for their personal or financial information over an app or other unofficial chat channel. Any attempt to do so may be the result of a scamp or phishing attack, and you should not engage. Zynga’s in-house recruitment team will only contact individuals through their official Company email addresses (i.e., via a zynga.com, naturalmotion.com, smallgiantgames.com, themavens.com, gram.gs email domain).",
            "location": "Canada",
            "employmentType": "",
            "datePosted": "3 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/principal-software-engineer-1-%E2%80%93-game-of-thrones-legends-at-zynga-4074290815?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Python"
                },
                {
                    "name": "Java"
                },
                {
                    "name": "C++"
                },
                {
                    "name": "C#"
                },
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Unity"
                },
                {
                    "name": "AWS"
                }
            ]
        },
        {
            "jobType": "principal_software_engineer",
            "title": "Principal Software Engineer Team Lead",
            "company": "Bellwood",
            "description": "About the job\n\nWe are seeking a Principal Software Engineer Team Lead to lead a successful team that is building a significant Enterprise financial product to serve as the primary technical contact with the business and provide technical and relational leadership to our team of software engineers.\n\nThis is a unique opportunity to work alongside an experienced team that excels at building quality client products at scale.\n\nQualifications\n\nEssential skills: Deep experience with Java / Spring Boot, Go, or Node, as well as Amazon Web Services (AWS) and Cloud Architecture. Familiarity with financial accounting principles and Oracle ERP is a plus.\n\nHelpful skills: Kubernetes, Docker and GitHub Actions\n\nThe role also requires a voracious appetite to learn and apply new skills. You should be skilled at building web-based software or mobile apps, and excel at building software with different sets of tools and in different client environments.\n\nKey Responsibilities include:\n• Understand the big picture and business context of the client, and collaborate with Product Owners and Business stakeholders to digest the vision of the product into Epics, Sprints, and Tasks\n• Design, build, scale, and enhance Software Products, Apps, and Platforms based on Client Needs and Business Requirements\n• Communicate Technical Topics clearly, in language that can be easily understood by Clients\n• Collaborate with Designers, and Product Teams to propose solutions to meet the goals of Clients and their Products\n• Define, refine, and document Best Practices that enable excellent team performance\n• Technical leadership of a development team, including people-leadership of up to 7 Bellwood developers\n• 4 weeks of on-site quarterly planning meetings per year in Atlanta, and up to 4 Bellwood Retreats per year\n\nWe’re looking for someone who:\n• Has 7+ years of full-stack software development experience\n• Has experience building and scaling Software Products and enjoys mentoring and leading other developers\n• Has experience architecting and deploying Software Products to Cloud Providers like Google Cloud, Amazon Web Services, or Azure\n\nTravel Requirements\n\nThis position requires mandatory travel to attend four key company events annually and four quarterly client planning events per year. These events are essential for our organizational goals and provide valuable opportunities for team engagement and collaboration. The company will arrange and cover all travel and accommodation expenses. Additional travel related to the role may also be required.\n\nBenefits\n• Hybrid/Remote Role\n• Unlimited PTO\n• Subsidized Medical, Dental, and Vision Insurance\n• Short/Long Term Disability\n• Profit Sharing\n• Referral Bonuses\n• Company Retreats\n\nCompany Description\n\nBellwood is a dynamic Product Development Consultancy. We're a team of developers, designers, marketers and entrepreneurs that companies turn to when they want to take a software product from conception to creation.\n\nOur Mission\n\nBellwood seeks to be and be known as the most trusted partner to Build and Scale software products.\n\nOur Core Values\n• We Embrace Your Goals\n• We Own our Commitments\n• We Succeed through Empathy\n• We Take the Next Step\n\nJoin our tight-knit team of sharp technologists to leverage your talents and grow your skills. We are looking forward to meeting with you!",
            "location": "Canada",
            "employmentType": "",
            "datePosted": "4 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/principal-software-engineer-team-lead-at-bellwood-4073648877?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Indeed",
                    "url": "https://ca.indeed.com/viewjob?jk=de9af2f6447a0598&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Glassdoor",
                    "url": "https://www.glassdoor.ca/job-listing/principal-software-engineer-team-lead-bellwood-labs-JV_KO0,37_KE38,51.htm?jl=1009523055349&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Glassdoor",
                    "url": "https://www.glassdoor.com/job-listing/principal-software-engineer-team-lead-bellwood-labs-JV_KO0,37_KE38,51.htm?jl=1009523055349&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Java"
                },
                {
                    "name": "Go"
                },
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Git"
                },
                {
                    "name": "GitHub"
                },
                {
                    "name": "Spring Boot"
                },
                {
                    "name": "Docker"
                },
                {
                    "name": "Kubernetes"
                },
                {
                    "name": "GitHub Actions"
                },
                {
                    "name": "AWS"
                },
                {
                    "name": "Azure"
                },
                {
                    "name": "Google Cloud"
                }
            ]
        },
        {
            "jobType": "principal_software_engineer",
            "title": "Principal Software Engineer - Data Platform",
            "company": "Toast",
            "description": "Toast is driven by building the restaurant platform that helps restaurants adapt, take control, and get back to what they do best: building the businesses they love.\n\nWho We Are\n\nThe Data Platform team is responsible for building and maintaining the scalable, high-performance data infrastructure that powers Toast's analytical capabilities. We're a team of data enthusiasts who are passionate about leveraging cutting-edge technologies to drive business insights and decision-making. Our focus is on creating tools and infrastructure for other Toasters to leverage, and we're looking for a technical leader to help us achieve this vision.\n\nAbout this roll* (Responsibilities)\n\nAs a principal engineer, you will be in a unique position to shape the technical direction of our Data Platform, working closely with cross-functional teams to drive business outcomes through data-driven insights. As a technical leader, you will be responsible for architecting and implementing scalable data solutions that meet the evolving needs of our customers. This is an exceptional opportunity for a seasoned engineer who wants to work with a talented team, modern tech stack, and solve complex data problems at scale.\n\nResponsibilities\n• Lead the design and development of our Data Platform\n• Design and optimize real-time analytics solutions with Apache Druid\n• Implement data lake strategies using Apache Iceberg for efficient data management\n• Improve self-service large-scale data processing pipelines using Apache Spark\n• Drive the evolution of our data architecture, ensuring scalability, reliability, and maintainability\n• Mentor and guide engineers, fostering a culture of continuous improvement, inclusivity, and engineering excellence\n• Collaborate with cross-functional teams to drive business outcomes through data-driven insights\n• Set a high bar for code quality, testing, and documentation, ensuring our data solutions meet the highest standards\n• Build and maintain strong partnerships across lines of business, aligning technical solutions with strategic objectives\n\nDo you have the right ingredients*? (Qualities & Essential Skills)\n• 10+ years of developing complex software applications\n• Strong understanding of distributed systems, especially distributed data processing, and data storage\n• Ability to navigate complex organizational structures, effectively communicating with stakeholders from various departments to align data initiatives with business goals\n• Experience working with Apache Spark, bonus for experience with Apache Druid or Iceberg\n• Experience working on an internal platform team, identifying high leverage work, and working closely with users to optimize processes\n• Proficiency in Java or Kotlin\n• Proficiency in managing cloud resources, capacity planning, and balancing cost & performance tradeoffs\n• Passionate about data quality, data governance, and data security\n• Excellent communication skills and ability to explain complex technical concepts\n\nOur Spread* of Total Rewards\nWe strive to provide competitive compensation and benefits programs that help to attract, retain, and motivate the best and brightest people in our industry. Our total rewards package goes beyond great earnings potential and provides the means to a healthy lifestyle with the flexibility to meet Toasters’ changing needs. Learn more about our benefits at https://careers.toasttab.com/toast-benefits.\n• Bread puns encouraged but not required\n\n#LI-Remote\nThe base salary range for this role is listed below. The starting salary will be determined based on skills and experience. In addition to base salary, our total rewards components include cash compensation (overtime, bonus/commissions if eligible), equity, and benefits.\nPay Range\n$158,000—$253,000 CAD\n\nWe are Toasters\n\nDiversity, Equity, and Inclusion is Baked into our Recipe for Success.\n\nAt Toast our employees are our secret ingredient. When they are powered to succeed, Toast succeeds.\n\nThe restaurant industry is one of the most diverse industries. We embrace and are excited by this diversity, believing that only through authenticity, inclusivity, high standards of respect and trust, and leading with humility will we be able to achieve our goals.\n\nBaking inclusive principles into our company and diversity into our design provides equitable opportunities for all and enhances our ability to be first in class in all aspects of our industry.\n\nBready* to make a change? Apply today!\n\nToast is committed to creating an accessible and inclusive hiring process. As part of this commitment, we strive to provide reasonable accommodations for persons with disabilities to enable them to access the hiring process. If you need an accommodation to access the job application or interview process, please contact candidateaccommodations@toasttab.com.",
            "location": "Canada",
            "employmentType": "",
            "datePosted": "",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Toast",
                    "url": "https://careers.toasttab.com/jobs/principal-software-engineer-data-platform-canada?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Built In Toronto",
                    "url": "https://builtintoronto.com/job/principal-software-engineer-data-platform/3278995?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "VentureLoop",
                    "url": "https://www.ventureloop.com/ventureloop/jobdetail.php?jobid=2799147&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Built In",
                    "url": "https://builtin.com/job/principal-software-engineer-data-platform/3278995?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Built In Vancouver",
                    "url": "https://builtinvancouver.org/job/principal-software-engineer-data-platform/3278995?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/principal-software-engineer-data-platform-at-toast-4028889792?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Useparallel.com",
                    "url": "https://www.useparallel.com/app/candidate/job/670c5fed1fa1e0c1447f016d?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Simplify Jobs",
                    "url": "https://simplify.jobs/p/2c794882-9362-4999-9bb1-c186da372f1f/Principal-Software-Engineer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Java"
                },
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Kotlin"
                },
                {
                    "name": "Apache Spark"
                }
            ]
        },
        {
            "jobType": "principal_software_engineer",
            "title": "Principal Software Engineer, AI/ML Platform",
            "company": "Autodesk",
            "description": "Job Requisition ID #\n\n24WD82577\n\nPosition Overview\n\nWe are seeking a dynamic and enthusiastic principal software engineer to develop our next-generation AI/ML platform used in the development of Autodesk’s suite of products and services. Join our dynamic and rapidly expanding team to help build innovative capabilities that enable faster and more secure development of machine learning and generative AI solutions, bolstering the intelligence of Autodesk software products and services. You will collaborate with research and product engineering from various domains including design, construction, manufacturing, and media & entertainment to deliver the platform that supports full AI/ML development lifecycle.\n\nResponsibilities\n• Innovative System Design: Lead the design and engineering of software systems for the AI/ML Platform, contributing to the full ML development lifecycle\n• Automation and Streamlining: Identify and implement opportunities to automate and streamline ML development processes, fostering efficiency and effectiveness\n• Workflow Automation: Develop comprehensive systems to automate and optimize laborious processes, integrating them seamlessly into our platform to streamline operations\n• ML Solution Deployment: Develop tools for building and deploying ML artifacts in production environments, facilitating a smooth transition from development to deployment\n• Big Data Management: Automate and orchestrate tasks related to managing big data transformation and processing, building large-scale data stores for ML artifacts\n• Scalable Services: Design and implement low-latency, scalable prediction, and inference services to support the diverse needs of our users\n• Cross-Functional Collaboration: Collaborate across diverse teams, including machine learning researchers, developers, product managers, software architects, and operations, fostering a collaborative and cohesive work environment\n• Architectural Leadership: Take ownership of critical components of the platform, providing architectural direction, and contributing to the overall success of the AI/ML Platform\n\nMinimum Qualifications\n• BSc in Computer Science, or equivalent practical experience\n• Over 8 years of experience in software development and engineering, with a solid record of delivering production systems and services\n• Expertise in programming languages such as Python, Java, Go, scripting languages and SQL\n• Demonstrated created problem-solving skills with the ability to break down problems into manageable components\n• In-depth experience with Amazon AWS (Amazon Web Services) or Azure cloud technologies\n• Excellent track record in scalable system design and distributed software architecture\n• In-depth experience working with big data technologies, including NoSQL, Hadoop, Spark, Hive, and data pipelines\n• Strong expertise in data platforms, encompassing the design and implementation of scalable and efficient data storage, retrieval, and processing systems\n• Excellent communication and collaboration skills, fostering teamwork and effective information exchange\n• Familiarity with agile development methodologies, including CI/CD & test-driven development\n• Working knowledge with cloud data processing, training, deployment, or operations, such as Snowflake or Databricks\n• Working knowledge of cloud networking principles and their security implications for organizations holding sensitive data\n\nPreferred Qualifications\n• Exposure to deploying ML-enabled projects and solutions to production environments\n• Familiarity with Machine Learning Operations practices\n• Exposure to open-source Large Language Models on Hugging Face like Llama & Mixtral\n• Exposure to ML libraries such as PyTorch, TensorFlow, XGBoost, Pandas, and ScikitLearn\n• Exposure to statistical analysis\n• Past collaboration with data scientists and researchers\n• Hands-on experience building on Kubernetes centric infrastructure and CI/CD processes\n• Hands-on experience automating vulnerability fixes and working with security teams at large enterprise companies\n\nLearn More\n\nAbout Autodesk\n\nWelcome to Autodesk! Amazing things are created every day with our software – from the greenest buildings and cleanest cars to the smartest factories and biggest hit movies. We help innovators turn their ideas into reality, transforming not only how things are made, but what can be made.\n\nWe take great pride in our culture here at Autodesk – our Culture Code is at the core of everything we do. Our values and ways of working help our people thrive and realize their potential, which leads to even better outcomes for our customers.\n\nWhen you’re an Autodesker, you can be your whole, authentic self and do meaningful work that helps build a better future for all. Ready to shape the world and your future? Join us!\n\nSalary transparency\n\nSalary is one part of Autodesk’s competitive compensation package. Offers are based on the candidate’s experience and geographic location. In addition to base salaries, we also have a significant emphasis on discretionary annual cash bonuses, commissions for sales roles, stock or long-term incentive cash grants, and a comprehensive benefits package.\n\nDiversity & Belonging\n\nWe take pride in cultivating a culture of belonging and an equitable workplace where everyone can thrive. Learn more here: https://www.autodesk.com/company/diversity-and-belonging\n\nAre you an existing contractor or consultant with Autodesk?\n\nPlease search for open jobs and apply internally (not on this external site).",
            "location": "Toronto, ON, Canada",
            "employmentType": "",
            "datePosted": "17 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/principal-software-engineer-ai-ml-platform-at-autodesk-4045931012?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "The Muse",
                    "url": "https://www.themuse.com/jobs/autodesk/principal-software-engineer-aiml-platform-1879ab?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Motor Jobs",
                    "url": "https://motorjobs.com/en/job/principal-software-engineer-ai-ml-platform-0?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Built In Toronto",
                    "url": "https://builtintoronto.com/job/principal-software-engineer-aiml-platform/3403738?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "BeBee Canada Meet Opportunities",
                    "url": "https://ca.bebee.com/job/cace8a72ce3b1e3e3ed184ef2c84d08b?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Talent.com",
                    "url": "https://ca.talent.com/view?id=80d004d96b05&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Built In",
                    "url": "https://builtin.com/job/principal-software-engineer-aiml-platform/3403738?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Recruit.net",
                    "url": "https://www.recruit.net/job/software-engineer-ai-ml-platform-jobs/1F3ACB56A9FB9D35?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Python"
                },
                {
                    "name": "Java"
                },
                {
                    "name": "Go"
                },
                {
                    "name": "C"
                },
                {
                    "name": "Scala"
                },
                {
                    "name": "SQL"
                },
                {
                    "name": "R"
                },
                {
                    "name": "TensorFlow"
                },
                {
                    "name": "PyTorch"
                },
                {
                    "name": "Pandas"
                },
                {
                    "name": "Kubernetes"
                },
                {
                    "name": "AWS"
                },
                {
                    "name": "Azure"
                },
                {
                    "name": "Machine Learning"
                },
                {
                    "name": "Hadoop"
                }
            ]
        }
    ]
}