{
    "jobs": [
        {
            "jobType": "security_engineer",
            "title": "AWS Security Engineer",
            "company": "ProHire solutions",
            "description": "Job Title: Lead AWS Security Engineer\n\nJob Location: Ontario, CA (Hybrid) - Totally remote after the training\n\nJob Description:\n\nAs the Lead AWS Security Engineer, you’ll leverage your leadership and technical expertise to make a significant impact within our cyber security team. In this pivotal role, you will design and implement security controls in a robust cyber security program, providing solutions and recommendations for complex security challenges. As our cyber security expert, you will act as the primary advisor to staff, management, and external stakeholders on a range of cyber security components, employing professional concepts to guide operational success and proactively mitigate potential threats or vulnerabilities.\n\nResponsibilities:\n• Lead the implementation of security controls in alignment with corporate security objectives, actively collaborating with SMEs, product managers, architects, DevOps, cloud-ops, and development teams.\n• Provide expert advice on cyber security practices and standards, helping to ensure compliance and secure architecture across cloud environments.\n• Serve as a resource for management and IT executives, ensuring they are informed of security advancements, potential vulnerabilities, and areas of risk.\n• Engage in the use of cutting-edge security solutions, advocating best practices and compliance to internal teams.\n• Oversee security incident management and security operations, leading responses and coordinating with relevant stakeholders.\n\nQualifications:\n• Completion of a diploma or degree in Information Technology, Computer Science, Engineering, or a related field.\n• 10+ years of progressive experience in Cyber Security, with a minimum of 3 years in a formal leadership capacity.\n• Relevant certifications or progress towards certifications such as CISSP, CRISC, PMI-ACP, AWS Certified Solutions Architect, or AWS Certified Security - Specialty.\n• Hands-on experience with application security testing tools (SAST, DAST, IAST) and cloud security tools such as AWS Security Hub, WAF, IAM, and the AWS Well-Architected Framework.\n• Expertise in security operations and security incident management, with strong familiarity with industry security standards and compliance, including ISO 27001/27002 and ISO 27017.\n• Demonstrated proficiency with open-source operating systems, security tools, and cloud environments, from development through production and maintenance.\n\nIf you are passionate about cyber security, AWS, and leading a team in a high-impact role, we encourage you to apply and join our clients forward-thinking team.",
            "location": "Toronto, ON, Canada",
            "employmentType": "",
            "datePosted": "3 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/aws-security-engineer-at-prohire-solutions-4074976238?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Dice",
                    "url": "https://www.dice.com/job-detail/363abf48-e76d-41ec-a66e-97f30a93c1da?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Canada Job Bank",
                    "url": "https://canadajobbank.org/aws-security-engineer/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "AWS"
                }
            ]
        },
        {
            "jobType": "security_engineer",
            "title": "Information Security Engineer",
            "company": "CloudVital",
            "description": "We are looking for Information Security Engineer for a growing GTA-based dynamic organization\n\nThis will be an important position in the growth roadmap supporting the design, deployment and support of mission-critical applications.\n\nJob Title: Information Security Engineer\n\nJob Location: Mississauga\n\nJob Type: Full Time/ Contract\n\nKey Responsibilities\n\nThe ideal candidate will have hands on experience with the design, deployment and ongoing maintenance of Information Security Infrastructure and services including:\n• Assisting in developing, implementing and maintaining Information Security Management System (ISMS).\n• Monitoring of key company’s system (EDR, IPS, SIEM, Firewalls etc.) to detect abnormalities.\n• Monitoring of external vendor and industry sources to guide internal risk mitigation actions.\n• Investigation, detection, containment, resolution of observed or reported abnormalities to corporate standards (as required).\n• Carrying out regular scheduled activities, such as dormant account review, phishing tests, internal and external vulnerability scans. Ensuring appropriate action is taken on findings.\n• Collaborating with IT / third party system administrators to ensure that risk appropriate actions are taken in accordance with corporate policies (Patching, access control etic).\n• Conducting requested risk and privacy assessments to internal and external information systems as requested.\n• Assuring compliance to required federal and corporate standards, procedures, guidelines and processes.\n• Participating in required audits related to cyber security and compliance.\n\nRequired Skills & Experience\n• Demonstrated 3 - 5 years of experience in designing, building and continuously improving integrated information security solutions for large enterprises within a regulated environment.\n• Experience maintaining, troubleshooting, and supporting endpoint and cloud security tools including Tanium.\n• Previous experience collaborating with senior leaders to advise on security posture and provide risk-based recommendations to improve the systems.\n• Degree/Diploma in Computer Science, Engineering or a related field.\n\nMinimum Qualifications\n• Bachelor’s degree in Computer Science, Information Technology, or an equivalent.\n• 3- 5 years IT experience, including 3 years of progressively responsible experience in cybersecurity, or information security.\n• CISSP, CCSP, CISM or equivalent.\n\nIf you feel you are fit for the role or have someone in your circle with the relevant experience then please apply via LinkedIn or share your profiles with us at hr@cloudvital.ca",
            "location": "Mississauga, ON, Canada",
            "employmentType": "",
            "datePosted": "4 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/information-security-engineer-at-cloudvital-4074224751?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Canadian Cybersecurity Jobs",
                    "url": "https://canadiancybersecurityjobs.com/jobs/94227239-information-security-engineer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "BeBee Canada Meet Opportunities",
                    "url": "https://ca.bebee.com/job/db79b13f3e2e2332f36cff2578c70a20?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jobs Trabajo.org",
                    "url": "https://ca.trabajo.org/job-3051-d7a83dc0a65d7765c84762fdb72cb5ca?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "C"
                },
                {
                    "name": "R"
                }
            ]
        },
        {
            "jobType": "security_engineer",
            "title": "Cloud Security Engineer, Deloitte Global Technology",
            "company": "Deloitte",
            "description": "Job Type: Permanent\n\nWork Model: Remote\n\nReference code: 126050\n\nPrimary Location: Toronto, ON\n\nAll Available Locations: Toronto, ON; Burlington, ON; Calgary, AB; Edmonton, AB; Fredericton, NB; Halifax, NS; Kitchener, ON; Moncton, NB; Ottawa, ON; Regina, SK; Saint John, NB; Saskatoon, SK; St. John's, NL; Vancouver, BC; Victoria, BC; Winnipeg, MB\n\nOur Purpose\n\nAt Deloitte, we are driven to inspire and help our people, organization, communities, and country to thrive. Our Purpose is to build a better future by accelerating and expanding access to knowledge. Purpose defines who we are and gives us reason to exist as an organization.\n\nBy living our Purpose, we will make an impact that matters.\n• Learn from deep subject matter experts through mentoring and on the job coaching\n• Have many careers in one Firm.\n• Partner with clients to solve their most complex problems\n\n--\n\nWhat will your typical day look like?\n\nThis role is a highly skilled and experienced Cloud Security professional with hands on cloud security and governance experience. As a Cloud Security Engineer this role will be responsible for providing expert guidance on security configurations for cloud services in each of AWS, Azure and GCP. This role will involve assessing the cloud services, identifying vulnerabilities and risks, and providing actionable guidance to ensure the highest level of security for Deloitte's cloud infrastructure.\n\nResponsibilities:\n• Conduct extensive research, assess and analyze the security configurations of AWS, Azure and GCP cloud services, including but not limited to Infrastructure-as-a-Service (IaaS), Platform-as-a-Service (PaaS), Software-as-a-Service (SaaS) and marketplace offerings.\n• Deploy cloud services in sandbox environment and conduct security assessments and audits to identify vulnerabilities. Use various tools and techniques to assess the security posture of the cloud service and identify any weaknesses or gaps. Based on the findings, recommend appropriate remediation actions to strengthen the security of the cloud infrastructure.\n• Review Deloitte's internal information security standards and recommend security compliance guidance cloud service security capabilities. Collaborate with the development team to recommend development of new guardrails where necessary.\n• Collaborate with Cloud Service Providers (CSPs), marketplace vendors, cross-functional teams, including architecture, application development, and security teams, to ensure that the provided guidance is wholistic and practical.\n• Stay up-to-date with the latest trends and developments in cloud security and provide recommendations for enhancing security configurations based on emerging threats and vulnerabilities.\n• Provide continous process improvement recommendations to develop a robust and efficient cloud services security assessment process.\n\nAbout the team\n\nDeloitte Technology works at the forefront of technology development and processes to support and protect Deloitte around the world. In this truly global environment, we operate not in \"what is\" but rather \"what can be\" to help Deloitte deliver and connect with its clients, its communities, and one another in ways not previously conceived.\n\nEnough about us, let’s talk about you\n\nIn this role, you will need a:\n• Bachelor's degree in Computer Science, Information Systems Security, or in a related field\n• 5 years of proven experience as Cloud Security Engineer or in a similar role\n• Proven, in-depth hands-on experience in at least 2 of AWS, Azure, or GCP platforms.\n• In-depth understanding of security frameworks, standards, and best practices (e.g., CIS Benchmarks, NIST, ISO 27001)\n• Exceptional research and analytical skills, and strong attention to details\n• Robust communication and interpersonal skills, with the ability to effectively communicate complex security concepts and recommendations to technical and non-technical stakeholders.\n• Ability to multi-task, work independently or collaboratively in a fast-paced environment\n• Continuous learning mindset, with a passion for staying up-to-date with the latest trends and developments in cloud security.\n\nCertifications:\n• ISC2 CCSP\n• Solutions Architect in AWS, Azure or GCP\n• Security speciality in AWS, Azure or GCP\n\nDesired:\n• Experience in multiple CSPs platforms\n• Agile Framework experience\n\nTotal Rewards\n\nThe salary range for this position is $69,000 - $114,000, and individuals may be eligible to participate in our bonus program. Deloitte is fair and competitive when it comes to the salaries of our people. We regularly benchmark across a variety of positions, industries, sectors, targets, and levels. Our approach is grounded on recognizing people's unique strengths and contributions and rewarding the value that they deliver.\n\nOur Total Rewards Package extends well beyond traditional compensation and benefit programs and is designed to recognize employee contributions, encourage personal wellness, and support firm growth. Along with a competitive base salary and variable pay opportunities, we offer a wide array of initiatives that differentiate us as a people-first organization. Some representative examples include: $4,000 per year for mental health support benefits, a $1,300 flexible benefit spending account, 38+ days off (including 10 firm-wide closures known as \"Deloitte Days\"), flexible work arrangements and a hybrid work structure.\n\nOur promise to our people: Deloitte is where potential comes to life.\n\nBe yourself, and more.\n\nWe are a group of talented people who want to learn, gain experience, and develop skills. Wherever you are in your career, we want you to advance.\n\nYou shape how we make impact.\n\nDiverse perspectives and life experiences make us better. Whoever you are and wherever you’re from, we want you to feel like you belong here. We provide flexible working options to support you and how you can contribute. Be the leader you want to be.\n\nBe the leader you want to be\n\nSome guide teams, some change culture, some build essential expertise. We offer opportunities and experiences that support your continuing growth as a leader.\n\nHave as many careers as you want.\n\nWe are uniquely able to offer you new challenges and roles – and prepare you for them. We bring together people with unique experiences and talents, and we are the place to develop a lasting network of friends, peers, and mentors. Our TVP is about relationships – between leaders and their people, the firm and its people, peers, and within in our communities.\n\nThe next step is yours\n\nAt Deloitte, we are all about doing business inclusively – that starts with having diverse colleagues of all abilities. Deloitte encourages applications from all qualified candidates who represent the full diversity of communities across Canada. This includes, but is not limited to, people with disabilities, candidates from Indigenous communities, and candidates from the Black community in support of living our values, creating a culture of Diversity Equity and Inclusion and our commitment to our AccessAbility Action Plan, Reconciliation Action Plan and the BlackNorth Initiative.\n\nWe encourage you to connect with us at accessiblecareers@deloitte.ca if you require an accommodation for the recruitment process (including alternate formats of materials, accessible meeting rooms or other accommodations) or indigenouscareers@deloitte.ca for any questions relating to careers for Indigenous peoples at Deloitte (First Nations, Inuit, Métis).\n\nBy applying to this job you will be assessed against the Deloitte Global Talent Standards. We’ve designed these standards to provide our clients with a consistent and exceptional Deloitte experience globally.\n\nDeloitte Canada has 30 offices with representation across most of the country. We acknowledge our offices reside on traditional, treaty and unceded territories as part of Turtle Island and is still home to many First Nations, Métis, and Inuit peoples. We are all Treaty people.",
            "location": "Toronto, ON, Canada",
            "employmentType": "",
            "datePosted": "19 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Deloitte - Deloitte Canada",
                    "url": "https://careers.deloitte.ca/job/Toronto%2C-Ontario%2C-Canada-Cloud-Security-Engineer%2C-Deloitte-Global-Technology-ON/1145089800/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jobillico",
                    "url": "https://www.jobillico.com/en/job-offer/deloittebVkoBi/cloud-security-engineer-deloitte-global-technology/13428030?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Glassdoor",
                    "url": "https://www.glassdoor.ca/job-listing/cloud-security-engineer-deloitte-global-technology-deloitte-JV_IC2281069_KO0,50_KE51,59.htm?jl=1009193833632&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Saskatchewanjobs.ca",
                    "url": "https://www.saskatchewanjobs.ca/jobs/cloud-security-engineer-deloitte-global-technology-canada-1498593?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "NewBrunswickjobs.ca",
                    "url": "https://www.newbrunswickjobs.ca/jobs/cloud-security-engineer-deloitte-global-technology-canada-1498593?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "NovaScotiajobs.ca",
                    "url": "https://www.novascotiajobs.ca/jobs/cloud-security-engineer-deloitte-global-technology-canada-1498593?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jooble",
                    "url": "https://ca.jooble.org/jdp/-8281890494956810466?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Recruit.net",
                    "url": "https://www.recruit.net/job/cloud-security-engineer-deloitte-global-jobs/C04CAA1CAE78445A?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "AWS"
                },
                {
                    "name": "Azure"
                }
            ]
        },
        {
            "jobType": "security_engineer",
            "title": "Senior Security Detection Engineer (GCS)",
            "company": "Royal Bank of Canada",
            "description": "Job Summary\n\nJob Description\n\nWhat is the Opportunity?\n\nThe role of the Senior Security Detection Engineer is to provide specialized subject matter expertise for the Detection Engineering & Onboarding (DEO) team, for RBC's Global Cyber Security. This is a key technical role supporting mission critical enterprise network security operations and IT services protection. This role will drive development using automation to new or existing use cases to reduce the overall mean time to detect and respond to incidents.\n\nThis role will be based in Vancouver to best support our US subsidiary, City National Bank (CNB).\n\nWith your proven experience, collaboratively lead our CNB/RBC technology and application partners to develop and implement mission critical cyber use cases for security monitoring supporting security operations and Security Operations Centre capabilities.\n\nWhat will you do?\n• Provide global accountability to provide technical and subject matter expertise supporting cyber uses cases developed from security systems and infrastructure for security monitoring.\n• Work with CNB/RBC technology and/or application partners (Cybersecurity, Technology Infrastructure, SOC) to develop and strengthen use cases for continuous security monitoring.\n• Develop runbooks for those use cases that align with security operations processes and streamline the incident investigation and response tasks.\n• Work with Defensive Threat Operations Correlation Engineering to facilitate log ingestion and use case development in our SIEM platforms.\n• Periodically review use case library, perform attestation on existing use cases, participate in tuning discussions/activities and provide improvement recommendations where necessary/possible.\n• Develop and maintain lines of communication with various security groups, Security Operations Centre leadership and technology stakeholders\n• Develop processes to support a maturing program\n• Provide operational metrics and reports as needed\n\nWhat do you need to succeed?\n\nMust have:\n• Educational background in IT, Engineering, Cybersecurity and/or equivalent relevant experience\n• Demonstrated technical leadership ability\n• In-depth understanding of Security Operations and Security Technologies, with previous experience working in a SOC environment\n• Understanding of common exploitation techniques and awareness of new threats\n• Strong analytical and complex problem-solving skills\n• Expert understanding of SIEM technology and operations\n• Strong Networking and Enterprise IT Infrastructure knowledge with TCP/IP packet level knowledge\n\nNice-to-have:\n• Strong platform knowledge including Microsoft Windows and Unix/Linux Operating Systems\n• Strong knowledge of cloud platforms and cloud security\n\nWhat’s in it for you?\n\nWe thrive on the challenge to be our best, progressive thinking to keep growing, and working together to deliver trusted advice to help our clients thrive and communities prosper. We care about each other, reaching our potential, making a difference to our communities, and achieving success that is mutual.\n• A comprehensive Total Rewards Program including bonuses and flexible benefits, competitive compensation, commissions, and stock where applicable\n• Leaders who support your development through coaching and managing opportunities\n• Ability to make a difference and lasting impact\n• Work in a dynamic, collaborative, progressive, and high-performing team\n• A world-class training program in financial services\n• Flexible work/life balance options\n• Opportunities to do challenging work\n\n#techpj\n\n#LI-hybrid\n\n#LI-post\n\nJob Skills\nCloud Software, Communication, Cross-Departmental Collaboration, Cyber Operations, Cyber Security Management, Decision Making, Detail-Oriented, Group Problem Solving, High Impact Communication, Information Security Management, Information Technology Security, Network Security Operations, Security Automation, Security Operations, SIEM Tools, Strategic Thinking, Threat Detection, Threat Monitoring, Use Case Documentation\n\nAdditional Job Details\n\nAddress:\n\nVANCOUVER MAIN BRANCH, 1025 GEORGIA ST W:VANCOUVER\n\nCity:\n\nVANCOUVER\n\nCountry:\n\nCanada\n\nWork hours/week:\n\n37.5\n\nEmployment Type:\n\nFull time\n\nPlatform:\n\nTECHNOLOGY AND OPERATIONS\n\nJob Type:\n\nRegular\n\nPay Type:\n\nSalaried\n\nPosted Date:\n\n2024-07-19\n\nApplication Deadline:\n\n2024-12-09\n\nNote: Applications will be accepted until 11:59 PM on the day prior to the application deadline date above\n\nInclusion and Equal Opportunity Employment\n\nAt RBC, we embrace diversity and inclusion for innovation and growth. We are committed to building inclusive teams and an equitable workplace for our employees to bring their true selves to work. We are taking actions to tackle issues of inequity and systemic bias to support our diverse talent, clients and communities.\n​​​​​​​\nWe also strive to provide an accessible candidate experience for our prospective employees with different abilities. Please let us know if you need any accommodations during the recruitment process.\n\nJoin our Talent Community\n\nStay in-the-know about great career opportunities at RBC. Sign up and get customized info on our latest jobs, career tips and Recruitment events that matter to you.\n\nExpand your limits and create a new future together at RBC. Find out how we use our passion and drive to enhance the well-being of our clients and communities at jobs.rbc.com.",
            "location": "Vancouver, BC, Canada",
            "employmentType": "",
            "datePosted": "14 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "RBC Careers",
                    "url": "https://jobs.rbc.com/ca/en/job/R-0000093169/Senior-Security-Detection-Engineer-GCS?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Indeed",
                    "url": "https://ca.indeed.com/viewjob?jk=055c8d4b1e5335b6&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jooble",
                    "url": "https://ca.jooble.org/jdp/7195501404062241636?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "SimplyHired",
                    "url": "https://www.simplyhired.ca/job/CDnqcUpYAHotY1gHXM1HhkJS0OqrHOrva7NxOshwq7nv7mivNgP-XQ?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jobillico",
                    "url": "https://www.jobillico.com/fr/offre-d-emploi/rbc-uiymvf/senior-security-detection-engineer-gcs-/14206689?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "BeBee Canada Meet Opportunities",
                    "url": "https://ca.bebee.com/job/9dc39dd4e0700ae8c97bc21e18e848e7?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Talent.com",
                    "url": "https://ca.talent.com/view?id=9ccdf2f3480d&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/senior-security-detection-engineer-gcs-at-rbc-3980513292?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "TCP/IP"
                }
            ]
        },
        {
            "jobType": "security_engineer",
            "title": "Intermediate Security Engineer, Corporate Security",
            "company": "GitLab",
            "description": "GitLab is an open core software company that develops the most comprehensive AI-powered DevSecOps Platform, used by more than 100,000 organizations. Our mission is to enable everyone to contribute to and co-create the software that powers our world. When everyone can contribute, consumers become contributors, significantly accelerating the rate of human progress. This mission is integral to our culture, influencing how we hire, build products, and lead our industry. We make this possible at GitLab by running our operations on our product and staying aligned with our values. Learn more about Life at GitLab.\n\nAn Overview Of This Role\n\nJoin our growing Corporate Security Engineering team! We are responsible for selecting, deploying, managing and optimizing the security tools used within our Corporate environment as part of our overall security strategy. You will implement state of the art security measures to enforce GitLab policy and prevent unauthorized access. The team is responsible for endpoint security controls and securing key SaaS products such as Okta, Google Workspace and Slack.\n\nSome Examples Of Our Projects\n• How we boosted WebAuthn adoption from 20 percent to 93 percent in two days\n\nWhat You’ll Do\n\nDLP / Insider Threat - you will assess our current Google Workspace DLP capabilities and help us build a path to maturity by enhancing our current monitoring and alerting capabilities and building a framework for automated Google Workspace data controls.\n\nManaged Chrome Browser - you will assist with the rollout of managed Chrome browser to prevent malicious and unauthorized browser extensions, and the restrictions of other browsers for being used for work-purposes.\n\nBYOD & Managed Devices - enhancing the security hardening of our devices used for Corporate purposes, whether BYOD or GitLab-managed devices. You will collaborate with the Identity team to implement device assurance policies to build authentication / authorization policies that are dependent on device posture.\n\nEDR Maturity - you will assist us in the evaluation of the leading solutions on the market and our efforts to iterate on endpoint visibility and control capabilities.\n\nReduce SaaS sprawl and increase visibility - you will drive the reduction of the number of unapproved integrations within our Google Workspace and GitLab.com environments while minimizing business impact.\n\nWhat You’ll Bring\n• API/automation skills with a language such as Python and/or low-code tools like Tines, Workato, Okta Workflows\n• macOS, Linux, VDI and mobile endpoint management skills with tools such as Jamf, Kandji, Automox or other MDM tools.\n• Okta, Google Workspace and Slack administration background\n• Inquisitive mind to question why things are the way that they are and propose solutions\n• Experience creating communication and a willingness to collaborate with a wide group of technical and non-technical stakeholders across the company\n• Excitement about working directly with team members when they encounter issues with security or endpoint management tools\n• Experience working at a remote-first technology company\n• Security certifications such as CISSP, GIAC SANS, or from vendors such as Google, Jamf or Okta\n• Willingness to use GitLab\n\nHow GitLab Will Support You\n• Benefits to support your health, finances, and well-being\n• All remote, asynchronous work environment\n• Flexible Paid Time Off\n• Team Member Resource Groups\n• Equity Compensation & Employee Stock Purchase Plan\n• Growth and development budget\n• Parental leave\n• Home office support\n\nPlease note that we welcome interest from candidates with varying levels of experience; many successful candidates do not meet every single requirement. Additionally, studies have shown that people from underrepresented groups are less likely to apply to a job unless they meet every single qualification. If you're excited about this role, please apply and allow our recruiters to assess your application.\n\nThe base salary range for this role’s listed level is currently for residents of listed locations only. Grade level and salary ranges are determined through interviews and a review of education, experience, knowledge, skills, abilities of the applicant, equity with other team members, and alignment with market data. See more information on our benefits and equity. Sales roles are also eligible for incentive pay targeted at up to 100% of the offered base salary.\n\nCalifornia/Colorado/Hawaii/New Jersey/New York/Washington/DC pay range\n\n$103,600—$222,000 USD\n\nCountry Hiring Guidelines: GitLab hires new team members in countries around the world. All of our roles are remote, however some roles may carry specific location-based eligibility requirements. Our Talent Acquisition team can help answer any questions about location after starting the recruiting process.\n\nPrivacy Policy: Please review our Recruitment Privacy Policy. Your privacy is important to us.\n\nGitLab is proud to be an equal opportunity workplace and is an affirmative action employer. GitLab’s policies and practices relating to recruitment, employment, career development and advancement, promotion, and retirement are based solely on merit, regardless of race, color, religion, ancestry, sex (including pregnancy, lactation, sexual orientation, gender identity, or gender expression), national origin, age, citizenship, marital status, mental or physical disability, genetic information (including family medical history), discharge status from the military, protected veteran status (which includes disabled veterans, recently separated veterans, active duty wartime or campaign badge veterans, and Armed Forces service medal veterans), or any other basis protected by law. GitLab will not tolerate discrimination or harassment based on any of these characteristics. See also GitLab’s EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know during the recruiting process.",
            "location": "Canada",
            "employmentType": "",
            "datePosted": "18 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/intermediate-security-engineer-corporate-security-at-gitlab-4064316942?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Calgary Tech & Startups",
                    "url": "https://builtincalgary.org/job/intermediate-security-engineer-corporate-security/3513869?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Levels.fyi",
                    "url": "https://www.levels.fyi/jobs?jobId=139501411569148614&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Python"
                },
                {
                    "name": "Go"
                },
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Git"
                },
                {
                    "name": "GitLab"
                }
            ]
        },
        {
            "jobType": "security_engineer",
            "title": "Senior Security Engineer",
            "company": "Dremio",
            "description": "Be Part of Building the Future\n\nDremio is the unified lakehouse platform for self-service analytics and AI, serving hundreds of global enterprises, including Maersk, Amazon, Regeneron, NetApp, and S&P Global. Customers rely on Dremio for cloud, hybrid, and on-prem lakehouses to power their data mesh, data warehouse migration, data virtualization, and unified data access use cases. Based on open source technologies, including Apache Iceberg and Apache Arrow, Dremio provides an open lakehouse architecture enabling the fastest time to insight and platform flexibility at a fraction of the cost. Learn more at www.dremio.com.\n\nAbout the role\n\nWe are looking for a security generalist. You will be driving technical security initiatives for Dremio. You will own different aspects of the Dremio security such as product security, cloud security, detection and response initiatives, security side of compliance efforts with team members sharing the responsibilities.\n\nWhat you'll be doing\n• Serve as a security expert for the organization\n• Join product and cloud security uplift efforts\n• Design and implement security automation tools\n• Define and drive the roadmap for threat detection and incident response\n• Develop and mature Dremio's incident response playbook\n• Run risk assessment and remediation work for the organization\n• Participate and respond to security incidents\n• Work with various stakeholders to perform root cause analysis for security problems\n• Research and evaluate new and emerging security trends, technologies, risks and threat\n• Participate in security efforts for compliance such as ISO27001, SOC 2, PCI, etc…\n\nWhat we're looking for\n• Have 4-6 years of experience working on information security and/or related field\n• Understanding of Cloud Infrastructure Security and functioning, experience with CloudTrail, GCP Logging or similar\n• Degree in computer science/ related field or equivalent combination of professional development training and experience\n• Hands on experience working on configuring and managing tools such as SIEM, syslog, REST API based logging parsers\n• Scripting knowledge in Python, Go, Bash, etc…\n• Stay up to date on new security issues\n• Able to communicate clearly and effectively to various stakeholders\n\nBonus points if you have\n• Education in cybersecurity/computer science or related field\n• Knowledge on analyzing large datasets\n• Built, managed or worked in a D&R function for an organization\n• Information security certifications such as CEH, OSCP, CISM, GIAC, CompTIA Security+\n\n#LI-JF1 #LI-Remote\n\nWhat we value\n\nAt Dremio, we hold ourselves to high standards when it comes to People, Thinking, and Action. Our Gnarlies (that's what we call our employees) communicate with clarity, drive accountability, and are respectful towards each other. We confront brutal facts and focus on results while operating with a sense of urgency and building a \"flywheel\". People who like to jump in and drive momentum will thrive in our #GnarlyLife.\n\nDremio is an equal opportunity employer supporting workforce diversity. We do not discriminate on the basis of race, religion, color, national origin, gender identity, sexual orientation, age, marital status, protected veteran status, disability status, or any other unlawful factor.\n\nDremio is committed to providing any necessary accommodations for individuals with disabilities within our application and interview process. To request accommodation due to a disability, please inform your recruiter.\n\nDremio has policies in place to protect the personal information that employees and applicants disclose to us. Please click here to review the privacy notice.\n\nImportant Security Notice for Candidates\n\nAt Dremio, we uphold trust and transparency as paramount values in all our interactions with customers, partners, employees, and the general public. We have been targeted by individuals creating fake domains similar to ours to scam prospects and candidates. Please note that all official communications from us will be from an @dremio.com domain. If you suspect you've been targeted by a scam, it's imperative to report the incident to your local law enforcement agencies. For more information about this type of scam, please refer to Dremio's official statement here.",
            "location": "Toronto, ON, Canada",
            "employmentType": "",
            "datePosted": "",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Indeed",
                    "url": "https://ca.indeed.com/viewjob?jk=81dc757ece1eab58&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "BeBee Canada Meet Opportunities",
                    "url": "https://ca.bebee.com/job/431b0c71c2a9b28e51dcff84fdd6eba7?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "GrabJobs",
                    "url": "https://grabjobs.co/canada/job/full-time/others/senior-security-engineer-111621324?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "No Whiteboard",
                    "url": "https://www.nowhiteboard.org/jobs/656a73fccb850c895e09afb6?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jooble",
                    "url": "https://ca.jooble.org/jdp/1577643694048190989?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Rise AI Job Search | Tech Startup Jobs, Remote Jobs Hiring Now",
                    "url": "https://app.joinrise.co/jobs/top-hat-senior-security-engineer-3ies?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jobs Trabajo.org",
                    "url": "https://ca.trabajo.org/job-3026-5fb9cd942616676b8ad3587748391cbe?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jobilize",
                    "url": "https://www.jobilize.com/job/ca-canada-senior-security-engineer-replicant-hiring-now-job-immediately?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Python"
                },
                {
                    "name": "Go"
                },
                {
                    "name": "C"
                },
                {
                    "name": "Bash"
                },
                {
                    "name": "R"
                }
            ]
        },
        {
            "jobType": "security_engineer",
            "title": "Lead Security Engineer, Identity and Access Management",
            "company": "CPP Investments",
            "description": "Company Description\n\nMake an impact at a global and dynamic investment organization\n\nWhen you invest your career in CPP Investments, you join one of the most respected and fastest growing institutional investors in the world. With current assets under management valued in excess of $500 billion, CPP Investments is a professional investment management organization that globally invests the funds of the Canada Pension Plan (CPP) to help ensure long-term sustainability. The CPP Fund is projected to reach $3 trillion by 2050. CPP Investments invests in all major asset classes, including public equity, private equity, real estate, infrastructure and fixed-income instruments, and is headquartered in Toronto with offices in Hong Kong, London, Luxembourg, Mumbai, New York City, San Francisco, São Paulo and Sydney.\n\nCPP Investments attracts and selects high-calibre individuals from top-tier institutions around the globe. Join our team and look forward to:\n• Diverse and inspiring colleagues and approachable leaders\n• Stimulating work in a fast-paced, intellectually challenging environment\n• Accelerated exposure and responsibility\n• Global career development opportunities\n• Being motivated every day by CPP Investments’ important social purpose and unshakable principles\n• A flexible/hybrid work environment combining in office collaboration and remote working\n• A deeply rooted culture of Integrity, Partnership and High Performance\n\nIf you share a passion for performance, value a collegial and collaborative culture, and approach everything with the highest integrity, here’s an opportunity for you to invest your career at CPP Investments.\n\nJob Description\n\nWe are seeking a highly skilled and experienced Lead Engineer for Identity and Access Management (IAM) to drive our IAM strategy and implementation, including the critical area of Privileged Access Management (PAM). This role will play a crucial part in ensuring that our IAM and PAM systems and processes are robust, scalable, and aligned with the overall security architecture of our organization. The ideal candidate will have deep expertise in IAM and PAM, a strategic mindset, and the ability to lead and influence cross-functional teams.\n\nKey Responsibilities:\n• Lead the design, development, and execution of both the IAM and PAM strategies, ensuring they align with the organization's security objectives and business goals. Provide leadership and guidance to the IAM and PAM teams.\n• Design and implement architectures for IAM and PAM that support secure and efficient management of identities and privileged access across all systems and applications. Ensure these architectures align with industry best practices and regulatory requirements.\n• Continuously assess and improve IAM and PAM processes, procedures, and infrastructure to ensure they are effective, efficient, and compliant. This includes automation of IAM and PAM controls and processes where applicable.\n• Conduct and oversee IAM and PAM assessments of technology, processes, and vendors to identify gaps against established standards. Implement necessary controls to protect information systems and vital assets.\n• Lead the implementation and ongoing management of PAM solutions, including tools like CyberArk, to secure, control, and monitor access to critical systems and data.\n• Work closely with other security architects, IT application solution architects, and key strategic vendors to plan, design, and challenge the IAM and PAM security of applications that support cross-functional business needs.\n• Drive the planning and execution of the IAM and PAM technology roadmap, including evaluating and integrating new technologies that enhance our capabilities in these areas.\n• Create, maintain, and enforce IAM and PAM standards, ensuring they are consistent with industry guidelines, best practices, and organizational requirements. Provide consulting support to internal projects as needed.\n\nQualifications\n\nEducation:\n• Undergraduate degree in Technology, Data Science, Business, Finance, or a related discipline is required; a post-graduate degree is a plus.\n• Relevant industry certifications, such as CISSP, ISSAP, CCSP, SABSA, or other recognized Information Security certifications, are highly desirable.\n\nProfessional Experience:\n• Minimum of 10 years of experience in information and cybersecurity, including strategy design, implementation, and monitoring.\n• At least 5 years of experience specifically in IAM architecture.\n• Experience providing strategic guidance in a large consulting organization is a plus.\n• Deep technical or operational experience in IAM and cybersecurity, with broad knowledge across various security disciplines such as vulnerability management, access management, cloud security, and risk management.\n• Experience with security frameworks like NIST CSF and a variety of security technologies.\n\nAdditional Skills:\n• Extremely effective communicator with strong written and oral communication skills, capable of engaging with both technical and non-technical stakeholders.\n• Ability to present complex technical concepts to a diverse audience, ensuring clarity and understanding.\n• Effective at building and fostering professional relationships, influencing peers, and working collaboratively across different levels of the organization.\n• Proven ability to manage multiple complex engagements simultaneously and prioritize tasks effectively.\n\nAdditional Information\n\nVisit our LinkedIn Career Page or Follow us on LinkedIn. #LI-KE1 #LI-Onsite\n\nAt CPP Investments, we are committed to diversity and equitable access to employment opportunities based on ability.\n\nWe thank all applicants for their interest but will only contact candidates selected to advance in the hiring process.\n\nOur Commitment to Inclusion and Diversity:\n\nIn addition to being dedicated to building a workforce that reflects diverse talent, we are committed to fostering an inclusive and accessible experience. If you require an accommodation for any part of the recruitment process (including alternate formats of materials, accessible meeting rooms, etc.), please let us know and we will work with you to meet your needs.\n\nDisclaimer:\n\nCPP Investments does not accept resumes from employment placement agencies, head-hunters or recruitment suppliers that are not in a formal contractual arrangement with us. Our recruitment supplier arrangements are restricted to specific hiring needs and do not include this or other web-site job postings. Any resume or other information received from a supplier not approved by CPP Investments to provide resumes to this posting or web-site will be considered unsolicited and will not be considered. CPP Investments will not pay any referral, placement or other fee for the supply of such unsolicited resumes or information.",
            "location": "Toronto, ON, Canada",
            "employmentType": "",
            "datePosted": "",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Smart Recruiters Jobs",
                    "url": "https://jobs.smartrecruiters.com/CPPInvestmentsInvestissementsRPC/744000009407378-lead-security-engineer-identity-and-access-management?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/lead-security-engineer-identity-and-access-management-at-cpp-investments-investissements-rpc-4022861910?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Ivy Exec",
                    "url": "https://ivyexec.com/jobs-and-research-studies-search/job/9645525?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Talent.com",
                    "url": "https://ca.talent.com/view?id=33c15827f5e3&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "BeBee Canada Meet Opportunities",
                    "url": "https://ca.bebee.com/job/8b644acf0e8709494c58ba5bf05fbc85?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "TotalCyber.io",
                    "url": "https://totalcyber.io/jobs/cpp-investments/lead-security-engineer-identity-and-access-management?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Glassdoor",
                    "url": "https://www.glassdoor.ca/job-listing/lead-security-engineer-identity-and-access-management-cpp-investments-JV_IC2281069_KO0,53_KE54,69.htm?jl=1009419847171&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "SimplyHired",
                    "url": "https://www.simplyhired.ca/job/Lv-JK7wmNHsiTV7BBWTR0Kvu1CX4TThTNc2B2klUuMGp2vKPV6FjwQ?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "C"
                },
                {
                    "name": "R"
                }
            ]
        },
        {
            "jobType": "security_engineer",
            "title": "Intermediate Security Engineer, Corporate Security",
            "company": "GitLab",
            "description": "GitLab is an open core software company that develops the most comprehensive AI-powered DevSecOps Platform, used by more than 100,000 organizations. Our mission is to enable everyone to contribute to and co-create the software that powers our world. When everyone can contribute, consumers become contributors, significantly accelerating the rate of human progress. This mission is integral to our culture, influencing how we hire, build products, and lead our industry. We make this possible at GitLab by running our operations on our product and staying aligned with our values. Learn more about Life at GitLab.\n\nAn overview of this role:\n\nJoin our growing Corporate Security Engineering team! We are responsible for selecting, deploying, managing and optimizing the security tools used within our Corporate environment as part of our overall security strategy. You will implement state of the art security measures to enforce GitLab policy and prevent unauthorized access. The team is responsible for endpoint security controls and securing key SaaS products such as Okta, Google Workspace and Slack.\n\nSome examples of our projects:\n• How we boosted WebAuthn adoption from 20 percent to 93 percent in two days\n\nWhat You’ll Do:\n\nDLP / Insider Threat - you will assess our current Google Workspace DLP capabilities and help us build a path to maturity by enhancing our current monitoring and alerting capabilities and building a framework for automated Google Workspace data controls.\nManaged Chrome Browser - you will assist with the rollout of managed Chrome browser to prevent malicious and unauthorized browser extensions, and the restrictions of other browsers for being used for work-purposes.\nBYOD & Managed Devices - enhancing the security hardening of our devices used for Corporate purposes, whether BYOD or GitLab-managed devices. You will collaborate with the Identity team to implement device assurance policies to build authentication / authorization policies that are dependent on device posture.\n\nEDR Maturity - you will assist us in the evaluation of the leading solutions on the market and our efforts to iterate on endpoint visibility and control capabilities.\nReduce SaaS sprawl and increase visibility - you will drive the reduction of the number of unapproved integrations within our Google Workspace and GitLab.com environments while minimizing business impact.\n\nWhat You’ll Bring:\n• API/automation skills with a language such as Python and/or low-code tools like Tines, Workato, Okta Workflows\n• macOS, Linux, VDI and mobile endpoint management skills with tools such as Jamf, Kandji, Automox or other MDM tools.\n• Okta, Google Workspace and Slack administration background\n• Inquisitive mind to question why things are the way that they are and propose solutions\n• Experience creating communication and a willingness to collaborate with a wide group of technical and non-technical stakeholders across the company\n• Excitement about working directly with team members when they encounter issues with security or endpoint management tools\n• Experience working at a remote-first technology company\n• Security certifications such as CISSP, GIAC SANS, or from vendors such as Google, Jamf or Okta\n• Willingness to use GitLab\n\nHow GitLab will support you\n• Benefits to support your health, finances, and well-being\n• All remote, asynchronous work environment\n• Flexible Paid Time Off\n• Team Member Resource Groups\n• Equity Compensation & Employee Stock Purchase Plan\n• Growth and development budget\n• Parental leave\n• Home office support\n\nPlease note that we welcome interest from candidates with varying levels of experience; many successful candidates do not meet every single requirement. Additionally, studies have shown that people from underrepresented groups are less likely to apply to a job unless they meet every single qualification. If you're excited about this role, please apply and allow our recruiters to assess your application.\n\nThe base salary range for this role’s listed level is currently for residents of listed locations only. Grade level and salary ranges are determined through interviews and a review of education, experience, knowledge, skills, abilities of the applicant, equity with other team members, and alignment with market data. See more information on our benefits and equity. Sales roles are also eligible for incentive pay targeted at up to 100% of the offered base salary.\n\nCalifornia/Colorado/Hawaii/New Jersey/New York/Washington/DC pay range\n\n$103,600—$222,000 USD\n\nCountry Hiring Guidelines: GitLab hires new team members in countries around the world. All of our roles are remote, however some roles may carry specific location-based eligibility requirements. Our Talent Acquisition team can help answer any questions about location after starting the recruiting process.\n\nPrivacy Policy: Please review our Recruitment Privacy Policy. Your privacy is important to us.\n\nGitLab is proud to be an equal opportunity workplace and is an affirmative action employer. GitLab’s policies and practices relating to recruitment, employment, career development and advancement, promotion, and retirement are based solely on merit, regardless of race, color, religion, ancestry, sex (including pregnancy, lactation, sexual orientation, gender identity, or gender expression), national origin, age, citizenship, marital status, mental or physical disability, genetic information (including family medical history), discharge status from the military, protected veteran status (which includes disabled veterans, recently separated veterans, active duty wartime or campaign badge veterans, and Armed Forces service medal veterans), or any other basis protected by law. GitLab will not tolerate discrimination or harassment based on any of these characteristics. See also GitLab’s EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know during the recruiting process.",
            "location": "United States",
            "employmentType": "",
            "datePosted": "19 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Built In Toronto",
                    "url": "https://builtintoronto.com/job/intermediate-security-engineer-corporate-security/3513869?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Built In",
                    "url": "https://builtin.com/job/intermediate-security-engineer-corporate-security/3513869?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Built In Vancouver",
                    "url": "https://builtinvancouver.org/job/intermediate-security-engineer-corporate-security/3513869?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Built In Ottawa",
                    "url": "https://builtinottawa.com/job/intermediate-security-engineer-corporate-security/3513869?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Python"
                },
                {
                    "name": "Go"
                },
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Git"
                },
                {
                    "name": "GitLab"
                }
            ]
        },
        {
            "jobType": "security_engineer",
            "title": "Sr. Ruby on Rails Engineer (Security)",
            "company": "Aha!",
            "description": "Aha! is the world's #1 product development software. We help over 1 million product builders bring their strategy to life. Our suite of tools includes Aha! Roadmaps , Aha! Ideas , Aha! Whiteboards , Aha! Knowledge , and Aha! Develop . Product teams rely on our expertise, guided templates, and training programs via Aha! Academy to be their best. We are proud to be a very different type of high-growth SaaS company. The business is self-funded, profitable, and 100% remote. We are recognized as one of the best fully remote companies to work for, champion the Bootstrap Movement , and have given over $1M to people in need through Aha! Cares . Learn more at www.aha.io .\n\nOur team\n\nThe Aha! engineering team is a midsized, fully remote group that is highly productive. We are centered around North American time zones so we can collaborate during the workday.\n• We help each other grow: We each bring unique skills to the table and want our teammates to feel valued from the start. Our onboarding program exposes new hires to the codebase and lets them contribute right away.\n• We move quickly: We ship code multiple times a day. We believe in getting valuable features in front of customers and iteratively improving as we learn what works and what does not.\n• We value product over process: We want the team to have the time and focus needed to solve complex challenges. We minimize overhead by setting clear goals and avoiding heavyweight processes and excessive meetings.\n• We share knowledge freely: We share our learnings with one another and with the developer community. Our engineering blog demonstrates how we tackle interesting challenges at Aha!\n• We enjoy: We like what we do. And we want you to love your team and your job too. Learn more about The Responsive Method , our company values , and the generous benefits we offer.\n\nOur technology\n\nOur web application is a single-instance, multitenant Ruby on Rails monolith supported by Postgres (database), Redis (background jobs), and Memcached (Rails caching). We also run a Node.js webserver to support collaborative editing and real-time updates. Our application is hosted on Amazon Web Services and architected with ECS for reproducibility and scalability.\n\nWe use a growing amount of React on the front end to build rich client-side experiences, including our fully collaborative text editor and slide presentation editor. We balance the strengths of both technologies: Rails for its conventions and simplicity and React for more powerful interactive functionality.\n\nTeammates embrace the new technologies that help us deliver a lovable product suite, but we also remain cognizant of the maintenance overhead a new library or platform brings. We solve the problems in front of us — rather than prematurely optimizing to address issues that might never materialize.\n\nWe do most of our planning and collaboration in Aha! Roadmaps and built Aha! Develop so software engineers and their teams can take advantage of those same rich features. We use Slack and Zoom for video calls. (Email? Rarely.)\n\nYour Experience\n\nMost of our features involve writing significant Ruby on Rails code, so you should be familiar with working in a Rails codebase. You will perform security code reviews and should have experience reviewing code for security, compliance, or functional validation. Overall, you have strong problem-solving abilities as well as experience working on important functionality for a cloud-based product.\n\nSkills\n\nWe believe that being a kind person who elevates the rest of the team is just as valuable as writing great code. You are humble, eager to learn, and always willing to help others. You want teammates who enjoy solving problems, regardless of the technologies and techniques involved. You have worked at meaningful scale before and want to do so again. You also have the following experience and skills:\n• Four+ years of experience working in Ruby on Rails\n• Experience with code reviews for security or functional validation in Ruby on Rails\n• Experience developing features at a high-growth SaaS company\n• Active collaborator with product teams\n\nYour work at Aha!\n\nThe security team works across our full suite of products and applications with a focus on core features such as authentication, authorization, file handling, and data segmentation. We also provide security reviews and guidance for the larger engineering team across the full stack.\n\nWe Love Ruby On Rails And Dig Deep Into Code And Business Logic. As a Sr. Ruby On Rails Engineer For Security, Your Work Will Include\n• Implementing security features and improvements with the customer experience in mind\n• Security code reviews that go above and beyond what can be found with scanning tools (which we also use!)\n• Investigating errors to identify security, resiliency, and performance improvements\n• Developing and sharing secure patterns internally for ongoing education\n\nIf this sounds appealing, we would love to hear from you. A real human reviews every application, so please use the form to help us learn more about you.\n\nGrow with us\n\nEveryone deserves to reach their fullest potential. We know that when we do work that matters with people we care about in a high-growth environment, we feel engaged and alive. It is why we joined Aha! and how we achieve our very best .\n\nWe offer all the benefits you would expect and more, including profit sharing. The specific benefits listed below are reflective of what we offer U.S.-based hires. We also do our best to extend identical benefits to international teammates.\n• The base salary range for this role in the U.S. is between $110,000 and $190,000\n• Cash-based compensation also includes profit sharing, and we contribute a percentage of your total pay each month toward your retirement\n• Medical, dental, and vision plans (for many teammates, we cover 100% of the premiums)\n• Up to 200 hours of paid time off a year to spend however you want\n• 30 to 90 days of paid parental leave and five to 10 days of paid care and bereavement leave\n• Up to $1,000 annually for third-party education, along with paid time off to immerse yourself in learning\n• Volunteer opportunities throughout the year\n\nBase salary and total compensation are dependent upon many factors, including skills, experience, and relevant past roles.",
            "location": "Halifax, NS, Canada",
            "employmentType": "",
            "datePosted": "20 hours ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/sr-ruby-on-rails-engineer-security-at-aha%21-4078731130?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Ruby"
                },
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "React"
                },
                {
                    "name": "Bootstrap"
                },
                {
                    "name": "Node.js"
                },
                {
                    "name": "Ruby on Rails"
                }
            ]
        },
        {
            "jobType": "security_engineer",
            "title": "Security Engineer - Encryption Engineer",
            "company": "TD Bank",
            "description": "Work Location:\nToronto, Ontario, Canada\n\nHours:\n37.5\n\nLine of Business:\nTechnology Solutions\n\nPay Details:\n4 - 4 CAD\n\nTD is committed to providing fair and equitable compensation opportunities to all colleagues. Growth opportunities and skill development are defining features of the colleague experience at TD. Our compensation policies and practices have been designed to allow colleagues to progress through the salary range over time as they progress in their role. The base pay actually offered may vary based upon the candidate's skills and experience, job-related knowledge, geographic location, and other specific business and organizational needs.\n\nAs a candidate, you are encouraged to ask compensation related questions and have an open dialogue with your recruiter who can provide you more specific details for this role.\n\nJob Description:\n\nJob Description\n• The Crypto Engineering team is responsible for data protection for on premise, mobile and in the Cloud. We are tasked with the proposal, design, build, automation, implementation and L3 support of Data Protection technologies and, as needed, the re-engineering of existing technologies in the Security space. This will entail completion of low-level design, build, and preparation/documentation for hand over to operational support teams. The Engineer will be certifying the use of encryption on various technologies such as Databases, Storage and on various applications.\n\nThis role will be responsible for solutions using technologies such as:\n• Vormetric/CipherTrust Data At Rest Encryption\n• Hardware Security Module (HSM) – Thales, Entrust, Utimaco Attala\n• PKI\n\nTechnical Requirements\n\nThis role is looking for people with skills in as many of the below technology areas as possible:\n• Expertise in Unix/Linux coupled with 7+ years in Database Engineering and/or Storage (SAN, NAS)\n• Knowledge of various cryptographic and encryption technologies and standards (Symmetric/Asymmetric cryptography).\n• Experience with either CipherTrust Manager and/or HSMs\n\nJob Requirements\n• Minimum 7+ years in an engineering role in DB and or storage teams coupled with expertise on Linux working in a large enterprise.\n• Experience certifying the encryption on various storage technologies (Databases, Storage and applications).\n• Knowledge of various cryptographic and encryption technologies and standards (Symmetric/Asymmetric cryptography)\n• In depth knowledge of various security controls\n• proven track record of successful implementations in a large enterprise\n• Strong analytical, reasoning, and organizational skills are essential.\n• Excellent verbal and written communications skills are essential.\n• Ability to establish and maintain effective working relationships with all levels of personnel both internally and externally, e.g. leadership, executives, clients, vendors, and agencies.\n• Proven ability to work in a fast paced environment and manage multiple deadlines and priorities.\n• Work closely & collaboratively with Internal Engineering, Deployment & Operations teams to drive design adoption across IT\n• Ability to transfer knowledge to fellow team members.\n• Ability to make engineering design decisions, efficiently build solutions, solves technical problems, and makes improvements to our systems.\n\nWho We Are:\n\nTD is one of the world's leading global financial institutions and is the fifth largest bank in North America by branches/stores. Every day, we deliver legendary customer experiences to over 27 million households and businesses in Canada, the United States and around the world. More than 95,000 TD colleagues bring their skills, talent, and creativity to the Bank, those we serve, and the economies we support. We are guided by our vision to Be the Better Bank and our purpose to enrich the lives of our customers, communities and colleagues.\n\nTD is deeply committed to being a leader in customer experience, that is why we believe that all colleagues, no matter where they work, are customer facing. As we build our business and deliver on our strategy, we are innovating to enhance the customer experience and build capabilities to shape the future of banking. Whether you’ve got years of banking experience or are just starting your career in financial services, we can help you realize your potential. Through regular leadership and development conversations to mentorship and training programs, we’re here to support you towards your goals. As an organization, we keep growing – and so will you.\n\nOur Total Rewards Package\nOur Total Rewards package reflects the investments we make in our colleagues to help them and their families achieve their financial, physical, and mental well-being goals. Total Rewards at TD includes a base salary, variable compensation, and several other key plans such as health and well-being benefits, savings and retirement programs, paid time off, banking benefits and discounts, career development, and reward and recognition programs. Learn more\n\nAdditional Information:\nWe’re delighted that you’re considering building a career with TD. Through regular development conversations, training programs, and a competitive benefits plan, we’re committed to providing the support our colleagues need to thrive both at work and at home.\n\nPlease be advised that this job opportunity is subject to provincial regulation for employment purposes. It is imperative to acknowledge that each province or territory within the jurisdiction of Canada may have its own set of regulations, requirements.\n\nColleague Development\nIf you’re interested in a specific career path or are looking to build certain skills, we want to help you succeed. You’ll have regular career, development, and performance conversations with your manager, as well as access to an online learning platform and a variety of mentoring programs to help you unlock future opportunities. Whether you have a passion for helping customers and want to expand your experience, or you want to coach and inspire your colleagues, there are many different career paths within our organization at TD – and we’re committed to helping you identify opportunities that support your goals.\n\nTraining & Onboarding\nWe will provide training and onboarding sessions to ensure that you’ve got everything you need to succeed in your new role.\n\nInterview Process\nWe’ll reach out to candidates of interest to schedule an interview. We do our best to communicate outcomes to all applicants by email or phone call.\n\nAccommodation\nYour accessibility is important to us. Please let us know if you’d like accommodations (including accessible meeting rooms, captioning for virtual interviews, etc.) to help us remove barriers so that you can participate throughout the interview process.\n\nWe look forward to hearing from you!\n\nLanguage Requirement (Quebec only):\nSans Objet",
            "location": "Toronto, ON, Canada",
            "employmentType": "",
            "datePosted": "",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Indeed",
                    "url": "https://ca.indeed.com/viewjob?jk=cac37903a0de220b&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "TD Bank Jobs",
                    "url": "https://tdbank.jobs/toronto-on/security-engineer-encryption-engineer/B78AFC9FAEA841DC91D22EB886F3FD2C/job/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "The Muse",
                    "url": "https://www.themuse.com/jobs/tdbank/security-engineer-encryption-engineer-fafbd0?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Glassdoor",
                    "url": "https://www.glassdoor.ca/job-listing/security-engineer-encryption-engineer-td-bank-JV_IC2281069_KO0,37_KE38,45.htm?jl=1009340539478&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jobillico",
                    "url": "https://www.jobillico.com/fr/offre-d-emploi/tdgBzkNp/security-engineer-encryption-engineer/14097042?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/security-engineer-encryption-engineer-at-td-4072272470?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jooble",
                    "url": "https://ca.jooble.org/jdp/1294146541205999959?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Adzuna",
                    "url": "https://www.adzuna.ca/details/4906253140?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "C"
                },
                {
                    "name": "R"
                }
            ]
        }
    ]
}