{
    "jobs": [
        {
            "jobType": "senior_web_developer",
            "title": "Senior Web Developer",
            "company": "Autodesk",
            "description": "Job Requisition ID #\n\n24WD83020\n• La description de poste en français suivra*\n\nPosition Overview\n\nAutodesk's Entertainment & Media Solutions is hiring a Senior Web Developer to join our production management team. Reporting to our Senior Manager, Software Development, you'll work on technical software projects that help power many of the largest budget movies in the world. You'll work within a team a distributed team, developing innovative technology for movie production. You'll help us develop innovative technical solutions to some of our most problems. You'll join a team that make solutions that make the previously impossible possible!\n\nResponsibilities\n• Develop high quality code and collaborate on technical designs\n• Work with a cross-functional, agile team to understand and refine functional requirements\n• Ensure code conforms to standards and meets feature specifications\n• Participate in peer code reviews and share your learnings and knowledge\n• Write and maintain automated tests to ensure that software is stable and reliable\n• Be able to work in the New Zealand time-zone until at least 10.30 a.m. NZST\n\nMinimum Qualifications\n• 5+ years of professional web development experience, ideally working on SaaS applications\n• Highly proficient with Angular\n• In-depth understanding and experience applying software design principles and patterns  \n• Proficient software development practices including testing (unit and functional) and code reviews\n• Strong technical troubleshooting skills\n• Experience working with APIs is a plus  \n• University degree in a related field or equivalent experience will be considered\n\nPreferred Qualifications\n• Meticulous eye for detail and passion for beautiful user experiences\n• Experience working in a distributed cross-functional team environment\n• Certifications with AWS or related technologies\n• Familiarity with CI/CD concepts and DevOps\n• You actively speak up, collaborate, and contribute ideas to the team\n\n______________________________________________________________________________________\n\n24WD83020, Développeur(se) web senior\n\nAperçu du poste\n\nAutodesk recrute un(e) développeur(se) web senior pour rejoindre notre équipe de gestion de la production. Sous la responsabilité de notre Senior Manager, Software Development, vous travaillerez sur des projets de logiciels techniques qui contribuent à la réalisation de nombreux films à gros budget dans le monde. Vous travaillerez au sein d'une équipe distribuée, développant une technologie innovante pour la production de films. Vous nous aiderez à mettre au point des solutions techniques innovantes pour résoudre certains de nos problèmes les plus importants. Vous rejoindrez une équipe qui élabore des solutions qui rendent possible l'impossible!\n\nResponsabilités\n• Développer un code de haute qualité et collaborer à la conception technique\n• Travailler avec une équipe agile interfonctionnelle pour comprendre et affiner les exigences fonctionnelles\n• S'assurer que le code est conforme aux normes et qu'il répond aux spécifications des fonctionnalités\n• Participer à des revues de code par les pairs et partager vos apprentissages et vos connaissances\n• Rédiger et maintenir des tests automatisés pour s'assurer que le logiciel est stable et fiable\n• Être capable de travailler dans le fuseau horaire de la Nouvelle-Zélande jusqu'à au moins 10h30 NZST\n\nQualifications Minimales\n• Plus de 5 ans d'expérience professionnelle dans le développement web (idéalement sur des applications SaaS)\n• Très bonne maîtrise d'Angular\n• Compréhension approfondie et expérience de l'application des principes et des modèles de conception de logiciels\n• Maîtrise des pratiques de développement logiciel, y compris les tests (unitaires et fonctionnels) et les révisions de code\n• Solides compétences en matière de dépannage technique\n• Expérience de la conception et de l'utilisation d'API est un atout\n• Un diplôme universitaire dans un domaine connexe ou une expérience équivalente sera pris en compte\n\nQualifications Préférées\n• Souci du détail et passion pour les belles expériences utilisateur\n• Expérience de travail dans un environnement d'équipe distribuée et interfonctionnelle\n• Certification AWS ou technologies connexes\n• Familiarité avec les concepts CI/CD et DevOps\n• Vous vous exprimez activement, collaborez et apportez des idées à l'équipe\n\nLearn More / Plus d'information\n\nAbout Autodesk / À Propos D’Autodesk\n\nWelcome to Autodesk! Amazing things are created every day with our software – from the greenest buildings and cleanest cars to the smartest factories and biggest hit movies. We help innovators turn their ideas into reality, transforming not only how things are made, but what can be made.\n\nWe take great pride in our culture here at Autodesk – our Culture Code is at the core of everything we do. Our values and ways of working help our people thrive and realize their potential, which leads to even better outcomes for our customers.\n\nWhen you’re an Autodesker, you can be your whole, authentic self and do meaningful work that helps build a better future for all. Ready to shape the world and your future? Join us!\n\nBienvenue à Autodesk ! Des choses incroyables sont créées chaque jour avec nos logiciels - des bâtiments les plus écologiques et des voitures les plus propres aux usines les plus intelligentes et aux plus grands films à succès. Nous aidons les innovateurs à transformer leurs idées en réalité, transformant non seulement la façon dont les choses sont faites, mais ce qui peut être fait.\n\nNous sommes très fiers de notre culture ici chez Autodesk - notre code en matière de culture est au cœur de tout ce que nous faisons. Nos valeurs et nos méthodes de travail aident nos employés à prospérer et à réaliser leur potentiel, ce qui conduit à des résultats encore meilleurs pour nos clients.\n\nLorsque vous êtes un employé Autodesk, vous pouvez être entier et authentique et effectuer un travail significatif qui aide à construire un avenir meilleur pour tous. Prêt à façonner le monde et votre avenir? Joignez-vous à nous !\n\nSalary transparency / Transparence salariale\n\nSalary is one part of Autodesk’s competitive compensation package. Offers are based on the candidate’s experience and geographic location. In addition to base salaries, we also have a significant emphasis on discretionary annual cash bonuses, commissions for sales roles, stock or long-term incentive cash grants, and a comprehensive benefits package.\n\nLe salaire est l'un des éléments de l'offre compétitive d'Autodesk. Les offres sont basées sur l'expérience et la situation géographique du candidat. Outre les salaires de base, nous accordons également une grande importance aux primes annuelles discrétionnaires en espèces, aux commissions pour les fonctions de vente, aux actions ou aux primes d'encouragement à long terme en espèces, ainsi qu'à un ensemble complet d'avantages sociaux.\n\nDiversity & Belonging / Diversité et appurtenance\n\nWe take pride in cultivating a culture of belonging and an equitable workplace where everyone can thrive. Learn more here: https://www.autodesk.com/company/diversity-and-belonging\n\nNous sommes fiers de cultiver une culture d’appartenance et un milieu de travail équitable où tout le monde peut s’épanouir. Pour en savoir plus, cliquez ici : https://www.autodesk.com/company/diversity-and-belonging\n\nAre you an existing contractor or consultant with Autodesk?\n\nÊtes-vous un sous-traitant ou un consultant existant d’Autodesk ?\n\nPlease search for open jobs and apply internally (not on this external site).\n\nVeuillez rechercher des emplois vacants et postuler à l’interne (pas sur ce site externe).",
            "location": "Montreal, Quebec, Canada",
            "employmentType": "",
            "datePosted": "20 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/senior-web-developer-at-autodesk-4060829026?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Fullstack Jobs - OnSite And Remote Full Stack Jobs",
                    "url": "https://fullstackjob.com/job/29jy8ysPQNpbfszX0DgPaDVWfO2/Senior%20Web%20Developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "BeBee Canada Meet Opportunities",
                    "url": "https://ca.bebee.com/job/5ba4b20481a7c5d4539bde36d040c312?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "LazyApply",
                    "url": "https://lazyapply.com/jobpreview/e6d647c1-8494-418e-a576-eefc14d913b1?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jooble",
                    "url": "https://ca.jooble.org/jdp/-4495493167881119440?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jobs Trabajo.org",
                    "url": "https://ca.trabajo.org/job-3051-0d198efcfa5b9c46176f5c6b80068607?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "ClickaJobs",
                    "url": "https://ca.clickajobs.com/job/Senior-Web-Developer/montr%C3%A9al/24932073?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jobilize",
                    "url": "https://www.jobilize.com/amp/job/ca-montreal-senior-web-developer-mda-edge-hiring-now-job-immediately?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Angular"
                },
                {
                    "name": "AWS"
                }
            ]
        },
        {
            "jobType": "senior_web_developer",
            "title": "Web Software Developer - Front End (Senior)",
            "company": "dakis",
            "description": "Description: At dakis, web development is king! We are looking for a talented software developer who doesn’t fear JavaScript and new web technologies, and who is very enthusiastic at the idea of bringing eCommerce to the next level. You will play an active role in shaping Dakis’ next generation WebApp eCommerce and photo solutions.",
            "location": "Montreal, Quebec, Canada",
            "employmentType": "",
            "datePosted": "3 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Dakis.com",
                    "url": "https://dakis.com/jobs/web-software-developer-front-end-senior?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jooble",
                    "url": "https://ca.jooble.org/jdp/-2229804215412120950?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Njoyn",
                    "url": "https://groom.njoyn.com/CL/in/share/JobDetails.asp?clid=95811&jobid=J0719-0153&BRID=280134&LANG=2&SBDID=1&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Talent.com",
                    "url": "https://ca.talent.com/view?id=219bdf2668b5&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "SimplyHired",
                    "url": "https://www.simplyhired.ca/job/w3RU8BughTg10CxG2OUYIuhYY9ge5JclwFcadqZ-Y4-lQm1J_1F_sA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Learn4Good",
                    "url": "https://www.learn4good.com/jobs/montreal/canada/info_technology/3371966031/e/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "JobOffer.com",
                    "url": "https://joboffer.com/jobs/Developer-Front-End-075a7a28be1ff9a7?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Trabajo.org",
                    "url": "https://ca.trabajo.org/job-2401-74dfe1d865054aa65f85aee1f1b0f2ed?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Java"
                },
                {
                    "name": "JavaScript"
                },
                {
                    "name": "C"
                }
            ]
        },
        {
            "jobType": "senior_web_developer",
            "title": "Senior Full Stack Web Developer",
            "company": "Epic Games",
            "description": "WHAT MAKES US EPIC?\n\nAt the core of Epic’s success are talented, passionate people. Epic prides itself on creating a collaborative, welcoming, and creative environment. Whether it’s building award-winning games or crafting engine technology that enables others to make visually stunning interactive experiences, we’re always innovating.\n\nBeing Epic means being a part of a team that continually strives to do right by our community and users. We’re constantly innovating to raise the bar of engine and game development.\n\nPROGRAMMING - GAMES\n\nWhat We Do\n\nUnreal projects have been leading the pack of real-time entertainment with our constantly growing team of programming experts. We’re always improving on the tools and technology that empower content developers worldwide.\n\nWhat You'll Do\n\nAs part of the Fortnite Creator Ecosystem Team, you will be developing the tools Fortnite Creators use to build, publish, and manage experiences in the Fortnite ecosystem. In this role, you’ll work across the stack to create modern, user-centric web experiences that connect the many toolsets and elements of the Creator ecosystem, including publishing, analytics, trust and safety, and monetization. Most importantly, you’ll work with a creative, energetic, and fun team to continue making Fortnite one of the most popular and engaging gaming experiences in the world!\n\nIn this role, you will\n• Develop features for the Fortnite Creator Portal and related services\n• Collaborate with product managers, designers, and producers to turn product requirements and business goals into technical designs and work plans\n• Anchor projects and areas of development. Facilitate the work of other programmers on the team and coordinate with partner teams to deliver projects on time\n• Enhance the team by performing code reviews, collaborating on design documents, leading tech talks, and contributing to the team’s culture of growth and cooperation\n• Perform bug fixes, ongoing maintenance, and on-call support for the Fortnite Creator Portal\n\nWhat We're Looking For\n• A full stack programmer who is willing to jump in anywhere in the stack, even if it’s not their area of expertise\n• Experience delivering complicated web projects and operating them in production\n• Technical depth or strong interest in at least one area where you can be the team’s subject matter expert and teach the rest of us a few new tricks\n• Grace under pressure - demonstrated ability to work in a challenging (but rewarding!), fast-paced environment\n• Natural collaborators who make the people around them better\n• Strong knowledge of JavaScript (TypeScript preferred)\n\nEPIC JOB + EPIC BENEFITS = EPIC LIFE\n\nWe pay 100% for benefits for both employees and dependents and offer coverage for supplemental medical, dental, vision, critical illness, telemedicine, Life and AD&D, long term disability insurance as well as weekly indemnity (short term disability) and a retirement savings plan with a competitive employer match. In addition to the EAP (employee assistance program), we also offer a robust mental well-being program through Modern Health, which provides free therapy and coaching for employees & dependents.\n\nPay Transparency Information\n\nThe expected annual base pay range(s) for this position are detailed below. Each base pay range is relevant only for individuals who are residents of or will be expected to work within the specified locale. Compensation varies based on a variety of factors, which include (but aren’t limited to) things such as skills and competencies, qualifications, knowledge, and experience. In addition to base pay, most employees are eligible to participate in Epic’s generous benefit plans and discretionary incentive programs (subject to the terms of those plans or programs).\n\nBritish Columbia Base Pay Range\n\n$177,096—$259,741 CAD\n\nAbout Us\n\nEpic Games spans across 25 countries with 46 studios and 4,500+ employees globally. For over 25 years, we've been making award-winning games and engine technology that empowers others to make visually stunning games and 3D content that bring environments to life like never before. Epic's award-winning Unreal Engine technology not only provides game developers the ability to build high-fidelity, interactive experiences for PC, console, mobile, and VR, it is also a tool being embraced by content creators across a variety of industries such as media and entertainment, automotive, and architectural design. As we continue to build our Engine technology and develop remarkable games, we strive to build teams of world-class talent.\n\nLike what you hear? Come be a part of something Epic!\n\nEpic Games deeply values diverse teams and an inclusive work culture, and we are proud to be an Equal Opportunity employer. Learn more about our Equal Employment Opportunity (EEO) Policy here.\n\nNote to Recruitment Agencies: Epic does not accept any unsolicited resumes or approaches from any unauthorized third party (including recruitment or placement agencies) (i.e., a third party with whom we do not have a negotiated and validly executed agreement). We will not pay any fees to any unauthorized third party. Further details on these matters can be found here.",
            "location": "British Columbia, Canada",
            "employmentType": "",
            "datePosted": "17 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/senior-full-stack-web-developer-at-epic-games-4027392616?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Java"
                },
                {
                    "name": "JavaScript"
                },
                {
                    "name": "TypeScript"
                },
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Unreal Engine"
                }
            ]
        },
        {
            "jobType": "senior_web_developer",
            "title": "Senior Website Software Development Engineer",
            "company": "Advanced Micro Devices, Inc",
            "description": "WHAT YOU DO AT AMD CHANGES EVERYTHING\n\nWe care deeply about transforming lives with AMD technology to enrich our industry, our communities, and the world. Our mission is to build great products that accelerate next-generation computing experiences – the building blocks for the data center, artificial intelligence, PCs, gaming and embedded. Underpinning our mission is the AMD culture. We push the limits of innovation to solve the world’s most important challenges. We strive for execution excellence while being direct, humble, collaborative, and inclusive of diverse perspectives.\n\nAMD together we advance_\n\nTHE ROLE:\n\nAMD is looking for a senior software developer to work within our Developer Programs team.\n\nTHE PERSON:\n\nWe’re looking for a team member to help us develop an innovative web site for developers with high impact. You are somebody who enjoys solving complex problems and is eager to learn new technologies. Whether you’re a full-stack expert or specialize in front-end development, your attention to detail and conscientious approach will shine. You’ll take ownership of your areas whilst also collaborating effectively with cross-functional teams, fostering a warm and inclusive environment.\n\nKEY RESPONSIBILITIES:\n• Website development: Collaborate with your team and wider stakeholders to implement a new user-friendly, robust website to support our software developer audience with creating and improving their applications.\n• Performance optimization: Continually optimize application performance and troubleshoot complex issues.\n• Security and SEO: Maintain and enhance website security, performance, and SEO.\n• Internal tools: Assist with development of internal deployment tools.\n• Publishing content: Assist stakeholders with deploying content.\n\nPREFERRED EXPERIENCE:\n• Strong React and/or Angular knowledge, including Typescript.\n• Proficiency in HTML/CSS/SCSS.\n• Python proficiency.\n• Git/GitHub familiarity.\n• Basic Linux knowledge.\n• Eye for great design and UX principles.\n• Native-level (English) light technical content writing/editing.\n• Good interpersonal skills with an understanding of diverse stakeholder perspectives.\n• Conscientious, with a great eye for detail.\n\nADDITIONAL EXPERIENCE (any of these might boost your application):\n• Astro, Next.js, or any SSG/SSR website development.\n• Django\n• Markdown (including processing).\n• WordPress\n• Headless CMS experience.\n• Azure AD/Entra ID.\n• Web server configuration.\n• QA experience with web projects.\n• Working effectively in a global remote work environment.\n• Interest in ML, computer hardware, graphics, or gaming.\n• Typescript, React, Angular, SSR\n\nPython (Programming Language), Git, Documentation, Full-Stack Development\n\nACADEMIC CREDENTIALS:\n• Bachelor’s or Master’s degree in Computer/Software Engineering, Computer Science, or related technical discipline\n\n#LI-LB1\n\n#REMOTE\n\nBenefits offered are described: AMD benefits at a glance.\n\nAMD does not accept unsolicited resumes from headhunters, recruitment agencies, or fee-based recruitment services. AMD and its subsidiaries are equal opportunity, inclusive employers and will consider all applicants without regard to age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third-party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status, or any other characteristic protected by law. We encourage applications from all qualified candidates and will accommodate applicants’ needs under the respective laws throughout all stages of the recruitment and selection process.",
            "location": "Vancouver, BC, Canada",
            "employmentType": "",
            "datePosted": "11 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "AMD Careers",
                    "url": "https://careers.amd.com/careers-home/jobs/55537?lang=en-us&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "SimplyHired",
                    "url": "https://www.simplyhired.ca/job/yx5mkuHQk232TUgleZPDUlzfMlTOudFLhC69Hg_t6ulWFKr6GY0bsA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Workopolis",
                    "url": "https://www.workopolis.com/jobsearch/viewjob/8njWwX13OwC1zCPSBea7z8estEFrS4ytDw78yXVxY1bh-xzvIKNRafEC0sqrO7kq?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "BeBee Canada Meet Opportunities",
                    "url": "https://ca.bebee.com/job/5fbc6e7ad72c19a7d93c52d256da474a?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jobs.com",
                    "url": "https://www.jobs.com/en-ca/jobs/senior-website-software-development-engineer-vancouver-bc--d0909092-0e0e-4bfd-a72e-0e0aa9c44bb3?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Aijobs.net",
                    "url": "https://aijobs.net/job/755355-senior-website-software-development-engineer/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Canada Job Bank",
                    "url": "https://canadajobbank.org/senior-software-development-engineer-4/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jobs Trabajo.org",
                    "url": "https://ca.trabajo.org/job-3026-e461aa5e6187fb890998a0f9784be099?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Python"
                },
                {
                    "name": "Go"
                },
                {
                    "name": "HTML"
                },
                {
                    "name": "CSS"
                },
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Git"
                },
                {
                    "name": "GitHub"
                },
                {
                    "name": "Markdown"
                },
                {
                    "name": "React"
                },
                {
                    "name": "Angular"
                },
                {
                    "name": "Django"
                },
                {
                    "name": "Azure"
                }
            ]
        },
        {
            "jobType": "senior_web_developer",
            "title": "[Wattpad] Senior Web Engineer",
            "company": "WEBTOON Entertainment Inc. (Wattpad & WEBTOON Family of Brands)",
            "description": "Wattpad is a global multiplatform entertainment company whose vision is to entertain and connect the world through stories. Since 2006, we’ve been on a mission to use the power of community and technology to unleash the full potential of stories to the world. Every month 85 million people around the world spend over 23 billion minutes on Wattpad to share and discover stories they can’t find anywhere else. Our brand banner includes: Wattpad, Wattpad WEBTOON Studios, Wattpad Books and Wattpad Brand Partnerships. We’re proudly based in Toronto, but our reach is global. Come build the future of entertainment and storytelling, and write your next chapter with us!\n\nWe are seeking an experienced Senior Engineer to join our team and play a vital role in the development and maintenance of our web applications. The ideal candidate should have a strong understanding of front-end technologies and a passion for building innovative and user-friendly web applications.\n\nWhat you'll be doing:\n• Collaborating with designers, product managers, and other engineers to bring web features from concept to production\n• Developing and maintaining high-quality, scalable, and responsive front-end code\n• Implementing and optimizing for front-end performance, including load times, responsiveness, and accessibility\n• Working independently and as part of a team in a fast-paced, agile development environment\n• Staying up-to-date with the latest web development trends and technologies\n• Work across functional teams to ensure seamless integration of front-end and back-end systems\n\nWhat we are looking for:\n• 5 years as a Web Engineer, with 2 years in a Senior capacity.\n• You have extensive experience with React and Node.js on large scale applications and know how to navigate a complex code base\n• You have experience working with SSR and how to leverage modern SSR concepts to enhance performance and optimize user experience\n• You have experience with frontend performance optimization (e.g., lazy loading, code splitting, caching).\n• You are familiar with CI/CD tools like GitHub Actions and Travis.\n• You have strong skills in HTML, CSS, and JavaScript.\n• You are passionate about writing clean, efficient code and also recognize the importance of collaboration and enjoy working with great teams to deliver the best results.\n\nNice to have:\n• Experience migrating legacy code bases to modern tech stacks\n• Experience working with Remix\n\nWhat we offer:\n• Career development; we believe in mentorship and investing in your learning, supporting you to achieve your goals\n• Health benefits, including vision and dental!\n• RRSP Contributions (Canada), 401K Contributions (USA)\n• Generous vacation and Parental Leave Top-up\n• Corporate discount for gym memberships for you and your family\n• Winter break shutdown and a whole lot more!\n\n$120,000 - $160,000 a year\n• Please note that the salary range is listed in CAD.\n\nWattpad is conducting all interviews in a distributed manner using applicable third party software where needed and using visual interface tools such as Google Hangouts and Zoom.\n\nAbout Wattpad\n\nWho are we? Entrepreneurs and Do-ers. Our vision is to entertain and connect the world through stories, and our mission is to use the power of community and technology to unleash the full potential of stories to the world.\n\nWhat does that mean? We are visionaries, community builders, passionate problem solvers, storytellers, coffee snobs (tea drinkers, too!), curious by nature, and culturally diverse.\n\nWhat are we obsessed with? Our users. Solving complex problems and maximizing flow. Learning constantly. Building the next great storytelling product. Finding the greatest stories ever told. Dogs (and cats), coffee, and good snacks.\n\nHow do we work? Autonomously, collaboratively, respectfully. Balancing with work, family, and play...and all while having a great time.\n\nWattpad is a remote friendly company and encourages remote candidates to apply as long as they are located and authorized to work in either the US or Canada (excluding Quebec) as a precondition of employment. We are not able to sponsor applicants for work permits.\n\nIf you happen to live near the areas of either Toronto, Ontario or Halifax, Nova Scotia, you may also have the opportunity to work from our beautiful offices - 1 located in Downtown Toronto and the other in Halifax.\n\nCulture and Diversity\n\nWattpad is an equal opportunity employer. We do not discriminate. Period.\n\nWattpad welcomes and encourages applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process. We have taken a leadership position on creating a culture and an organization that truly values diversity. We are committed to fostering a global team that reflects the diversity of the Wattpad community. At Wattpad, we believe cultural fit doesn’t mean culturally identical, and diversity of thought helps us to challenge one another to think big and think differently. We consider employment applicants without regard to age, race, colour, national origin, citizenship, religion, creed, sex, sexual orientation, veteran status, marital status, disability status or any other protected status.\n\nIf you have any special needs or accessibility requirements, please let us know. We will do our utmost to accommodate, in accordance with applicable local legislation.\n\nDon’t meet all the requirements? Studies show women and people of colour are less likely to apply to jobs if they do not meet all the qualifications. Therefore, in an effort to build a more diverse workplace, we encourage you to apply anyways. You might actually be the right person or you may be a good fit for a number of other openings we currently have.",
            "location": "Toronto, ON, Canada",
            "employmentType": "",
            "datePosted": "",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Lever",
                    "url": "https://jobs.lever.co/wattpad/37a815a6-9b59-456e-9007-d14a00dc6fd7?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Talent.com",
                    "url": "https://ca.talent.com/view?id=26bcdf096b53&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Ladders",
                    "url": "https://www.theladders.com/job/wattpad-senior-web-engineer-wattpad-halifax-ns_78107680?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Java"
                },
                {
                    "name": "Go"
                },
                {
                    "name": "JavaScript"
                },
                {
                    "name": "HTML"
                },
                {
                    "name": "CSS"
                },
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Git"
                },
                {
                    "name": "GitHub"
                },
                {
                    "name": "React"
                },
                {
                    "name": "Node.js"
                },
                {
                    "name": "GitHub Actions"
                }
            ]
        },
        {
            "jobType": "senior_web_developer",
            "title": "Senior Full Stack Web Developer (Job Req #2024-285)",
            "company": "Ross Video",
            "description": "Why Work at Ross Video? We have a great group of people working together to create and deliver cutting edge products that look amazing and are easy to use. We go all out so that our customers can have the best possible experience and achieve quality results. With a product focus, continual learning, results driven processes, and creative thinking, we constantly strive to improve our solutions and to deliver results. If you've ever watched live television, news, sports, or entertainment, you've seen our products in use. All of the major Hollywood award shows, most professional sports teams, and many of the largest broadcasters in the world use Ross Video technology. Get behind the scenes and learn about what it takes to make live events possible. If that resonates, and you’re someone with integrity, commitment, and a strong drive to deliver great products, we’d love to hear from you.\n\nAs part of the development team, you will be helping conceive, design, develop and deliver products in a variety of broadcast applications . You will work to improve and grow the technical competence of our designs. Our small teams encourage outside of the box thinking, we value innovation and feedback, and you will work alongside a diverse group of people with a broad range of skills and experience. You will be working on real-world applications and get to see the results of your hard work firsthand.\n\nWE'RE AFTER A PARTICULAR TYPE OF AWESOME\n\nYou need to be passionate about working in code and love working with different development tools and frameworks to create powerful applications with highly functional user experiences. We value experience in embedded systems engineering, multi-threading, design patterns, best practices such as Domain Driven Design, T est D riven D evelopment, Behavior Driven Development, high performance design, and Agile software methodolog ies .\n\nYou enjoy exploring new ideas and know how to test your work quickly and effectively. We work in an Agile environment, with a flat structure that encourages minimal oversight and encourages freedom and flexibility to complete your task.\n\nWho you report to: Manager, Software Development\n\nWhat we offer:\n\nRoss offers competitive salaries and comprehensive health plans, as well as several perks to help you perform at your best.\n\nSome of these perks include flexible hours, generous paid time off, fitness/wellness allowance, employee share ownership program, professional development support and a ton of fun social activities and events!\n\nBest of all, you will be part of the Ross Video team, and we’ve got a pretty energizing environment here.\n\nWhat the job is all about:\n• Participate in the full software development lifecycle – requirements gathering, scoping, design, implementation, documentation, testing, and maintenance.\n• Write code across the full stack – UI, server application, device drivers and data storage.\n• Provide design reviews and code reviews for fellow team members promoting high-quality work, sound software methodologies and attention to detail.\n• Produce clean, testable, and efficient code based on specifications .\n• Create technical documentation for reference and reporting.\n• Coach and mentor other developers on the team .\n• Assist tech support and/or customers to resolve technical issues when required\n• Advocate f or new tools, technologies and approaches that can help the team and our products\n\nWho you are:\n• 5 + years of experience in software engineering or a related industry\n• Bachelor Degree or higher in a related field of study\n• Familiarity with SVN, Git or Mercurial\n• Familiarity with TCP/IP client-server programming\n• A development background in web development or IoT development\n• Professional experience developing in ReactJS\n• Object-oriented software design using C++ or Java\n• Interest in implementing development processes and adopting best practices, particularly when it comes to enhancing both quality and performance\n• Excellent problem-solving and debugging skills\n\nBonus points if you have the following:\n• Experience with Playwright or other automation teste frameworks for React\n• Experience with Jenkins or other pipeline tools\n• Experience working in an Agile Scrum software development team\n• Experience with test automation and related development techniques\n• Knowledge and experience with Domain Driven Design, Hexagonal Architecture, Test Driven Development and Behavioral Driven Development\n• Interest in implementing development processes and adopting best practices, particularly when it comes to enhancing both quality and performance\n\nEquity, Diversity & Inclusion\n\nAt Ross, we embrace diversity, and we want you to bring your authentic self to work. We are committed to building a team that includes a variety of backgrounds, perspectives, and skills. Inclusivity drives innovation and creativity, and that’s something we’re passionate about at Ross! We believe everyone should be able to enjoy a rewarding career at Ross, regardless of race, colour, religion, sexual orientation, gender, gender identity or expression, marital status, age, veteran status, physical or mental disability. If a disability means that you need any additional support during the recruitment process, please contact Talent Acquisition and we will make all reasonable efforts to accommodate your request.\n\nApply Now",
            "location": "Ottawa, ON, Canada",
            "employmentType": "",
            "datePosted": "16 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/senior-full-stack-web-developer-job-req-%232024-285-at-ross-video-4046444959?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Indeed",
                    "url": "https://ca.indeed.com/viewjob?jk=102440b6d18c54b2&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Dayforce HCM",
                    "url": "https://us242.dayforcehcm.com/CandidatePortal/en-US/rossvideo/Posting/View/7248?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "SimplyHired",
                    "url": "https://www.simplyhired.ca/job/bOLdieF2IWrIQtibP-N7cPo1glkfa1ukhCeLecoSmSk0KVPhM_SDxw?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Work In Tech Job Board - Communitech",
                    "url": "https://www1.communitech.ca/companies/ross-video/jobs/41362766-senior-full-stack-web-developer-job-req-2024-285?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Levels.fyi",
                    "url": "https://www.levels.fyi/jobs?jobId=137410455059473094&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Discover Technata Job Board",
                    "url": "https://jobs.discovertechnata.com/companies/ross-video/jobs/41362766-senior-full-stack-web-developer-job-req-2024-285?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jooble",
                    "url": "https://ca.jooble.org/jdp/6651792186762686279?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Java"
                },
                {
                    "name": "C++"
                },
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Git"
                },
                {
                    "name": "SVN"
                },
                {
                    "name": "Mercurial"
                },
                {
                    "name": "React"
                },
                {
                    "name": "Jenkins"
                },
                {
                    "name": "Scrum"
                },
                {
                    "name": "TCP/IP"
                }
            ]
        },
        {
            "jobType": "senior_web_developer",
            "title": "Senior Full Stack Web Developer",
            "company": "TM8",
            "description": "Our client is looking for a Senior Full Stack Web Developer, to join their team.\n\nThis role is remote-friendly, across CANADA ONLY - the dev team is in Vancouver.\n• *Reasons you'll want to work with this company:\n\n- You'll work on a product that helps society and people.\n\n- The work is diverse and challenging.\n\n- be a part of a close knit team where everyone is there to help each other (no egos)\n\n- Use the latest tech stack to build product and you are encouraged to seek out new tech to solve problems when the need arises.\n\n- Lots of opportunities to grow\n\n- Always encouraged to learn and work on tasks that's not necessarily in your comfort zone.\n\n- An environment where everyone is always trying to improve knowledge, skills and processes\n\n- The team isn't 'competitive against each other, it's all collaborative'\n\n- Team is super agile and we can swarm problems when they arise. everyone is kind of like a jack of all trades\n\nFeedback we received from other developers there:\n\"Best tech lead/manager I've ever had, encourages us to learn new stuff that's not in our wheelhouse and supports & trusts us\"\n\n\"Get to work on super interesting problems and build amazing things using new tech, allowing us to see what works best for us.\"\n\n\"I feel like my opinions are valued and heard which doesn't happen in bigger companies\"\n\nResponsibilities\n\n\\u25CF Execution of web growth strategy, spanning web products, testing, and automation\n\n\\u25CF Technical design, development, and delivery of web-based applications and services\n\n\\u25CF Create application pages to be responsive, fast, and easy-to-maintain by other\n\ndevelopers and content editors\n\n\\u25CF Contribute in making software development design decisions\n\nRequirements\n• Bachelor\\u2019s degree or diploma in computer science, computer engineering or related technical discipline is required\n• 5 years minimum web development experience\n• JavaScript - specifically ES6, ReactJS, NodeJS\n• Git version control, HTML5, CSS3, and build tools\n• Developing relational databases with MySQL\n• Developing with Elasticsearch\n• Working with and developing microservices\n• JIRA / Confluence\n• Assist with Cloud instance management and maintenance\n• Using automated deployment tools - specifically CircleCI\n• Understanding of working with AWS products and services\n• Working in an Agile/scrum environment\n\nBenefits excellent benefits package",
            "location": "Vancouver, BC, Canada",
            "employmentType": "",
            "datePosted": "7 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "ZipRecruiter",
                    "url": "https://www.ziprecruiter.com/c/TM8/Job/Senior-Full-Stack-Web-Developer/-in-Vancouver,BC?jid=18f1200846abbe1c&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Work In Tech Job Board - Communitech",
                    "url": "https://www1.communitech.ca/companies/scribendi/jobs/4326944-senior-full-stack-web-developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jobs Trabajo.org",
                    "url": "https://ca.trabajo.org/job-3051-f636edd372426d6273f1a16210ed8a7f?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Kit Job",
                    "url": "https://www.kitjob.ca/job/87305035/senior-full-stack-web-developer-s650-montreal/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Get.It",
                    "url": "https://www.get.it/job/senior-full-stack-web-developer-in-montreal-qc-at-evident-scientific-ga_538506936061002270?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Edajobs.com",
                    "url": "https://ca.edajobs.com/job/52481/Senior-Full-Stack-Web-Developer.html?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jobilize",
                    "url": "https://www.jobilize.com/job/ca-ottawa-senior-full-stack-web-developer-job-req-2024-285-ross-hiring?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "WhatJobs",
                    "url": "https://en-ca.whatjobs.com/job/Senior-Full-Stack/Canada/81135379?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Java"
                },
                {
                    "name": "JavaScript"
                },
                {
                    "name": "HTML"
                },
                {
                    "name": "CSS"
                },
                {
                    "name": "C"
                },
                {
                    "name": "SQL"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Git"
                },
                {
                    "name": "Confluence"
                },
                {
                    "name": "React"
                },
                {
                    "name": "MySQL"
                },
                {
                    "name": "Elasticsearch"
                },
                {
                    "name": "CircleCI"
                },
                {
                    "name": "AWS"
                }
            ]
        },
        {
            "jobType": "senior_web_developer",
            "title": "Senior Web Developer",
            "company": "Voices",
            "description": "Voices is the world’s #1 creative services marketplace.\n\nWe’ve helped tens of thousands of marketers, producers, instructors, and creative directors at the world’s biggest and most beloved brands find the right talent for their creative projects.\n\nHeadquartered in London, Canada, Voices matches clients with voice over, music, audio production, and translation professionals in over 160 countries.\n\nWe are looking for a Senior Web Developer to take a team leadership role in our web development group to help improve and extend our product. They should be someone who collaborates effectively with developers, designers, and product managers. We’re seeking an experienced full-stack developer with a proven track record who can design robust technical solutions, develop end-to-end applications, communicate their ideas clearly, and help others to achieve excellence.\n\nIf this resonates with you, let’s connect!\n\nAbout the position:\n• This is a permanent, full-time position in a hybrid work environment. While you’ll primarily work remotely, some in-office time may occasionally be required.\n• We’re looking for developers with several years of hands-on experience, ideally including leadership roles on web development projects. A diverse background is highly valued.\n• You will help design technical solutions for business problems presented by our Product and Marketing Teams.\n• You’ll be involved in all aspects of the Voices web application, including UI design, backend controls, APIs, application logic, and special architecture projects. Our primary languages are PHP and vanilla JavaScript, with occasional use of Node.js. Familiarity with modern PHP and JavaScript frameworks is a plus.\n• You should be able to plan and lead team sprints and projects through estimation and cooperative research.\n• You will have the opportunity to develop new features and find ways to improve the product. Sometimes these features will span multiple teams for an all-hands approach.\n• You will also handle internal support conversations, investigate trouble tickets, and contribute to occasional infrastructure projects.\n• You should also be comfortable with helping expand the knowledge of your colleagues and help them develop highly functional, efficient, and readable code.\n\nTypical tasks in the life of a Sr. Developer at Voices:\n• Guiding technical solution planning for sprints and small projects.\n• Designing work packages for your team that match up business and technical requirements.\n• Creating task tickets (Jira) to reliably deliver quality products.\n• Ensuring that your team meets compliance rules for security and accessibility.\n• Building customer-facing and internal user interfaces with CSS from LESS/SASS, HTML & JS.\n• Creating and extending an MVC application using PHP frameworks (CodeIgniter, Laravel) and occasional scripts. Other technologies such as WordPress also play a role.\n• Applying your knowledge of accessibility standards (AODA, WCAG) and site security (OWASP) to improve life for our users.\n• Testing your work for performance and bottleneck improvements.\n• Building or extending our internal APIs and 3rd-party integrations (Salesforce, S3, SQS, and other AWS services).\n• Working with multiple Git branches, writing and reviewing Pull Requests (BitBucket), and pushing production-level code regularly and on a schedule.\n• Oversee the preparation of the test and release plan for your work by creating DB migration scripts and collaborating with the testing team.\n• Helping to maintain our internal component library & design system, and contribute to build scripts (Gulp, Webpack, Babel).\n• Building new product pages and functionality for our website and documenting projects (Confluence).\n• Writing and updating technical documentation and requirements.\n• Reviewing and triaging support conversations. Fixing bugs and following up with our Product and Support teams.\n• Collaborating via Slack, Figma, and regular video or in-person chats.\n\nAbout you:\n• You want to ship regularly. Your passion is to build end-to-end software. You always want to improve and learn.\n• You understand the importance of quality code. Your code is documented, understandable and predictable. Tests are written with confidence.\n• You’re comfortable with a varied stack. You have production-level experience with JavaScript, PHP, React, build & migration scripts, and even asynchronous queues.\n• You have production-level experience with WordPress development (or other similar CMS).\n• You can explain your thinking. You are able to communicate your ideas or issues well.\n• Your goal is to build for everyone. You are skilled in developing front-ends from scratch to create valid, reusable, performant, and accessible pages at all screen sizes.\n• You are self-motivated and can work independently. You take the initiative to make sure that you have everything you need and will call for support when required.\n• You love learning. You thrive on solving problems, learning new tricks, bridging the gaps between new and old, and want to keep getting even better.\n• You love sharing. Helping your team based on your experience is time well spent.\n• You have 3+ years experience in database-driven web site development.\n• You have been able to lead a team to a positive, shared goal.\n• You earned a BS or MS in Computer Science, Diploma in Web Development or have the equivalent work experience.\n\nYou will work with:\n• Development Manager\n• Technical Project Managers\n• Product Managers\n• Product Designers\n• UX Researchers\n• Product & Marketing Developers\n• Infrastructure Developers\n• Analytics & Data Science Team\n• Quality Assurance Team\n\nEqual Employment Opportunities\n\nVoices.com values diversity. We're proud to be an equal opportunity employer and consider qualified applicants without regard to race, color, religion, sex, national origin, ancestry, age, genetic information, sexual orientation, gender identity, marital or family status, veteran status, medical condition or disability.\n\nAccommodation\n\nVoices.com is committed to providing accommodation for applicants with disabilities; please let us know if you require an accommodation during the recruitment process.\n\nApply Online\n\nInterested candidates are encouraged to send their cover letter and résumé by completing the online application. By doing so, your resume is guaranteed to be reviewed.",
            "location": "Waterloo, ON, Canada",
            "employmentType": "",
            "datePosted": "9 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Glassdoor",
                    "url": "https://www.glassdoor.ca/job-listing/senior-web-developer-voices-JV_IC2280158_KO0,20_KE21,27.htm?jl=1009439843965&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "SimplyHired",
                    "url": "https://www.simplyhired.ca/job/jTWF5qcOdG-zlkQ-TimK1YYqaQP6kNPLuPACqNwbBXZ23YDYwDu4vQ?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jobs Trabajo.org",
                    "url": "https://ca.trabajo.org/job-2401-d758364fae8073dc5c64d1eaac5a85a8?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Java"
                },
                {
                    "name": "JavaScript"
                },
                {
                    "name": "HTML"
                },
                {
                    "name": "CSS"
                },
                {
                    "name": "PHP"
                },
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Git"
                },
                {
                    "name": "Confluence"
                },
                {
                    "name": "React"
                },
                {
                    "name": "Node.js"
                },
                {
                    "name": "AWS"
                },
                {
                    "name": "Jira"
                },
                {
                    "name": "Figma"
                }
            ]
        },
        {
            "jobType": "senior_web_developer",
            "title": "Senior Web Designer",
            "company": "Musora Media",
            "description": "Senior Web Designer\n\nDepartment: Conversion\n\nEmployment Type: Full Time\n\nLocation: Abbotsford, BC\n\nReporting To: Tiago Ritter\n\nCompensation: $90,000 - $120,000 / year\n\nDescription\nAt Musora, we’re creating the ultimate music lessons experience – with more than 100,000 music students learning and playing drums, piano, guitar, singing, and bass (coming soon).\n\nWe are looking for a senior web designer to work alongside our marketers and creatives to build compelling landing pages, sales sites, and website experiences.\n\nThe ideal candidate should have serious design chops – a master of Figma with a passion for graphics, typography, storytelling, user experience, and conversion.\n\nYou care about the website visitor, understand how to translate features and benefits into a strong visual experience, and care deeply about compiling and organizing impactful assets that will build trust and present a high-converting offer.\n\nYou love studying new concepts. You’re curious about how the best brands in the world are framing products, reducing friction, and blending copy with media. You’re excited when Apple launches a new product just to look at the sales page.\n\nAnd you can lead. If you need a photoshoot, you can set it into motion. You can manage juniors, projects, and web reviews. You’re organized, an excellent communicator, and you love working in a collaborative, creative environment.\n\nThe right person will become an essential part of our marketing team – gaining energy by building alongside passionate marketers, challenging each others’ ideas and campaigns, reviewing and refining every detail, and launching really cool websites that’ll be seen by millions … and make you smile with pride when they’re published.\n\nIf you’re reading along and thinking THIS IS ME, we need to see your application!\n\nKey Duties & Responsibilities\n1. Design our websites.\n\nProduct pages. Shop indexes. Sales pages. Landing pages. You can design, collaborate, and deliver all of the essential digital marketing website assets optimized for desktop, mobile, and beyond. You understand the audiences arriving at those pages – whether it’s from social, ads, or beyond – and how to connect the websites into the contextual experience.\n\n2. Build with marketers.\n\nYou’ll be building alongside marketers who rely on these assets to hit their goals. You’ll enjoy taking various ideas into consideration, collaborating on design choices, and delivering assets that represent our products and appeal to our audiences.\n\n3. Deliver the final assets.\n\nYou’ll work with photographers, graphic designers, and front-end developers to deliver the final website experiences. While you’ll have support, it’s your responsibility to make sure the designs are represented in the final website experience.\n\n4. Inform our design systems.\n\nYou’ll work alongside our marketing leads to build templates, guidelines, and systems to develop, maintain, and extend our website design systems so it’s easier to build winning designs, faster, every time.\n\n5. Manage multiple projects simultaneously.\n\nYou’ll always have multiple projects on the go – at various stages of concept to completion – with an expectation to make sure they’re meeting deadlines and resource constraints. You’ll need to collaborate with peers, apply critical thinking, and be consistently aligned with marketing priorities to inform your decisions.\n\nSkills, Knowledge and Expertise\n• Expertise in design software and technology. (Figma, Photoshop)\n• Familiarity with peripheral software and tools (Illustrator, InDesign, Canva)\n• Consistent taste for aesthetics and an eye for detail.\n• Excellent communication and time management.\n• You follow the trends and best practices in digital marketing, web design, and conversion.\n• You can type 50+ words per minute. (Typing shouldn’t slow you down.)\n• Comfortable with the Google Suite (Gmail, Docs, Sheets, Calendar).\n• Work in-person, on-site in Abbotsford, BC.\n• Proficient in written & spoken English.\n\nBonus Points:\n• You love music.\n• 10+ years of design experience.\n• You’ve worked in Shopify for landing pages and checkout.\n• Relevant design or marketing degrees and certifications.\n• Experience setting up digital asset management.\n• Photo editing or video editing. (Not expected, but a nice skill to have!)\n\nPerks to working here (your benefits)\n• Extended Benefits. Health, Prescriptions, Dental, Mental Health Support and Vision Benefits for full-time/permanent positions - we care about our employees and we want to make sure YOU have the benefits you need to stay healthy and well.\n• Paid time off - we understand and value the importance of rest and recovery and that includes time away from work!\n• Career Growth. You’re joining a growing team and company with ambitious goals.\n• Learning & Development. We encourage our team to develop their unique strengths, offering Gallup-Clifton Strengths coaching and workshops, along with tailored education opportunities.\n• Onsite Amenities and Events. Onsite parking, on-site gym, and events! Be a part of a fun-loving team!\n• Onsite SNACKS, beer/kombucha fridge, coffee/tea and more! We want to make sure you stay fuelled throughout the day!\n• Casual dress. We want you to feel comfortable when you work. No need to wear a business suit [unless you want to].\n• Flexible work. Work on-site at our Abbotsford, BC, Canada head office, remote, or in a hybrid environment (role dependant).",
            "location": "Abbotsford, BC, Canada",
            "employmentType": "",
            "datePosted": "9 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Jobs At Musora Media | Musora Media Careers - Musora",
                    "url": "https://careers.musora.com/en/postings/aec3e0ce-ffb7-43f4-aad5-647f5f67f669?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/senior-web-designer-at-musora-media-inc-4072222589?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "SimplyHired",
                    "url": "https://www.simplyhired.ca/job/M1LAEdrk59jjQniLGY-8PvsJsSL0U6-i0L_qrCJvwfGhTk3lDKlYyg?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Indeed",
                    "url": "https://emplois.ca.indeed.com/viewjob?jk=857bcfbc537ff26d&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Monster.ca",
                    "url": "https://www.monster.ca/job-openings/senior-web-designer-abbotsford-bc--2040898f-e14a-4216-bcef-e87732f41977?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "BeBee Canada Meet Opportunities",
                    "url": "https://ca.bebee.com/job/79fedff5cc8360b6d31b0b522bdd3f37?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Glassdoor",
                    "url": "https://fr.glassdoor.ca/job-listing/senior-web-designer-musora-JV_IC2278191_KO0,19_KE20,26.htm?jl=1009520925271&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Glassdoor",
                    "url": "https://www.glassdoor.com/job-listing/senior-web-designer-musora-JV_IC2278191_KO0,19_KE20,26.htm?jl=1009520925271&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Go"
                },
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Figma"
                }
            ]
        },
        {
            "jobType": "senior_web_developer",
            "title": "Sr. Web Developer - AEC Integration",
            "company": "Esri",
            "description": "Overview\n\nAEC firms and infrastructure owner/operators increasingly demand seamless integration between GIS data and BIM models to improve all aspects of asset design, construction, and operation. The global demand for housing and the need for roads, energy, and water to support them requires innovative workflows that help owners, engineers, planners, and stakeholders collaborate. Esri is working in partnership with Autodesk and other firms to help our customers design, build, and operate the sustainable infrastructure of the future more rapidly, at lower cost, and in compliance with complex regulatory landscapes.\n\nProviding this integration requires innovative software engineering to ensure reliable, secure, seamless, and scalable access to this information in ways that are user- and industry-focused while adapting to evolving global standards for BIM and GIS, such as IFC, 3D Tiles, and Esri i3s.\n\nIn this role, you will be the crucial resource in the design and implementation of this integration. Help define the future of GIS-AEC integration in collaboration with the product owner, product engineers, and software engineering peers on a multi-disciplinary team.\n\nResponsibilities\n• Design and implement:\n• Integration between the ArcGIS geospatial cloud and cloud-based BIM systems such as Autodesk Forge, Autodesk BIM360, and other information systems such as Oracle Primavera and Microsoft SharePoint\n• Public and internal RESTful APIs to integrate the above platforms\n• Framework widgets compatible with ArcGIS Experience Builder\n• Geoprocessing tools to automate the linking and data migration of BIM data to ArcGIS\n• Communicate with industry developers on best practices for extending ArcGIS to the AEC and BIM industries\n• Design real-time and batch data pipelines for synchronizing versioned BIM data with GIS\n\nRequirements\n• 5+ years of software product development experience\n• Demonstrated experience developing cloud infrastructure, backend services, and data pipelines\n• Exceptional understanding of TypeScript, JavaScript, NodeJS, Bootstrap, React, Angular, and other responsive web frameworks or extensive experience with C++, .NET and/or Python\n• Knowledge of Agile software engineering processes\n• Excellent problem-solving and debugging skills\n• Demonstrated experience in software product development using or producing commercial REST APIs\n• Solid understanding of OAuth authentication patterns in a variety of cloud and on-premise environments including SSL-based SSO\n• Bachelor's in computer science, computer engineering, or a related field\n\nRecommended Qualifications\n• Demonstrated experience with 2D and 3D computational geometry\n• Mastery of scalable full-stack software engineering architecture\n• Experience with Autodesk Forge, ObjectArx, or Revit APIs\n• Experience with ArcGIS Enterprise or ArcGIS Online web application development\n• Familiarity with a server-side rendering of web components, preferably Next.js/React.js\n• Experience delivering product features in a consumer or enterprise company\n• Experience with cloud services such as Amazon AWS, Microsoft Azure\n• Experience implementing unit tests and integration tests\n• Master's in computer science, computer engineering, or a related field\n\nAbout Esri\n\nAt Esri, diversity is more than just a word on a map. When employees of different experiences, perspectives, backgrounds, and cultures come together, we are more innovative and ultimately a better place to work. We believe in having a diverse workforce that is unified under our mission of creating positive global change. We understand that diversity, equity, and inclusion is not a destination but an ongoing process. We are committed to the continuation of learning, growing, and changing our workplace so every employee can contribute to their life’s best work. Our commitment to these principles extends to the global communities we serve by creating positive change with GIS technology. For more information on Esri’s Racial Equity and Social Justice initiatives, please visit our website here.\n\nIf you don’t meet all of the preferred qualifications for this position, we encourage you to still apply!\n\nEsri is an equal opportunity employer (EOE) and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status, or any other characteristic protected by law. If you need reasonable accommodation for any part of the employment process, please email askcareers@esri.com and let us know the nature of your request and your contact information. Please note that only those inquiries concerning a request for reasonable accommodation will be responded to from this e-mail address.\n\nEsri Privacy Esri takes our responsibility to protect your privacy seriously. We are committed to respecting your privacy by providing transparency in how we acquire and use your information, giving you control of your information and preferences, and holding ourselves to the highest national and international standards, including CCPA and GDPR compliance.",
            "location": "Ottawa, ON, Canada",
            "employmentType": "",
            "datePosted": "3 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/sr-web-developer-aec-integration-at-esri-4040142219?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Greenhouse",
                    "url": "https://boards.greenhouse.io/embed/job_app?for=esri&token=4528807007&b=https://www.esri.com/careers/4528807007&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "The Muse",
                    "url": "https://www.themuse.com/jobs/esri/sr-web-developer-aec-integration?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Glassdoor",
                    "url": "https://www.glassdoor.ca/job-listing/sr-web-developer-aec-integration-esri-JV_IC2286068_KO0,32_KE33,37.htm?jl=1009472876850&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "AnitaB.org Job Board",
                    "url": "https://jobs.anitab.org/companies/esri/jobs/41139463-sr-web-developer-aec-integration?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Levels.fyi",
                    "url": "https://www.levels.fyi/jobs?jobId=108234494988690118&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jooble",
                    "url": "https://ca.jooble.org/jdp/-592475805502235769?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Talent.com",
                    "url": "https://ca.talent.com/view?id=64ba685e1752&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Python"
                },
                {
                    "name": "Java"
                },
                {
                    "name": "C++"
                },
                {
                    "name": "JavaScript"
                },
                {
                    "name": "TypeScript"
                },
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "React"
                },
                {
                    "name": "Angular"
                },
                {
                    "name": "Bootstrap"
                },
                {
                    "name": "AWS"
                },
                {
                    "name": "Azure"
                },
                {
                    "name": "SSL"
                }
            ]
        }
    ]
}