{
    "jobs": [
        {
            "jobType": "staff_software_engineer",
            "title": "Staff Software Developer",
            "company": "WARNERMEDIA",
            "description": "Welcome to Warner Bros. Discovery… the stuff dreams are made of.\n\nWho We Are…\n\nWhen we say, “the stuff dreams are made of,” we’re not just referring to the world of wizards, dragons and superheroes, or even to the wonders of Planet Earth. Behind WBD’s vast portfolio of iconic content and beloved brands, are the storytellers bringing our characters to life, the creators bringing them to your living rooms and the dreamers creating what’s next…\n\nFrom brilliant creatives, to technology trailblazers, across the globe, WBD offers career defining opportunities, thoughtfully curated benefits, and the tools to explore and grow into your best selves. Here you are supported, here you are celebrated, here you can thrive.\n\nJob Summary\n\nWarner Brothers Discovery’s digital arm, Global Customer Experience (GCX) organization is a high-performing global team working at the dynamic intersection of Technology and Entertainment. In supporting our content creators in the digital space, we continuously leverage our technological capabilities to create immersive viewing experiences for iconic brands including Max.\n\nAs a Staff Software Engineer, you will play a key leadership role within the GCX Web team, helping to architect, develop, and maintain our suite of web applications. You will collaborate closely with our product organization and other engineering leaders to drive technical excellence, mentor team members, and deliver impactful solutions that enhance the user experience.\n\nKey Responsibilities\n• Technical Leadership: Provide technical leadership and guidance across the Web team, making critical decisions on architecture, technology choices, and development practices.\n• Architecture & Design: Lead the design and development of scalable, maintainable, and performant frontend applications. Ensure alignment with business goals and best practices.\n• Mentorship: Mentor and coach engineers at all levels, fostering a culture of collaboration, continuous improvement, and innovation.\n• Collaboration: Work closely with cross-functional teams including product, UX/UI design, backend engineering, and QA to deliver high-quality features and ensure seamless user experiences.\n• Code Reviews: Lead and participate in code reviews, ensuring best practices, code quality, and knowledge sharing.\n• Performance Optimization: Ensure that all frontend applications are optimized for speed, scalability, and responsiveness, with a focus on performance improvements and efficient code execution.\n• Innovation & Problem Solving: Continuously identify areas for technical improvement and propose solutions that enhance the development process and overall product.\n• Hands-on Development: Write high-quality, maintainable, and scalable code as needed, balancing leadership responsibilities with hands-on technical work.\n\nQualifications\n\nExperience: 7+ years of experience in software engineering, with a focus on frontend web development. At least 2 years in a staff or senior-level role leading technical initiatives and mentoring others.\n\nTechnical Expertise:\n• Proficiency in JavaScript/TypeScript and modern frontend frameworks such as React, Vue.js, or Angular.\n• Deep understanding of HTML5, CSS3, SASS/LESS, and responsive design principles.\n• Strong knowledge of RESTful APIs and state management libraries (e.g., Redux).\n• Experience with modern build tools such as Webpack, Babel, and frontend testing frameworks (e.g., Jest, Cypress).\n• Familiarity with CI/CD pipelines and frontend performance optimization techniques.\n• Leadership Skills: Demonstrated ability to lead and mentor engineering teams, guiding architecture decisions and fostering a culture of collaboration.\n• Communication: Excellent verbal and written communication skills, with the ability to explain technical concepts to both technical and non-technical stakeholders.\n• Problem Solving: Strong analytical and problem-solving abilities with a passion for innovation and driving technical excellence.\n\nNice-to-Haves\n• Knowledge of or previous experience working on direct-to-consumer video applications.\n• Familiarity with component libraries and design systems.\n• Experience working in agile development environments and with tools like Jira and Confluence.\n• Contributions to open-source projects or involvement in the frontend development community.\n\nHow We Get Things Done…\n\nThis last bit is probably the most important! Here at WBD, our guiding principles are the core values by which we operate and are central to how we get things done. You can find them at www.wbd.com/guiding-principles/ along with some insights from the team on what they mean and how they show up in their day to day. We hope they resonate with you and look forward to discussing them during your interview.\n\nChampioning Inclusion at WBD\nWarner Bros. Discovery embraces the opportunity to build a workforce that reflects the diversity of our society and the world around us. Being an equal opportunity employer means that we take seriously our responsibility to consider qualified candidates on the basis of merit, without regard to race, color, religion, national origin, gender, sexual orientation, gender identity or expression, age, mental or physical disability, and genetic information, marital status, citizenship status, military status, protected veteran status or any other category protected by law.\n\nIf you’re a qualified candidate with a disability and you require adjustments or accommodations during the job application and/or recruitment process, please visit our accessibility page for instructions to submit your request.",
            "location": "Kanata, ON, Canada",
            "employmentType": "",
            "datePosted": "",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "WBD Careers - Warner Bros. Discovery",
                    "url": "https://careers.wbd.com/global/en/job/R000085802/Staff-Software-Developer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Indeed",
                    "url": "https://ca.indeed.com/viewjob?jk=e7a184dfcb0f1e6e&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "The Muse",
                    "url": "https://www.themuse.com/jobs/warnerbrosdiscovery/staff-software-developer-bb664a?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Glassdoor",
                    "url": "https://www.glassdoor.ca/job-listing/staff-software-developer-lightspeed-JV_IC2286068_KO0,24_KE25,35.htm?jl=1009442825953&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "SimplyHired",
                    "url": "https://www.simplyhired.ca/job/yto3gmXz8uMWKcMIAN7tZu-ErJtoPuVSHS_W9Q8KEyDQFxrQaBf8VQ?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/staff-software-developer-at-lightspeed-commerce-4023641935?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Karkidi",
                    "url": "https://www.karkidi.com/job-details/65699-staff-software-developer-job?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "ShowbizJobs",
                    "url": "https://www.showbizjobs.com/jobs/warner-bros-discovery-staff-software-developer-in-ottawa/jid-r7x60q?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Java"
                },
                {
                    "name": "JavaScript"
                },
                {
                    "name": "TypeScript"
                },
                {
                    "name": "HTML"
                },
                {
                    "name": "CSS"
                },
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Cypress"
                },
                {
                    "name": "Confluence"
                },
                {
                    "name": "React"
                },
                {
                    "name": "Angular"
                },
                {
                    "name": "Vue.js"
                },
                {
                    "name": "Jira"
                }
            ]
        },
        {
            "jobType": "staff_software_engineer",
            "title": "Staff Software Engineer - MTS 2",
            "company": "eBay",
            "description": "At eBay, we're more than a global ecommerce leader — we’re changing the way the world shops and sells. Our platform empowers millions of buyers and sellers in more than 190 markets around the world. We’re committed to pushing boundaries and leaving our mark as we reinvent the future of ecommerce for enthusiasts.\n\nOur customers are our compass, authenticity thrives, bold ideas are welcome, and everyone can bring their unique selves to work — every day. We're in this together, sustaining the future of our customers, our company, and our planet.\n\nJoin a team of passionate thinkers, innovators, and dreamers — and help us connect people and build communities to create economic opportunity for all.\n\neBay's Recommendations team is looking for an outstanding Senior Staff Engineer to work with as we redefine the face of eBay. You’ll be working with a world class team of Engineers, Data Scientists/Applied Researchers, Product Managers, Designers, and Analysts to create great products that make a difference on one of the world’s most trafficked and loved websites.\n\nThe ideal candidate has a deep understanding of building large scale applications, low latency API’s, data pipelines, and a high focus on capability oriented architecture. As the lead engineer you will oversee aspects of the software lifecycle.\n\nPrimary Job Responsibilities:\n• Define, design, and implement highly scalable, resilient and performant distributed systems focusing on customer experience\n• Work throughout all phases of the software development process independently as well as work jointly with other team members\n• Collaborate with architects, product management, engineering, data scientists/Applied Researchers, Analysts and Operations teams to develop innovative solutions alignment to development/business goals and principles\n• Lead product design, produce clear, well-documented design docs, and participate in design and code reviews\n• Voice support for and communicate your design, methods, and results to a community of developers, analysts, and product managers\n• Provide technical guidance, coaching, mentorship to develop and improve performance of individual team members and success of overall team\n• Rigorously follow Definition of Done (DoD) process for better quality and other release criteria standards\n• Lead by example and share knowledge with the team\n• Support hiring top talents, coach and mentor junior team members\n• Able to lead the scrum team and run scrum ceremonies effectively.\n\nJob Requirements\n• BS/BA in Computer Science or related field plus 10+ years work experience or MS with 8+ years of relevant experience\n• Experience on software design and development experience, solid foundation in computer science with strong proficiencies in system architecture, distributed systems, data structures, algorithms, OOPs, OOA/D and Functional programming\n• Proven experience in software development using Java, Scala, RESTful Web Services. Experience with Python and/or JS is a plus.\n• Experience in developing data-driven applications using an industry standard RDBMS, NoSQL\n• Experience in designing, and building highly scalable, fault tolerant distributed systems and services for large web sites\n• Experience with big data technologies like Spark, Flink, and Kafka\n• Self-driven and with a delivery focused in a fast paced and dynamic environment.\n• Must demonstrate a sense of ownership to plan, implement and drive the product work to successful completion and be successful in a collaborative environment\n\nPlease see the Talent Privacy Notice for information regarding how eBay handles your personal data collected when you use the eBay Careers website or apply for a job with eBay.\n\neBay is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, veteran status, and disability, or other legally protected status. If you have a need that requires accommodation, please contact us at talent@ebay.com. We will make every effort to respond to your request for accommodation as soon as possible. View our accessibility statement to learn more about eBay's commitment to ensuring digital accessibility for people with disabilities.\n\nJobs posted with location as \"Remote - United States (Excludes: HI, NM)\" excludes residents of Hawaii and New Mexico.\n\nThis website uses cookies to enhance your experience. By continuing to browse the site, you agree to our use of cookies. Visit our Privacy Center for more information.",
            "location": "Toronto, ON, Canada",
            "employmentType": "",
            "datePosted": "5 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "EBay Jobs - EBay Inc.",
                    "url": "https://jobs.ebayinc.com/us/en/job/R0064585/Staff-Software-Engineer-MTS-2?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/staff-software-engineer-mts-2-at-ebay-4043368260?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Simplify Jobs",
                    "url": "https://simplify.jobs/p/c58fec01-f454-4fd6-83dd-97e985f4fe1a/Staff-Software-Engineer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Built In Toronto",
                    "url": "https://builtintoronto.com/job/mts-2-software-engineer/3381776?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "SimplyHired",
                    "url": "https://www.simplyhired.ca/job/yLYBzLWNzN0TwKnmHUMkOky3E_7wEaqVbBedgXBfc9TlxcyIRyAw9w?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Talentify",
                    "url": "https://www.talentify.io/job/mts-2-software-engineer-toronto-ontario-ca-ebay-r0064585?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "EBay Jobs: Careers At EBay",
                    "url": "https://ebaymigration.phenompeople.net/us/en/job/R0064585/MTS-2-Software-Engineer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "ClickaJobs",
                    "url": "https://ca.clickajobs.com/job/Staff-Software-Engineer/toronto/25358269?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Python"
                },
                {
                    "name": "Java"
                },
                {
                    "name": "C"
                },
                {
                    "name": "Scala"
                },
                {
                    "name": "SQL"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Kafka"
                }
            ]
        },
        {
            "jobType": "staff_software_engineer",
            "title": "Senior Staff Software Engineer",
            "company": "Posting Date:07/ 08/2024",
            "description": "161 Bay Street (93021), Canada, Toronto,Toronto, Ontario,\n\nSenior Staff Software Engineer\n\nSenior Staff Software Engineer\n\nThis is a senior technical position (senior manager equivalent). This role does not have direct reports. We require advanced enterprise solutions architecture design, technical system design, and hands-on software development.\n\nAbout Capital One Canada.\n\nWe've been helping millions of Canadians for over 20 years by providing them with access to credit when others wouldn’t. We're on a journey to put our customers first, and keep them there, by building modern technology solutions to simplify and humanize the world of credit cards. We have the positive energy of a startup, with the advantages of a big company.\n\nOur Capital One Software Studio.\n\nSince 2014, Capital One Canada’s software studio has grown from a team of 10 to a team of over 270. We’re passionate about what we do, and we’re always on the lookout for people who want to make a difference in the world of credit through technology. We’re obsessed with doing the right thing, and we achieve that by finding innovative ways to better serve our customers.\n\nWorking with us.\n\nHow do we do things at Capital One Canada? We listen — to our people, and to our customers. We change with the times and have adopted a flexible hybrid model. Associates working in the hybrid model are expected to come into the office 3 days a week across Tuesdays and Thursdays, reserving Mondays and Fridays as company-wide virtual days. As was true before the pandemic, expectations of being in the office will be balanced with personal life flexibility.\n\nAt Capital One we’re committed to diversity, inclusion and belonging. We strive to build a culture where diverse perspectives are valued, innovative ideas are encouraged and inclusive behaviors are embedded in everything we do to positively impact associates. Strive to build a culture where diverse perspectives are valued, innovative ideas are encouraged and to help challenge the status quo and create the best outcomes for everyone.\n\nWe’re focused on helping associates live well—physically, financially and emotionally. When you join us, we support you and those who are most important to you, offering full coverage for spouses, domestic partners, and dependents. We’ve designed our benefits program to be flexible, comprehensive and consistent across our organization. From health and fitness center discounts, to training and professional development programs—and much more—you’ll discover that Capital One is committed to helping you live your best life.\n\nA day in the life of a Capital One Staff Engineer\n\nAs a Solution Architect at Capital One Software Studio, you will orchestrate the creation of technology solutions that align with our business goals. Your day begins with a review of ongoing solution designs that are in different phases of their life cycles. You'll spend your time designing scalable and secure solution architectures, evaluating new technologies, and overseeing the development of high-level designs (HLD). You will engage in dynamic collaboration with cross-functional teams to advocate for best practices in architecture and design. For the new projects, you will closely work with your business partners to create sound business architectures. By day's end, you will have contributed to solutions and strategies that will shape our future, ensuring that all solutions are not only innovative but also follow our architectural and security standards.\n\nHere are a few of the ways we’re helping people take control of their credit:\n• Helping customers view and monitor their credit scores with Credit Keeper\n• Enabling customers to view and edit their Personal Information directly in the Mobile App\n• Providing customers 100% certainty which credit cards they’ll be approved for before they apply, by using Quick Check™\n\nWe’re all-in on the cloud and we’re leaders in the adoption of open source, RESTful APIs, microservices, and containers. We build our own products and release them with a speed and agility that allows us to get new customer experiences to market quickly. And, as a founder-led company, we’re inspired to make, break, do, and do good. So, let's do something great together.\n\nWant to learn more? Check out life at Capital One in the Software Studio!\n\nResponsibilities:\n• Design and implement architectural solutions that align with Capital One Canada's business goals and adhere to our architectural framework.\n• Develop and maintain a comprehensive catalog of technical and business capabilities, ensuring alignment with strategic objectives.\n• Lead the creation and review of Architectural Decision Records (ADRs) and High-Level Design (HLD) documents.\n• Actively participate in governance forums such as the Architectural Review Board ensuring compliance with internal and external standards.\n• Collaborate with stakeholders across all levels to promote technology strategies that deliver better business value and innovation.\n• Mentor and lead teams in the adoption of architectural best practices and continuous improvement initiatives.\n\nBasic Requirements:\n• Bachelor's Degree\n• At least 8 years of experience in Software Engineering and Systems Architecture or Technology Solution design\n• Certification in TOGAF, AWS, or other relevant architectural frameworks.\n• 3+ years of experience as a Solutions Architect in large/complex organizations\n• At least 2 years of experience creating solutions architectures in a public cloud (AWS, Microsoft Azure, Google Cloud)\n\nPreferred Qualifications\n• Master’s Degree in Computer Science, Engineering or Information Technology\n• 10+ years of experience in software engineering\n• 8+ years of experience architecting, designing, and/or delivering scalable and decoupled systems in a heavily regulated technology environment\n• 3+ years of experience working with internal and external business clients\n• 2+ years of experience with AWS concepts and implementations\n• Experience to engaging, influencing and driving initiatives by partnering with technology executives\n• Experience mentoring software engineers or architects\n• Experience in a regulated environment (HIPAA, PCI, Privacy, etc)\n• Ability to communicate at all levels in the organizations with required technical depth and breadth\n• AWS or equivalent certifications (Cloud Practitioner, Solution Architect-Associate)\n\nWe may use your information for automated decision making. We may, for certain purposes, render a decision based exclusively on automated processing of your personal information as a part of the candidate screening process.\n\nCapital One Canada is an equal opportunity employer committed to fostering a diverse and inclusive work environment. We consider all qualified applicants and will meet the needs of those requiring reasonable accommodations.\n\nIf you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation, please contact Capital One Recruiting at 1-800-304-9102 or via email at RecruitingAccommodation@capitalone.com. All information you provide will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations.\n\nFor technical support or questions about Capital One's recruiting process, please send an email to Careers@capitalone.com\n\nCapital One does not provide, endorse nor guarantee and is not liable for third-party products, services, educational tools or other information available through this site.\n\nCapital One Financial is made up of several different entities. Please note that any position posted in Canada is for Capital One Canada, any position posted in the United Kingdom is for Capital One Europe and any position posted in the Philippines is for Capital One Philippines Service Corp. (COPSSC).",
            "location": "Toronto, ON, Canada",
            "employmentType": "",
            "datePosted": "",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Capital One",
                    "url": "https://www.capitalonecareers.ca/job/toronto/senior-staff-software-engineer/1733/65694211808?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Indeed",
                    "url": "https://emplois.ca.indeed.com/viewjob?jk=dabde828c180d0c3&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Built In Toronto",
                    "url": "https://builtintoronto.com/job/senior-staff-software-engineer/2766891?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/senior-staff-software-engineer-at-capital-one-4021674809?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Talent.com",
                    "url": "https://ca.talent.com/view?id=9a8890b3cd62&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Ladders",
                    "url": "https://www.theladders.com/job/senior-staff-software-engineer-capitalonefinancialcorporation-toronto-on_76785077?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Taro",
                    "url": "https://www.jointaro.com/jobs/affirm/senior-staff-software-engineer-online-infrastructure-8e489bc6/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Blind",
                    "url": "https://www.teamblind.com/jobs/122976173?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Go"
                },
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "AWS"
                },
                {
                    "name": "Azure"
                },
                {
                    "name": "Google Cloud"
                }
            ]
        },
        {
            "jobType": "staff_software_engineer",
            "title": "Staff Frontend Software Engineer",
            "company": "Warner Music Group",
            "description": "At Warner Music Group, we’re a global collective of music makers and music lovers, tech innovators and inspired entrepreneurs, game-changing creatives and passionate team members. Here, we know that each talent makes our collective bolder and brighter.\n\nTechnology is one of the most important parts of our business. Whether it’s signing up new artists; ensuring we provide the right data to Spotify, YouTube, and other digital service providers; or helping artists use the latest AI tools and make thoughtful decisions with data-driven insights – technology plays an invaluable role in our success. The engineering team at Warner Music Group makes all of it a reality.\n\nWhat You'll Do\n• Reimagine and implement the future of tech for the music industry\n• Work as part of a dynamic and highly effective team\n• Own the creation and delivery of highly innovative products\n• Learn and grow as a professional through close collaboration with your team members and engineering leaders, and by being part of culture of continuous improvement and learning\n\nResponsibilities\n• Owning, defining the technical vision, and driving innovation for key technical systems in your area of ownership\n• Writing clean, optimized and reusable code\n• Delivering work following established standards and best practices, such as test automation, test coverage, etc\n• Creating clear, comprehensive technical design documents\n• Mentoring more junior engineers\n• Collaborating closely with key music industry stakeholders as well as colleagues in NYC, Los Angeles, and London\n\nRequirements\n• You have an undergraduate degree in Computer Science, Computer Engineering or other related field\n• You have 9+ years of experience in working for software development company as a Software Engineer\n• You have strong frontend development experience in React\n• You are able to successfully drive the optimal and efficient design and implementation of complex technical systems which span multiple teams\n• You write or refactor code with maintainability and optimization in mind , improve test coverage, and have sound judgment when making design tradeoff decisions. You also contribute high-quality code reviews.\n• You write comprehensive technical designs for complex systems, which clearly communicate technical tradeoffs and assumptions\n• You continuously improve quality of code and systems under your ownership not only through code, but also by defining technical best practices and efficient development processes\n• Your bias is towards action, and you always find ways to deliver better solutions more efficiently\n• You’re an empathetic team member who works well in a team environment and communicates effectively\n• You have a Bachelor’s degree, or above, in a relevant discipline including Computer Science, Computer Engineering, Electrical Engineering. Candidates with Bachelor’s or Master’s degrees in fields such as Physics or Mathematics may also be considered if they have highly relevant professional experience\n\nAbout Us\n\nAs the home to 300 Elektra, Asylum, Atlantic, East West, FFRR, Fueled by Ramen, Nonesuch, Parlophone, Rhino, Roadrunner, Sire, Warner Records, Warner Classics, and several other of the world’s premier recording labels, Warner Music Group champions emerging artists and global superstars alike. And our renowned publishing company, Warner Chappell Music, represents genre-spanning songwriters and producers through a catalogue of more than one million copyrights worldwide. We’re the home to WMX – the next generation services division that connects artists with fans and amplifies brands in creative, immersive, and engaging ways – and Alternative Distribution Alliance (ADA) – the ground-breaking global distribution company for independent artists and labels.\n\nTogether, we are Warner Music Group: Music With Vision & Voice.\n\nWMG is committed to inclusion and diversity in all aspects of our business. We are proud to be an equal opportunity workplace and will evaluate qualified applicants without regard to race, religious creed, color, age, sex, sexual orientation, gender, gender identity, gender expression, national origin, ancestry, marital status, medical condition as defined by state law (genetic characteristics or cancer), physical or mental disability, military service or veteran status, pregnancy, childbirth and related medical conditions, genetic information or any other characteristic protected by applicable federal, state or local law.\n\nCopyright © 2023 Warner Music Inc.\n\nLove this job and want to apply?\n\nClick the “Apply” link at the top of the page, or apply directly with your LinkedIn. Applying with LinkedIn will import all of the information you put in your profile, but will still allow you to upload a resume and cover letter.\n\nDon’t be discouraged if you don’t hear from us right away. We’re taking our time to review all resumes, and to find the best people for WMG.\n\nThanks for your interest in working for WMG. We love it here, and think you will, too.",
            "location": "Toronto, ON, Canada",
            "employmentType": "",
            "datePosted": "2 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/staff-frontend-software-engineer-at-warner-music-group-4077704194?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jobgether",
                    "url": "https://jobgether.com/offer/6738b5d7d0e293d41104440f-staff-frontend-software-engineer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Trabajo.org",
                    "url": "https://ca.trabajo.org/job-3026-63505e003beec32f3c86c6bc4cec685c?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "React"
                }
            ]
        },
        {
            "jobType": "staff_software_engineer",
            "title": "Staff Software Engineer - Fullstack - Websites Team",
            "company": "Toast",
            "description": "About Toast\n\nNow, more than ever, the Toast team is committed to our customers. Our focus is on building the restaurant platform that helps restaurants adapt, take control, and get back to what they do best: building the businesses they love. And because our technology is purpose-built for restaurants, by restaurant people, restaurants can trust that we’ll deliver on their needs for today while investing in experiences that will power their restaurant of the future.\n\nWho We Are\n\nThe Websites team is responsible for advancing and supporting Toast’s new restaurant website hosting product, as well as working closely with the integrated Online Ordering product/team. This group is highly product oriented, with a laser-focus on creating top tier consumer experiences for restaurants and their guests. Our product-line is relatively new but already used by millions of restaurant goers each day, so be prepared to innovate on products at a huge scale while ensuring stability and scalability.\n\nAbout this roll* (Responsibilities)\n\nYou will be in a unique position to work on a variety of different projects and have a strong voice in technology and product strategy. In this opportunity you will be looked-to by the team as the most senior technical contributor, and also expected to steer the group during challenging architectural and design decisions. This position is an exceptional opportunity for a smart, hands dirty, entrepreneurial engineer who wants to work with a smart team, modern stack, and solve real business problems via technology. As such you should be prepared to run experiments and iterate quickly. Responsibilities include:\n• Lead the evolution of our Websites product, delivering scalable solutions that have significant business impact\n• Drive continuous improvement of architecture, codebase and technical practice\n• Mentor and guide engineers, fostering a culture of continuous improvement, inclusivity, and engineering excellence\n• Set a bar for productivity and code quality with your contributions to the product\n• Build and maintain strong partnerships across lines of business, aligning technical solutions with strategic objectives.\n• Total commitment to being a great teammate\n\nDo you have the right ingredients*? (Qualities & Essential Skills)\n• 10+ years of experience developing fullstack web applications\n• Working knowledge of JS frameworks such as React\n• Working knowledge of CSS and frameworks such as Tailwind, Bootstrap, or similar\n• Working knowledge of backend technologies like Node.js, Java, and Kotlin\n• Experience building on top AWS services with other tools like Docker, and Git\n• Familiarity implementing designs provided by high-fidelity UX mocks in Figma, Sketch, etc.\n• Experience shipping and maintaining testable code bases, including API design and unit-testing frameworks\n• Passionate about making users happy and seeing people use your product in the wild.\n• Ability to embrace the agile mindset and understand that sometimes we need to ship features quickly and clean up the code later.\n• Comfortable with testing methodologies and frameworks\n\nOur Spread* of Total Rewards\nWe strive to provide competitive compensation and benefits programs that help to attract, retain, and motivate the best and brightest people in our industry. Our total rewards package goes beyond great earnings potential and provides the means to a healthy lifestyle with the flexibility to meet Toasters’ changing needs. Learn more about our benefits at https://careers.toasttab.com/toast-benefits.\n• Bread puns encouraged but not required\n\n#LI-Remote\n\nThe base salary range for this role is listed below. The starting salary will be determined based on skills and experience. In addition to base salary, our total rewards components include cash compensation (overtime, bonus/commissions if eligible), equity, and benefits.\nPay Range\n$119,000—$190,000 CAD\n\nWe are Toasters\n\nDiversity, Equity, and Inclusion is Baked into our Recipe for Success.\n\nAt Toast our employees are our secret ingredient. When they are powered to succeed, Toast succeeds.\n\nThe restaurant industry is one of the most diverse industries. We embrace and are excited by this diversity, believing that only through authenticity, inclusivity, high standards of respect and trust, and leading with humility will we be able to achieve our goals.\n\nBaking inclusive principles into our company and diversity into our design provides equitable opportunities for all and enhances our ability to be first in class in all aspects of our industry.\n\nBready* to make a change? Apply today!\n\nToast is committed to creating an accessible and inclusive hiring process. As part of this commitment, we strive to provide reasonable accommodations for persons with disabilities to enable them to access the hiring process. If you need an accommodation to access the job application or interview process, please contact candidateaccommodations@toasttab.com.",
            "location": "Canada",
            "employmentType": "",
            "datePosted": "",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Toast",
                    "url": "https://careers.toasttab.com/jobs/staff-software-engineer-fullstack-websites-team-canada?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "ZipRecruiter",
                    "url": "https://www.ziprecruiter.com/c/Super.com/Job/Staff-Software-Engineer-Fullstack-(Remote!)/-in-Toronto,ON?jid=895c675fcb5ee0fa&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/staff-software-engineer-fullstack-remote%21-at-super-com-4025678295?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jobgether",
                    "url": "https://jobgether.com/offer/66e81ec75ae7155b178b21f9-staff-software-engineer---fullstack-remote?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Built In",
                    "url": "https://builtin.com/job/staff-software-engineer-fullstack-remote/3267569?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Glassdoor",
                    "url": "https://www.glassdoor.ca/job-listing/staff-software-engineer-fullstack-websites-team-toast-JV_IC2281069_KO0,47_KE48,53.htm?jl=1009499764910&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Talent.com",
                    "url": "https://ca.talent.com/view?id=6cc212667a78&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Useparallel.com",
                    "url": "https://www.useparallel.com/app/candidate/job/66accbf30fa86703277f86f0?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Java"
                },
                {
                    "name": "CSS"
                },
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Kotlin"
                },
                {
                    "name": "Git"
                },
                {
                    "name": "React"
                },
                {
                    "name": "Bootstrap"
                },
                {
                    "name": "Node.js"
                },
                {
                    "name": "Docker"
                },
                {
                    "name": "AWS"
                },
                {
                    "name": "Figma"
                },
                {
                    "name": "Sketch"
                }
            ]
        },
        {
            "jobType": "staff_software_engineer",
            "title": "Staff Software Engineer - Incident Management",
            "company": "PagerDuty",
            "description": "PagerDuty empowers teams of all kinds to do the critical work that moves business forward through the PagerDuty Operations Cloud.\n\nVisit our careers site to explore life at PagerDuty, discover opportunities, and sign-up for job alerts!\n\nPagerDuty is seeking a Staff Software Engineer to join our Incident Management team. As a staff software engineer in our core product, you will be responsible for owning critical services within the PagerDuty product, and delivering innovative product features through continuous interaction across the Operations Cloud. This is an exciting opportunity to work alongside a high-performing team focused on having a major impact on incident lifecycle management at PagerDuty. The ideal candidate will have a strong full stack background and experience with distributed systems.\n\nPagerDuty is a flexible, hybrid workplace. We embrace and encourage in-person working as an integral part of our culture. Both our employees and external research tells us that co-located collaboration strengthens connections, drives innovation, and accelerates learning.\n\nThis role is expected to come into our Toronto office 1 time per month, so you can thrive in your new role and fully embrace being a Dutonian!\n\nKey Responsibilities\n• From day one, you’ll be designing, coding, testing and shipping front-end interfaces, APIs, or backend applications and microservices that ensure we deliver secure, highly reliable and scalable solutions to our customers.\n• Work closely with product managers, designers, and other stakeholders to gather requirements, prioritize tasks, and deliver features on time and within scope.\n• Be a mentor for colleagues and help promote knowledge-sharing\n• You will utilize best practices in software engineering to architect, code, test, and deploy high-quality solutions that meet customer requirements and adhere to internal standards.\n• Participate in your team’s on-call rotation, triaging and addressing production issues as they arise.\n• Conduct thorough testing and debugging to identify and resolve issues, ensuring the stability and performance of integrated solutions.\n• Participate in code reviews, knowledge-sharing sessions, and continuous improvement initiatives to foster a collaborative and innovative team environment.\n• Use your analytical skills to clarify questions, share your approach, and collaborate with your team to build and test elegant solutions.\n\nBasic Qualifications:\n• 12+ years of full-stack experience with modern programming languages\n• SaaS experience (B2B preferred)\n• Advanced knowledge with data structures, algorithms, object-oriented design, design patterns, and performance/scale considerations\n• Experience with any of the modern UI frameworks like React\n• Advanced knowledge experience working with relational databases including development, troubleshooting and performance optimization\n• Experience with multiple technology stacks: Cloud Dev, Platforms, Web Dev, Frameworks or service–oriented architecture\n\nPreferred Qualifications:\n• Experience building highly scalable products or platforms\n• Strong business acumen\n• Strong experience with AWS or other IaaS platforms\n• You are empathetic - you can clearly communicate your thoughts and opinions to others and facilitate these technical discussions to a successful outcome\n\nThe base salary range for this position is 156,000 - 232,000 CAD. This role may also be eligible for bonus, commission, equity, and/or benefits.\n\nOur base salary ranges are determined by role, level, and location. The range, which is subject to change based on primary work location, reflects the minimum and maximum base salary we expect to pay newly hired employees for the position. Within the range, we determine pay for an individual based on a number of factors including market location, job-related knowledge, skills/competencies and experience.\n\nYour recruiter can share more about the specific offerings for this role, as well as the salary range for your primary work location during the hiring process.\n\nNot sure if you qualify?\n\nApply anyway! We extend opportunities to a broad array of candidates, including those with diverse workplace experiences and backgrounds. Whether you're new to the corporate world, returning to work after a gap in employment, or simply looking to take the next step in your career path, we are excited to connect with you.\n\nWhere we work\n\nPagerDuty currently has offices in Atlanta, Lisbon, London, San Francisco, Santiago, Sydney, Tokyo, and Toronto. We offer a hybrid, flexible workplace. We also provide ample opportunities for in-person and virtual connection, like team offsites and volunteering events.\n\nHow we work\n\nOur values are deeply embedded in how we operate and the people we bring on board. You will see our values ingrained in how we support our customers, collaborate with our colleagues, develop our products and foster an inclusive and empathetic work culture.\n• Champion the Customer | Put users first to design great products and experiences.\n• Run Together | Build strong teams that amplify our impact on users.\n• Take the Lead | Disrupt and invent to be the first choice for users.\n• Ack + Own | Take ownership and action to deliver more efficiently to users.\n• Bring Your Self | Bring your best self to build empathy and trust with users.\n\nWhat we offer\n\nOne way we ensure our employees are inspired to do their best is through a comprehensive total rewards approach that supports them and their loved ones. As a global organization, our programs are competitive with industry standards and aligned with local laws and regulations. Learn more, including country-specific offerings, on our benefits site.\n\nYour package may include:\n• Competitive salary\n• Comprehensive benefits package from day one\n• Flexible work arrangements\n• Generous paid vacation time\n• Paid holidays and sick leave\n• Dutonian Wellness Days - scheduled company-wide paid days off in addition to PTO\n• Company equity*\n• ESPP (Employee Stock Purchase Program)*\n• Retirement or pension plan*\n• Paid parental leave - up to 22 weeks for pregnant parent, up to 12 weeks for non-pregnant parent (some countries have longer leave standards and we comply with local laws)*\n• HibernationDuty - an annual company paid week off when everyone at PagerDuty, with the exception of a small, coverage crew, is asked to take a much needed break to truly disconnect and recharge\n• Paid volunteer time off - 20 hours per year\n• Company-wide hack weeks\n• Mental wellness programs\n• Eligibility may vary by role, region, and tenure\n\nAbout PagerDuty\n\nPagerDuty, Inc. (NYSE:PD) is a global leader in digital operations management. The PagerDuty Operations Cloud revolutionizes how critical work gets done, and powers the agility that drives digital transformation. Customers rely on the PagerDuty Operations Cloud to compress costs, accelerate productivity, win revenue, sustain seamless digital experiences, and earn customer trust. More than half of the Fortune 500 and more than two thirds of the Fortune 100 trust PagerDuty including Cisco, Cox Automotive, DoorDash, Electronic Arts, Genentech, Shopify, Zoom and more.\n\nLed by CEO Jennifer Tejada, PagerDuty’s Board of Directors is 50% female and 62% URP representation. We strive to build a more equitable world by investing 1% each of company equity, product, and employee volunteer time.\n\nPagerDuty is Great Place to Work-certified™, a Fortune Best Workplace for Millennials, a Fortune Best Medium Workplace, a Fortune Best Workplace in Technology, and a top rated product on TrustRadius and G2.\n\nGo behind-the-scenes on our careers site and @pagerduty on Instagram.\n\nAdditional Information\n\nPagerDuty is committed to creating a diverse environment and is an equal opportunity employer. PagerDuty does not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, parental status, veteran status, or disability status.\n\nPagerDuty is committed to providing reasonable accommodations for qualified individuals with disabilities in our job application process. Should you require accommodation, please email accommodation@pagerduty.com and we will work with you to meet your accessibility needs.\n\nPagerDuty uses the E-Verify employment verification program.",
            "location": "Toronto, ON, Canada",
            "employmentType": "",
            "datePosted": "",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "PagerDuty Careers",
                    "url": "https://careers.pagerduty.com/jobs/staff-software-engineer-incident-management-toronto-ontario-canada?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Built In Toronto",
                    "url": "https://builtintoronto.com/job/staff-software-engineer-incident-management/2952767?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Ladders",
                    "url": "https://www.theladders.com/job/staff-software-engineer-incident-management-pagerduty-toronto-on_74317124?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jobs | Accel Job Board - Accel",
                    "url": "https://jobs.accel.com/companies/pagerduty/jobs/38822032-staff-software-engineer-incident-management?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Taro",
                    "url": "https://www.jointaro.com/jobs/pagerduty/staff-software-engineer-incident-management/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "JobOffer.com",
                    "url": "https://joboffer.com/jobs/Staff-Software-Engineer-Incident-Management-736c8d027bc54d06?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Notify.careers",
                    "url": "https://notify.careers/postings/214f1b0c-386b-4a37-8fe3-11b5e3ae05a8?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Jobrapido.com",
                    "url": "https://ca.jobrapido.com/jobpreview/6987034595061399552?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Go"
                },
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "React"
                },
                {
                    "name": "AWS"
                }
            ]
        },
        {
            "jobType": "staff_software_engineer",
            "title": "Staff Software Engineer, Infotainment Platform",
            "company": "Rivian",
            "description": "About Rivian\n\nRivian is on a mission to keep the world adventurous forever. This goes for the emissions-free Electric Adventure Vehicles we build, and the curious, courageous souls we seek to attract.\n\nAs a company, we constantly challenge what’s possible, never simply accepting what has always been done. We reframe old problems, seek new solutions and operate comfortably in areas that are unknown. Our backgrounds are diverse, but our team shares a love of the outdoors and a desire to protect it for future generations.\n\nRole Summary\n\nThe Infotainment team is at the core reimagining what mobility can be. They are responsible for building the ecosystem that delivers a beautiful and intuitive in-vehicle experience to Rivian drivers and passengers.\n\nResponsibilities\n• Be responsible for the design, development, and deployment of embedded platform for the Infotainment application (i.e., displays, cameras, graphics, power management, audio, Bluetooth, etc)\n• Assist in software-design and code reviews while assisting other developers on technical issues, design choices and decision making\n• Analysis of requirements, the architecture, design, development, code review, quality assurance and deployment of entire software engineering life cycle\n• Work closely with other development and cross-functional team members such as Connected Car, Self-Driving, Common Software, and Powertrain team\n\nQualifications\n• Bachelor’s degree in Computer Science, Software Engineering, Applied Mathematics, Electrical Engineering, Computer Engineering, or related field. Master’s degree preferred.\n• Demonstrated 8+ years’ experience of developing embedded system software from requirements gathering through to implementation and maintenance\n• Proficiency with modern C and/or C++ programming skills\n• Experience with POSIX-based embedded systems; Preferred Linux and Android\n• Deep knowledge of one or more technical areas such as displays, cameras, graphics, power management, audio, and Bluetooth\n• Preferred experience with scripting languages such as PERL or Python\n• Preferred experience with low-level interfaces typical of embedded systems: such as I2C, SPI, GPIO, UART, USB, PCIe, SDIO, UFS, MDIO\n\nPay Disclosure\n\nSalary Range for British Columbia Based Applicants: $137,300 CAD - $171,600 CAD (actual compensation will be determined based on experience, location, and other factors permitted by law).\n\nBenefits Summary: Rivian provides robust supplementary medical/Rx, dental and vision insurance for employees, their spouse or domestic partner, and children. Coverage is effective on the first day of employment, and Rivian covers all of the premiums.\n\nEqual Opportunity\n\nRivian is an equal opportunity employer and complies with all applicable federal, state, and local fair employment practices laws. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, ancestry, sex, sexual orientation, gender, gender expression, gender identity, genetic information or characteristics, physical or mental disability, marital/domestic partner status, age, military/veteran status, medical condition, or any other characteristic protected by law.\n\nRivian is committed to ensuring that our hiring process is accessible for persons with disabilities. If you have a disability or limitation, such as those covered by the Americans with Disabilities Act, that requires accommodations to assist you in the search and application process, please email us at candidateaccommodations@rivian.com.\nCandidate Data Privacy\n\nRivian may collect, use and disclose your personal information or personal data (within the meaning of the applicable data protection laws) when you apply for employment and/or participate in our recruitment processes (“Candidate Personal Data”). This data includes contact, demographic, communications, educational, professional, employment, social media/website, network/device, recruiting system usage/interaction, security and preference information. Rivian may use your Candidate Personal Data for the purposes of (i) tracking interactions with our recruiting system; (ii) carrying out, analyzing and improving our application and recruitment process, including assessing you and your application and conducting employment, background and reference checks; (iii) establishing an employment relationship or entering into an employment contract with you; (iv) complying with our legal, regulatory and corporate governance obligations; (v) recordkeeping; (vi) ensuring network and information security and preventing fraud; and (vii) as otherwise required or permitted by applicable law.\n\nRivian may share your Candidate Personal Data with (i) internal personnel who have a need to know such information in order to perform their duties, including individuals on our People Team, Finance, Legal, and the team(s) with the position(s) for which you are applying; (ii) Rivian affiliates; and (iii) Rivian’s service providers, including providers of background checks, staffing services, and cloud services.\n\nRivian may transfer or store internationally your Candidate Personal Data, including to or in the United States, Canada, the United Kingdom, and the European Union and in the cloud, and this data may be subject to the laws and accessible to the courts, law enforcement and national security authorities of such jurisdictions.\n\nPlease see our Candidate Data Privacy Notice for more information.\n\nPlease note that we are currently not accepting applications from third party application services.\n\nTo any candidates interested in a position with Rivian, please be aware of recruiting phishing scams impersonating Rivian. As a general practice, Rivian recruiting does not conduct interviews or communicate with candidates over Microsoft Teams.\n\nPlease visit Rivian’s Careers page for career opportunities at Rivian. If you believe you may have been a victim of identity theft because of the phishing scam impersonating Rivian, please go to www.IdentityTheft.gov where you can report and recover from identity theft. For more information about recommended computer security practices, please go to resources on the FTC’s consumer information site where you can learn how to protect yourselves online and avoid phishing attacks.",
            "location": "Vancouver, BC, Canada",
            "employmentType": "",
            "datePosted": "",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Rivian Careers",
                    "url": "https://careers.rivian.com/careers-home/jobs/17915?lang=en-us&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Indeed",
                    "url": "https://emplois.ca.indeed.com/viewjob?jk=2d059581647e379a&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Climate Change Jobs",
                    "url": "https://climatechangejobs.com/jobs/76872159-staff-software-engineer-infotainment-platform?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Taro",
                    "url": "https://www.jointaro.com/jobs/turo/staff-software-engineer-platform/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Ladders",
                    "url": "https://www.theladders.com/job/staff-software-engineer-rivian-vancouver-bc_73279159?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "SimplyHired",
                    "url": "https://www.simplyhired.ca/job/usqtAaG8-EP0YLsw0ZUe7pQtSNIOSqxjtryuBT3HCwXuxGBibs5ShA?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Levels.fyi",
                    "url": "https://levels.fyi/jobs?jobId=122009393691534022&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Adzuna",
                    "url": "https://www.adzuna.ca/details/4920818849?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Python"
                },
                {
                    "name": "C++"
                },
                {
                    "name": "C"
                },
                {
                    "name": "R"
                }
            ]
        },
        {
            "jobType": "staff_software_engineer",
            "title": "Senior Staff / Principal Software Developer",
            "company": "Intuit",
            "description": "Come join Intuit's community of 'Builders' as a Senior Staff/ Principal Software Developer and help us power prosperity around the world.\n\nIntuit's Builders co-create with cross-functional partners and exhibit extreme ownership in the end-to-end product development lifecycle, including ideation, rapid experimentation, customer research, and execution. AI-native experiences are designed from the ground up with AI in mind, taking advantage of the unique benefits of AI to solve customers’ problems. Our Builders are customer obsessed, demonstrate boundaryless collaboration & focus on transformative AI.This is a hybrid role with the expectation of working from our Toronto office 2 days per week.\nResponsibilities\n• Drives velocity in the organization by accelerating customer, business, and technology outcomes by identifying and driving key opportunities across the company.\n• Drives significant technology initiatives end-to-end, including horizontal layers of the architecture.\n• Understands customer behaviors and partners with cross-functional partners to influence and drive end-to-end solutions for customer problems.\n• Drives design and implementation of durable software solutions that will solve critical customer problems in a fast-paced environment\n• Executes with a boundaryless mindset and contributes to solutions outsideof their primary area of ownership.\n• Knowledge of building AI native applications\n• Guides the applicability of AI to customer problemsthrough a deep understanding of the value and limitations of AI technologies.\n• Understands evaluation tools to validate and measure the accuracyof solutions.\n• High-level understanding of how AI models work, the different types of AI models that exist, and their pros and cons.\n• Understanding of the latest tools and technologies that apply AI to real-world applications.\n• Creates robust, scalable, and secure technical designs, effectively implementing them to balance short-term and long-term objectives, ensuring high availability and optimal performance of applications\n• Passionate for continuous learning, experimenting, and applyingcutting-edge technology and software paradigms to solve customer problems\n\nTeam/ Collaboration:\n• Partners with other groups both inside and outside of Intuit for cross-functional design, development, and integration\n• Works with cross-functional team members from Architecture, Product Management, and Operations to design, develop, test, and release features\n\nCommunity:\n• Contributes to standards, patterns, and best practices that improve the engineering community.\n• Provide perspective on leading industry trends, recommendations on new and emerging technologies, technology prototypes, patent proposals, and engineering process improvements.",
            "location": "Toronto, ON, Canada",
            "employmentType": "",
            "datePosted": "",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Intuit Careers",
                    "url": "https://jobs.intuit.com/job/toronto/senior-staff-principal-software-developer/27595/71143472032?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "LinkedIn",
                    "url": "https://ca.linkedin.com/jobs/view/senior-staff-principal-software-developer-at-intuit-4046734513?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Glassdoor",
                    "url": "https://www.glassdoor.ca/job-listing/senior-staff-principal-software-developer-intuit-JV_IC2281069_KO0,41_KE42,48.htm?jl=1009498159033&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Taro",
                    "url": "https://www.jointaro.com/jobs/intuit/senior-staff-software-developer-ceed5411/?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "SimplyHired",
                    "url": "https://www.simplyhired.ca/job/M6nHVWuuUtKQOB9ulDXH9glG5PIuCjrjtT-ZGVUKE9ddlCddQzSKCw?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Talent.com",
                    "url": "https://ca.talent.com/view?id=e48ea437c1d5&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Ladders",
                    "url": "https://www.theladders.com/job/senior-staff-software-application-developer-marvell-toronto-on_73962201?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Ca.bebee.com",
                    "url": "https://ca.bebee.com/job/3d237c7acada0c81e2386a8931aedb13?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "C"
                },
                {
                    "name": "R"
                }
            ]
        },
        {
            "jobType": "staff_software_engineer",
            "title": "Staff Software Engineer",
            "company": "Affinity.co",
            "description": "With our growing customer base and our expansion into new markets and use cases, we have more to build than ever at Affinity as we execute on our vision to put relationship intelligence at every professional's fingertips.\n\nAs a Staff Software Engineer, you’ll have the opportunity to evolve the implementation of the spreadsheet-like interfaces that are core to how our users manage and view their data in the application. This is a particularly complex domain because the data modeling needs to be extremely flexible to support unique use cases. You’ll also guide the future of the new automations offering, which enables configuring workflows to manipulate data using if-this-then-that rules.\n\nAdditionally, this team owns:\n• Relationship Intelligence, including the calculation and surfacing of relationship strengths between people based on ingested datasets\n• The embedded Analytics platform that provides customizable data visualizations\n• Search, notifications, and reminders functionality\n\nIn this role, you will:\n• Become the deep expert in the above product areas, lead the technical design of critical initiatives, and be an active code contributor during execution phases\n• Ensure our software is architecturally consistent and delivers a snappy user experience\n• Collaborate across team boundaries to align on and coordinate change, as this team manages data models that have touchpoints upstream and downstream\n• Research and propose new technologies or architectures that drive the team’s critical systems while considering the larger implications\n• Mentor other engineers to uplevel them individually and the team as a whole\n• Promote operational excellence with focus on high reliability, performance, and scalability\n• Work at all levels of the stack, with a preference for backend development\n\nQualifications:\n\nDon’t meet every single requirement? Studies have shown that women and people of color are less likely to apply to jobs unless they meet every qualification. At Affinity, we are dedicated to building a diverse, inclusive, and authentic workplace, so if you’re excited about this role, but your past experience doesn’t perfectly align with the qualifications above, we encourage you to apply anyways. You may be just the right candidate for this or other roles.\n• You have ~10+ years of experience in software engineering, with at least 3+ years of experience leading teams that deliver end-to-end systems\n• You’re comfortable troubleshooting across network, application, caching, queuing, load-balancing, storage, and distributed services layers\n• You’re an expert in one or more OOP languages and modern OOD, with some experience using Ruby\n• You know how to diagnose and improve performance issues systematically\n• You can effectively contribute to technical strategy and roadmaps on product-oriented teams\n• You communicate nuanced ideas clearly, whether you're explaining technical decisions in writing or brainstorming in real time\n• You demonstrate strong ownership instincts and sweat the details\n• You have strong convictions, weakly held, and assume validation and iteration are a given to produce the best results\n• You’re excited to work on a cross-functional team, partnering with product stakeholders, other teams, and subject matter experts\n\nNice to have:\n• A combination of startup and brand-name SaaS companies experience\n• Experience with event-driven architecture and Kafka\n• Experience with React and Typescript\n\nTech stack:\n\nOur platform is built with React and TypeScript on the front end, with Ruby and PostgreSQL on the back end. We’re leaning into event-driven architecture using Kafka. Our infrastructure is hosted by AWS and runs on Kubernetes.\n\nHow we work:\n\nOur culture is a key part of how we operate as well as our hiring process:\n• We iterate quickly. As such, you must be comfortable embracing ambiguity, be able to cut through it, and deliver incremental value to our customers each sprint.\n• We are candid, transparent, and speak our minds while simultaneously caring personally with each person we interact with.\n• We make data-driven decisions and make the best decision for the moment based on the information available.\n\nJoin us in enabling every professional on the planet to succeed by harnessing the power of their relationships.\n\nIf you’d want to learn more about our values click here.\n\nWhat you'll enjoy at Affinity:\n• We live our values as playmakers, obsessed with learning, caring personally about our colleagues and clients, are radically open-minded, and take pride in everything we do.\n• We pay your medical, dental, and vision insurance with comprehensive PPO and HMO plans. And provide flexible personal & sick days. We want our team to be happy and healthy :)\n• We offer a 401k plan to help you plan for retirement.\n• We provide an annual budget for you to spend on education and offer a comprehensive L&D program – after all, one of our core values is that we're #obsessedwithlearning!\n• We support our employee's overall health and well-being and reimburse monthly for things such as; transportation, Home Internet, Meals, and Wellness memberships/equipment.\n• Virtual team building and socials. Keeping people connected is essential.\n\nPlease note that the role compensation details below reflect the base salary only and do not include any equity or benefits. This represents the salary range that Affinity believes, in good faith, at the time of this posting, that it will pay for the posted job.\n\nA reasonable estimate of the current range is $160,000 - $230,000 CAD. Within the range, individual pay depends on various factors including geographical location and review of experience, knowledge, skills, abilities of the applicant.",
            "location": "Toronto, ON, Canada",
            "employmentType": "",
            "datePosted": "",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Affinity",
                    "url": "https://www.affinity.co/company/careers/job?gh_jid=6019831003&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Greenhouse",
                    "url": "https://boards.greenhouse.io/tenstorrent/jobs/4536971007?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Capital One",
                    "url": "https://www.capitalonecareers.ca/job/toronto/staff-software-engineer/1733/67975047440?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Lever",
                    "url": "https://jobs.lever.co/eqbank/f7b1be43-b2aa-4b95-b14e-972b55777e5e?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Indeed",
                    "url": "https://www.indeed.com/viewjob?jk=60840ddc18a93597&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "ZipRecruiter",
                    "url": "https://www.ziprecruiter.com/c/Ripple/Job/Staff-Software-Engineer/-in-Toronto,ON?jid=b1ce93ff20a85fe9&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Wellfound",
                    "url": "https://wellfound.com/jobs/3140227-staff-software-engineer?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Join-Our-Team.applytojobs.ca",
                    "url": "https://join-our-team.applytojobs.ca/development/30428?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Ruby"
                },
                {
                    "name": "TypeScript"
                },
                {
                    "name": "C"
                },
                {
                    "name": "SQL"
                },
                {
                    "name": "R"
                },
                {
                    "name": "React"
                },
                {
                    "name": "PostgreSQL"
                },
                {
                    "name": "Kubernetes"
                },
                {
                    "name": "AWS"
                },
                {
                    "name": "Kafka"
                }
            ]
        },
        {
            "jobType": "staff_software_engineer",
            "title": "Staff Software Engineer, Platform Engineering",
            "company": "Lime",
            "description": "Lime is the world's largest shared electric vehicle company. We’re on a mission to build a future where transportation is shared, affordable and carbon-free. Our electric bikes and scooters have powered 400+ million rides in 250+ cities on 5 continents, replacing an estimated 100+ million car trips. Named a Time 100 Most Influential Company and Fast Company Brand That Matters, we achieved a fully profitable year in 2022, becoming the first in our industry to reach this milestone.\n\nThe Platform Engineering team at Lime is responsible for enabling software engineers to build, test and deploy Lime products globally at scale through resilient, cost effective and secure infrastructure, and high-quality developer and data science tooling.\n\nThe ideal candidate will have experience working in an evolving startup environment. You will be an in the moment problem solver with the ability to think about the short term and long term plan. You're energized about building and scaling and being part of a forward-thinking organization.\n\nWhat you'll do:\n• Identify, define, and solve strategically essential technical problems, including architecting and building highly scalable foundational platforms, leading new product initiatives, and revamping existing core application experiences.\n• Implement and manage security controls to ensure compliance with SOX and other relevant regulations\n• Mentor and lead other engineers at Lime. Identify and develop future leaders.\n• Support audits and due diligence processes related to infrastructure\n• Advise Lime’s leadership team on key technology adoption and process improvements.\n• Contribute to shaping the overall engineering culture at the company.\n\nAbout you:\n• 7+ years of industry professional software development experience and a track record of building impactful products or systems.\n• Skilled at writing logical and maintainable code, and providing clear feedback in code reviews.\n• Owner’s mindset. You’re a self-starter and get things across the finish line.\n• Strong influencer. You motivate and empower your team to go above and beyond.\n• Technical proficiency to understand and contribute to the design and implementation of projects and ideas.\n• Excellent communication and effective prioritization skills in working with competing priorities.\n\nPreferred Experience:\n• Experience in a pre-IPO or public company environment is a plus\n• Operating Ruby on Rails in a cloud environment for 2+ years is a plus\n\nThe anticipated salary range for this position is CA$153,000 - CA$210,000. Annual performance bonus, equity and benefits may be provided as part of the compensation package, depending on the position offered. Not all candidates will be eligible for the upper end of the salary range. Exact salary will ultimately depend on multiple factors, which may include the candidate’s location of residence, the successful candidate's skills, experience and other qualifications. In addition to base salary, some roles may be eligible for a variable performance-bonus based on a combination of company performance, employee performance, and management discretion.\n\n#LI-Remote\n\n#LI-PP1\n\nWhy Lime?\n\nWhen you join Lime, you join a global community of smart, caring, talented individuals working together to deliver world-changing results; striving to create an experience that enables Limers to do their best work. Here are some ways we support and invest in our team:\n\nCompetitive salaries, performance-based annual bonus and pre-IPO equity\n\nHealth and wellness offerings for all team members starting day one including access to top-tier fitness and mindfulness apps\n\nFlexible vacation policies with ample paid holidays tailored to country of residence\n\nFully-paid leave following the birth or adoption of a child and financial, medical and educational support for Limers pursuing parenthood\n\nSupport for retirement and financial goals with unlimited access to financial advisors\n\nUnlimited, complimentary use of our vehicles in hundreds of cities around the world\n\nProfessional growth opportunities through quarterly learning days and top-tier tools\n\nOpportunities to connect across teams and locations to network, socialize and volunteer\n\nCulture of belonging with Employee Resource Groups that engage and promote cultural awareness and DEI training across all functions\n\nConsistent recognition of great work through meaningful rewards and career advancements\n\nBenefits and perks vary depending on the nature of your employment and country of residence. Terms and conditions may apply.\n\nIf you want to make an impact, Lime is the place for you. Not sure if you meet all the qualifications? If this role excites you we encourage you to apply. Explore all opportunities on our career page.\n\nLime is an Equal Opportunity Employer, but that’s just the start. We believe different perspectives help us grow and achieve more. That’s why we’re dedicated to hiring and developing the most talented and globally diverse team – which includes individuals with different backgrounds, abilities, identities and experiences. Applicants who require a reasonable accommodation for any part of the application or hiring process can email recruiting-operations@li.me for assistance.\n\nUse of artificial intelligence or an LLM such as ChatGPT during the interview process will be grounds for rejection of your application.",
            "location": "Canada",
            "employmentType": "",
            "datePosted": "8 days ago",
            "salaryRange": "",
            "jobProviders": [
                {
                    "name": "Built In Ottawa",
                    "url": "https://builtinottawa.com/job/staff-software-engineer-platform-engineering/3295080?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "Companies | NGP Capital Job Board - NGP Capital",
                    "url": "https://jobs.ngpcap.com/companies/lime/jobs/40716986-staff-software-engineer-platform-engineering?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                },
                {
                    "name": "WhatJobs",
                    "url": "https://en-ca.whatjobs.com/job/Staff-Software-Engineer/Canada/80585294?utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic"
                }
            ],
            "skills": [
                {
                    "name": "Ruby"
                },
                {
                    "name": "C"
                },
                {
                    "name": "R"
                },
                {
                    "name": "Ruby on Rails"
                }
            ]
        }
    ]
}